
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 60-user network, expiring 14 Aug 2026
Serial number: 401909327398
  Licensed to: Zirui Song
               MIT Sloan

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do AN_1_CleanFinalSample.do 

. /***********
>         Globals for Paths
>         ***********/
. 
. *** Change repodir and overleafdir paths for different users
. global repodir "/Users/zrsong/MIT Dropbox/Zirui Song/Research Projects/MPS_In
> terest Deductibility and Debt Contracting"

. global overleafdir "/Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax In
> cidence and Loan Contract Terms"

. 
. global datadir "$repodir/3. Data"

. global rawdir "$datadir/Raw"

. global cleandir "$datadir/Processed"

. 
. global tabdir "$overleafdir/Tables"

. global figdir "$overleafdir/Figures"

. 
. global codedir "$repodir/4. Code/Replication"

. 
. 
. /***********
>         Clean Data for Regressions
>         ***********/
. 
. use "$cleandir/tranche_level_ds_compa.dta", clear       

.         
. do "$codedir/AN_StataFunctions.do"

. *** Functions to Clean and Label Data ***
. 
. *** clean ratings
. capture program drop clean_rating

. program define clean_rating
  1.         rename currentratingsymbol sp_rating
  2.         replace sp_rating = subinstr(sp_rating, " prelim", "", .) 
  3. 
.         gen sp_rating_num = .
  4.         replace sp_rating_num = 21 if sp_rating == "AAA"
  5.         * replace sp_rating_num = 21 if sp_rating == "AA+" (only 1 obs)
.         replace sp_rating_num = 20 if sp_rating == "AA" | sp_rating == "ilAA"
>  | sp_rating == "AA+"
  6.         replace sp_rating_num = 19 if sp_rating == "AA-"
  7.         replace sp_rating_num = 18 if sp_rating == "A+"
  8.         replace sp_rating_num = 17 if sp_rating == "A"
  9.         replace sp_rating_num = 16 if sp_rating == "A-" | sp_rating == "A-
> 1+" | sp_rating == "A-2" | sp_rating == "A-3"
 10.         replace sp_rating_num = 15 if sp_rating == "BBB+"
 11.         replace sp_rating_num = 14 if sp_rating == "BBB"
 12.         replace sp_rating_num = 13 if sp_rating == "BBB-"
 13.         replace sp_rating_num = 12 if sp_rating == "BB+"
 14.         replace sp_rating_num = 11 if sp_rating == "BB"
 15.         replace sp_rating_num = 10 if sp_rating == "BB-"
 16.         replace sp_rating_num = 9  if sp_rating == "B+"
 17.         replace sp_rating_num = 8  if sp_rating == "B"
 18.         replace sp_rating_num = 7  if sp_rating == "B-"
 19.         replace sp_rating_num = 6  if sp_rating == "CCC+"
 20.         replace sp_rating_num = 5  if sp_rating == "CCC"
 21.         replace sp_rating_num = 4  if sp_rating == "CCC-"
 22.         replace sp_rating_num = 3  if sp_rating == "CC"
 23.         replace sp_rating_num = 2  if sp_rating == "C"
 24.         replace sp_rating_num = 1  if sp_rating == "D"
 25.         replace sp_rating_num = 0 if sp_rating_num == .
 26.         
.         gen not_rated = 1 if sp_rating_num == 0
 27.         replace not_rated = 0 if not_rated == .
 28. 
.         label var sp_rating_num "S\&P Rating"
 29.         label var not_rated "Not Rated"
 30. end

. 
. *** clean variables
. capture program drop clean_variables 

. program define clean_variables
  1.         * gen logged bps
.         gen log_margin_bps = log(margin_bps)
  2.         gen log_at = log(at)
  3.         gen log_deal_amount_converted = log(deal_amount_converted)
  4. 
.         local controls "log_at market_to_book ppent_by_at debt_by_at cash_by_
> at dividend_payer ret_vol cash_etr"
  5.         local deal_controls "leveraged maturity log_deal_amount_converted 
> secured_dummy tranche_type_dummy tranche_o_a_dummy sponsor_dummy"
  6. 
.         * generate interaction between controls and post
.         foreach var in `controls' {
  7.                 gen `var'_post = `var' * post
  8.                 gen `var'_treated = `var' * treated
  9.                 gen `var'_treated_loss = `var' * treated_loss
 10.         }
 11.         foreach var in `deal_controls' {
 12.                 gen `var'_post = `var' * post
 13.         }
 14. 
.         local controls_post "log_at_post market_to_book_post ppent_by_at_post
>  debt_by_at_post cash_by_at_post  dividend_payer_post ret_vol_post cash_etr_p
> ost"
 15.         local deal_controls_post "leveraged_post maturity_post log_deal_am
> ount_converted_post secured_dummy_post tranche_type_dummy_post tranche_o_a_du
> mmy_post sponsor_dummy_post"
 16. 
.         local controls_treated "log_at_treated market_to_book_treated ppent_b
> y_at_treated debt_by_at_treated cash_by_at_treated dividend_payer_treated ret
> _vol_treated cash_etr_treated"
 17.         local controls_treated_loss "log_at_treated_loss market_to_book_tr
> eated_loss ppent_by_at_treated_loss debt_by_at_treated_loss cash_by_at_treate
> d_loss dividend_payer_treated_loss ret_vol_treated_loss cash_etr_treated_loss
> "
 18. 
.         * winsorize at 1% and 99%
.         foreach var in margin_bps log_margin_bps `controls' `deal_controls' `
> controls_post' `controls_treated' `controls_treated_loss' {
 19.                 winsor2 `var', cuts(1 99) replace
 20.         }
 21.         * for each _sweep variable, replace missing to zero
.         foreach var of varlist *_sweep {
 22.                 replace `var' = 0 if `var' == .
 23.         }
 24. 
.         * label controls and treated, post, and treated_post
.         label variable log_at "Ln(Total Assets)"
 25.         label variable cash_flows_by_at "Cash Flows / Assets"
 26.         label variable market_to_book "Market to Book Ratio"
 27.         label variable ppent_by_at "PP\&E / Assets"
 28.         label variable debt_by_at "Debt / Assets"
 29.         label variable cash_by_at "Cash / Assets"
 30.         label variable sales_growth "Sales Growth"
 31.         label variable dividend_payer "Dividend Payer"
 32.         label variable z_score "Z-Score"
 33.         label variable nol "Net Operating Loss"
 34.         label variable ret_buy_and_hold "Buy and Hold Return"
 35.         label variable ret_vol "Return Volatility"
 36.         label variable cash_etr "Cash ETR"
 37.         label variable roa "Return on Assets"
 38.         label variable cashflow_byat "Cash Flow / Assets"
 39. 
.         label variable leveraged "Leveraged"
 40.         label variable maturity "Maturity (Years)"
 41.         label variable deal_amount_converted "Loan Amount ($Million)"
 42.         label variable log_deal_amount_converted "Ln(Loan Amount)"
 43.         label variable margin_bps "Interest Spread (Basis Points)"
 44.         label variable number_of_lead_arrangers "Number of Lead Arrangers"
 45.         label variable secured_dummy "Secured"
 46.         label variable tranche_type_dummy "Term Loan"
 47.         label variable tranche_o_a_dummy "Origination"
 48.         label variable sponsor_dummy "Sponsored"
 49.         label variable total_asset "Assets ($Billion)"
 50. 
.         label variable treated "Excess Interest (30\% Rule)"
 51.         label variable post "Post"
 52.         label variable treated_post "Excess Interest (30\% Rule) x Post"
 53.         label variable treated_loss "Excess Interest (Loss)"
 54.         label variable treated_loss_post "Excess Interest (Loss) x Post"
 55. end

. 
. capture program drop generate_treat_vars

. program define generate_treat_vars
  1.         
.         gen treated_all = 1 if treated == 1 | treated_loss == 1
  2.         replace treated_all = 0 if treated_all == .
  3.         
.         * generate continuous measures
.         gen excess_interest_scaled_post = excess_interest_scaled * post
  4. 
.         *** quartile splits
.         gen ie_excess_q4 = 1 if excess_interest_scaled > 0.89999
  5.         gen ie_excess_q3 = 1 if inrange(excess_interest_scaled, 0.6, 0.899
> 99)
  6.         gen ie_excess_q2 = 1 if inrange(excess_interest_scaled, 0.300001, 
> 0.59999)
  7.         gen ie_excess_q1 = 1 if inrange(excess_interest_scaled, 0.00001, 0
> .3)
  8. 
.         forv i = 1/4 {
  9.                 replace ie_excess_q`i' = 0 if excess_interest_scaled == 0
 10.                 replace ie_excess_q`i' = 0 if ie_excess_q`i' == .
 11.         }
 12. 
.         forv i = 1/4 {
 13.                 gen ie_excess_q`i'_post = ie_excess_q`i' * post
 14.         }
 15. 
.         label var excess_interest_scaled "Excess Interest Expense (Scaled)"
 16.         label var excess_interest_scaled_post "Excess Interest Expense (Sc
> aled) x Post"
 17.         label var ie_excess_q1 "Excess Interest Expense Q1"
 18.         label var ie_excess_q2 "Excess Interest Expense Q2"
 19.         label var ie_excess_q3 "Excess Interest Expense Q3"
 20.         label var ie_excess_q4 "Excess Interest Expense Q4"
 21.         label var ie_excess_q1_post "Excess Interest Expense Q1 x Post"
 22.         label var ie_excess_q2_post "Excess Interest Expense Q2 x Post"
 23.         label var ie_excess_q3_post "Excess Interest Expense Q3 x Post"
 24.         label var ie_excess_q4_post "Excess Interest Expense Q4 x Post"
 25. 
.         local treat_cts "excess_interest_scaled excess_interest_scaled_post"
 26.         local treat_quartiles "ie_excess_q1 ie_excess_q1_post ie_excess_q2
>  ie_excess_q2_post ie_excess_q3 ie_excess_q3_post ie_excess_q4 ie_excess_q4_p
> ost"
 27.         local treat_vars "treated treated_post treated_loss treated_loss_p
> ost"  
 28. end

. 
end of do-file

. clean_rating
(13 real changes made)
(3,476 missing values generated)
(0 real changes made)
(2 real changes made)
(6 real changes made)
(15 real changes made)
(24 real changes made)
(224 real changes made)
(115 real changes made)
(198 real changes made)
(142 real changes made)
(154 real changes made)
(296 real changes made)
(237 real changes made)
(185 real changes made)
(278 real changes made)
(76 real changes made)
(17 real changes made)
(4 real changes made)
(5 real changes made)
(0 real changes made)
(0 real changes made)
(6 real changes made)
(1,492 real changes made)
(1,984 missing values generated)
(1,984 real changes made)

. clean_variables
(3,260 real changes made)
(3,133 real changes made)
(3,175 real changes made)
(3,401 real changes made)
(3,224 real changes made)

. generate_treat_vars
(2,540 missing values generated)
(2,540 real changes made)
(2,974 missing values generated)
(3,393 missing values generated)
(3,349 missing values generated)
(3,252 missing values generated)
(2,540 real changes made)
(712 real changes made)
(2,540 real changes made)
(809 real changes made)
(2,540 real changes made)
(853 real changes made)
(2,540 real changes made)
(434 real changes made)

. 
. save "$cleandir/tranche_level_ds_compa_wlabel.dta", replace
file /Users/zrsong/MIT Dropbox/Zirui Song/Research Projects/MPS_Interest
    Deductibility and Debt Contracting/3.
    Data/Processed/tranche_level_ds_compa_wlabel.dta saved

. 
end of do-file
