
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 60-user network, expiring 14 Aug 2026
Serial number: 401909327398
  Licensed to: Zirui Song
               MIT Sloan

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do AN_3_SampleCompositionAnalysis.do 

. /***********
>         Globals for Paths
>         ***********/
. 
. *** Change repodir and overleafdir paths for different users
. global repodir "/Users/zrsong/MIT Dropbox/Zirui Song/Research Projects/MPS_In
> terest Deductibility and Debt Contracting"

. global overleafdir "/Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax In
> cidence and Loan Contract Terms"

. 
. global datadir "$repodir/3. Data"

. global rawdir "$datadir/Raw"

. global cleandir "$datadir/Processed"

. 
. global tabdir "$overleafdir/Tables"

. global figdir "$overleafdir/Figures"

. 
. global codedir "$repodir/4. Code/Replication"

. 
. /***********
>         Sample Composition Analysis
>         ***********/
. 
. /***********
>         Clean Data
>         ***********/
. 
. use "$cleandir/dta_analysis.dta", clear

. 
. gen log_at = log(at)

. gen cash_flows_by_at = oancf/at
(6 missing values generated)

. gen ppent_by_at = ppent/at
(6 missing values generated)

. gen debt_by_at = debt/at
(13 missing values generated)

. gen cash_by_at = che/at

. 
. gen roa = ni/at
variable roa already defined
r(110);

end of do-file
r(110);
