
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 60-user network, expiring 14 Aug 2026
Serial number: 401909327398
  Licensed to: Zirui Song
               MIT Sloan

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do AN_4_MainResults.do 

. /***********
>         Globals for Paths
>         ***********/
. 
. *** Change repodir and overleafdir paths for different users
. global repodir "/Users/zrsong/MIT Dropbox/Zirui Song/Research Projects/MPS_In
> terest Deductibility and Debt Contracting"

. global overleafdir "/Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax In
> cidence and Loan Contract Terms"

. 
. global datadir "$repodir/3. Data"

. global rawdir "$datadir/Raw"

. global cleandir "$datadir/Processed"

. 
. global tabdir "$overleafdir/Tables"

. global figdir "$overleafdir/Figures"

. 
. global codedir "$repodir/4. Code/Replication"

. 
. /***********
>         Main Results
>         ***********/
. 
. use "$cleandir/tranche_level_ds_compa_wlabel.dta", clear

. 
. *** VIF Analysis ***
. local controls "log_at market_to_book ppent_by_at debt_by_at cash_by_at divid
> end_payer ret_vol cash_etr"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dum
> my tranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. local controls_post "log_at_post market_to_book_post ppent_by_at_post debt_by
> _at_post cash_by_at_post dividend_payer_post ret_vol_post cash_etr_post"   

. 
. reg margin_bps excess_interest_scaled excess_interest_scaled_post `deal_contr
> ols' i.year i.ff_48 i.sp_rating_num

      Source |       SS           df       MS      Number of obs   =     3,476
-------------+----------------------------------   F(77, 3398)     =     52.49
       Model |  58156233.6        77  755275.761   Prob > F        =    0.0000
    Residual |  48897642.2     3,398  14390.1243   R-squared       =    0.5432
-------------+----------------------------------   Adj R-squared   =    0.5329
       Total |   107053876     3,475  30806.8707   Root MSE        =    119.96

------------------------------------------------------------------------------
  margin_bps | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |    84.7032   8.600365     9.85   0.000     67.84079    101.5656
excess_int~t |  -45.93892   11.74403    -3.91   0.000    -68.96501   -22.91284
   leveraged |   89.40721   6.221217    14.37   0.000      77.2095    101.6049
    maturity |   8.737766    1.62324     5.38   0.000     5.555141    11.92039
log_deal_a~d |   -19.0215   1.902062   -10.00   0.000     -22.7508    -15.2922
secured_du~y |   63.83168   5.450975    11.71   0.000     53.14416     74.5192
tranche_ty~y |   79.58165   4.240175    18.77   0.000      71.2681    87.89521
tranche_o_~y |   20.58203   4.885283     4.21   0.000     11.00364    30.16042
sponsor_du~y |   90.54226    5.90218    15.34   0.000     78.97008    102.1144
             |
        year |
       2015  |  -4.534263   7.540118    -0.60   0.548    -19.31789    10.24936
       2016  |   12.26477   8.088303     1.52   0.130    -3.593658    28.12321
       2017  |  -4.459124   7.766965    -0.57   0.566    -19.68752    10.76927
       2018  |  -5.720615   7.920499    -0.72   0.470    -21.25004    9.808809
       2019  |   3.584695   8.477836     0.42   0.672    -13.03748    20.20687
       2022  |   11.93229   8.403405     1.42   0.156    -4.543954    28.40853
       2023  |   15.13503   9.515389     1.59   0.112    -3.521436    33.79149
             |
       ff_48 |
          2  |   106.1166     86.216     1.23   0.218    -62.92385    275.1571
          3  |   85.26493   89.40339     0.95   0.340    -90.02492    260.5548
          4  |   99.10843    97.1354     1.02   0.308    -91.34129    289.5582
          5  |   147.2949   92.30739     1.60   0.111    -33.68876    328.2785
          6  |   98.00374   89.34937     1.10   0.273    -77.18021    273.1877
          7  |   165.7485   86.20792     1.92   0.055    -3.276114    334.7731
          8  |   151.9806   89.25413     1.70   0.089    -23.01666    326.9778
          9  |   138.5515   86.43286     1.60   0.109     -30.9142    308.0171
         10  |   113.2008   87.77695     1.29   0.197    -58.90013    285.3018
         11  |   127.5602   85.88136     1.49   0.138    -40.82412    295.9446
         12  |   120.4027    86.3543     1.39   0.163     -48.9089    289.7143
         13  |   157.1024   86.10016     1.82   0.068      -11.711    325.9157
         14  |   121.1189    85.9213     1.41   0.159    -47.34378    289.5815
         15  |   92.71873   90.17587     1.03   0.304     -84.0857    269.5232
         16  |   122.1975   92.89052     1.32   0.188    -59.92943    304.3245
         17  |    166.621   89.19155     1.87   0.062    -8.253565    341.4955
         18  |   126.7576   86.85069     1.46   0.145    -43.52726    297.0425
         19  |   80.22235   89.25466     0.90   0.369    -94.77591    255.2206
         20  |   116.0606   110.6192     1.05   0.294    -100.8263    332.9474
         21  |   122.3801   85.95732     1.42   0.155    -46.15321    290.9134
         22  |   121.2183   88.16712     1.37   0.169     -51.6477    294.0842
         23  |   125.8756   86.01942     1.46   0.143    -42.77947    294.5306
         24  |   105.8862   86.56278     1.22   0.221    -63.83416    275.6066
         25  |   151.6742   98.66184     1.54   0.124    -41.76834    345.1168
         26  |   139.1172   98.90675     1.41   0.160    -54.80553      333.04
         27  |   245.8202   110.6108     2.22   0.026      28.9497    462.6907
         28  |   203.3883   94.31156     2.16   0.031     18.47518    388.3014
         29  |   225.6482   89.24441     2.53   0.012     50.67002    400.6263
         30  |   171.9607   85.80245     2.00   0.045     3.731092    340.1903
         32  |   132.7696   85.98681     1.54   0.123    -35.82151    301.3607
         33  |    159.282   86.97575     1.83   0.067    -11.24806    329.8121
         34  |   125.6008   85.45998     1.47   0.142    -41.95737     293.159
         35  |   161.1551   87.47803     1.84   0.066    -10.35979      332.67
         36  |   129.5619   85.61504     1.51   0.130     -38.3003    297.4241
         37  |    128.741   85.88658     1.50   0.134    -39.65358    297.1356
         38  |   125.5566   86.62665     1.45   0.147    -44.28898    295.4022
         39  |   86.20746   86.49415     1.00   0.319    -83.37837    255.7933
         40  |   116.2324   88.08163     1.32   0.187    -56.46592    288.9308
         41  |   117.9456   85.86995     1.37   0.170    -50.41636    286.3076
         42  |   103.3382   85.70827     1.21   0.228    -64.70679    271.3832
         43  |   117.0431   85.74562     1.37   0.172     -51.0751    285.1613
         44  |   109.8834   85.96713     1.28   0.201    -58.66917    278.4359
         49  |   82.06794   88.36385     0.93   0.353    -91.18374    255.3196
             |
sp_rating_~m |
          1  |   253.5173   50.81873     4.99   0.000     153.8789    353.1557
          4  |   235.2083   55.08963     4.27   0.000     127.1961    343.2204
          5  |    171.918   60.66311     2.83   0.005     52.97811    290.8579
          6  |   166.9491   30.24533     5.52   0.000     107.6482    226.2499
          7  |   67.54518   14.84286     4.55   0.000     38.44335    96.64701
          8  |   36.07773   8.413348     4.29   0.000       19.582    52.57347
          9  |  -3.148926   9.919778    -0.32   0.751    -22.59826    16.30041
         10  |  -32.63632   8.973652    -3.64   0.000    -50.23062   -15.04202
         11  |  -41.18741    8.23939    -5.00   0.000    -57.34207   -25.03275
         12  |  -37.32045   10.74099    -3.47   0.001    -58.37991   -16.26099
         13  |  -2.904539   11.17351    -0.26   0.795    -24.81202    19.00294
         14  |  -8.374365   10.16957    -0.82   0.410    -28.31346    11.56473
         15  |   9.755589   12.22122     0.80   0.425    -14.20609    33.71727
         16  |   8.617512   9.685884     0.89   0.374    -10.37324    27.60826
         17  |   7.896675   25.45512     0.31   0.756    -42.01222    57.80557
         18  |   9.664009   31.96846     0.30   0.762    -53.01535    72.34337
         19  |   71.93433   49.33172     1.46   0.145    -24.78852    168.6572
         20  |   -47.3617   86.15403    -0.55   0.583    -216.2807    121.5573
             |
       _cons |   37.99967   86.62794     0.44   0.661    -131.8485    207.8478
------------------------------------------------------------------------------

. estat vif

    Variable |       VIF       1/VIF  
-------------+----------------------
excess_int~d |      2.34    0.427666
excess_int~t |      2.41    0.415612
   leveraged |      2.15    0.464471
    maturity |      1.35    0.743060
log_deal_a~d |      1.46    0.686689
secured_du~y |      1.79    0.557889
tranche_ty~y |      1.08    0.925376
tranche_o_~y |      1.14    0.878026
sponsor_du~y |      1.34    0.748580
        year |
       2015  |      1.73    0.578814
       2016  |      1.61    0.621417
       2017  |      1.67    0.599870
       2018  |      1.87    0.534066
       2019  |      1.67    0.599875
       2022  |      1.76    0.568289
       2023  |      1.63    0.613348
       ff_48 |
          2  |     48.71    0.020531
          3  |     11.59    0.086252
          4  |      4.58    0.218317
          5  |      7.08    0.141225
          6  |     11.58    0.086356
          7  |     46.74    0.021393
          8  |     12.10    0.082631
          9  |     40.08    0.024950
         10  |     19.08    0.052423
         11  |     65.09    0.015364
         12  |     42.48    0.023542
         13  |     55.84    0.017909
         14  |     75.04    0.013327
         15  |      9.56    0.104608
         16  |      6.57    0.152092
         17  |     11.54    0.086662
         18  |     26.85    0.037244
         19  |     12.10    0.082630
         20  |      2.55    0.392335
         21  |     66.62    0.015010
         22  |     16.07    0.062244
         23  |     57.18    0.017490
         24  |     34.72    0.028805
         25  |      4.05    0.246811
         26  |      4.07    0.245591
         27  |      2.55    0.392395
         28  |      5.55    0.180226
         29  |     12.65    0.079078
         30  |     95.98    0.010419
         32  |     63.82    0.015669
         33  |     24.88    0.040185
         34  |    180.82    0.005530
         35  |     20.51    0.048764
         36  |    120.80    0.008278
         37  |     75.91    0.013173
         38  |     34.27    0.029184
         39  |     36.66    0.027280
         40  |     17.09    0.058501
         41  |     72.61    0.013773
         42  |     91.24    0.010961
         43  |     93.59    0.010685
         44  |     62.36    0.016035
         49  |     14.54    0.068792
sp_rating_~m |
          1  |      1.07    0.930285
          4  |      1.05    0.949686
          5  |      1.02    0.978713
          6  |      1.08    0.929883
          7  |      1.14    0.878652
          8  |      1.26    0.794847
          9  |      1.20    0.834912
         10  |      1.24    0.809183
         11  |      1.28    0.782772
         12  |      1.18    0.847491
         13  |      1.18    0.846274
         14  |      1.34    0.745187
         15  |      1.15    0.866461
         16  |      1.37    0.731926
         17  |      1.07    0.931777
         18  |      1.06    0.942775
         19  |      1.01    0.987214
         20  |      1.03    0.969914
-------------+----------------------
    Mean VIF |     22.93

. reg margin_bps excess_interest_scaled excess_interest_scaled_post `deal_contr
> ols' `controls' i.year i.ff_48 i.sp_rating_num

      Source |       SS           df       MS      Number of obs   =     3,476
-------------+----------------------------------   F(85, 3390)     =     49.49
       Model |  59282458.1        85  697440.684   Prob > F        =    0.0000
    Residual |  47771417.7     3,390  14091.8636   R-squared       =    0.5538
-------------+----------------------------------   Adj R-squared   =    0.5426
       Total |   107053876     3,475  30806.8707   Root MSE        =    118.71

------------------------------------------------------------------------------
  margin_bps | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   74.62813    9.27885     8.04   0.000     56.43542    92.82083
excess_int~t |  -49.54736   11.65806    -4.25   0.000    -72.40489   -26.68983
   leveraged |   83.34108     6.2765    13.28   0.000     71.03498    95.64719
    maturity |   9.263584   1.620293     5.72   0.000     6.086735    12.44043
log_deal_a~d |  -16.17368   2.229783    -7.25   0.000    -20.54554   -11.80183
secured_du~y |    59.5822   5.421324    10.99   0.000      48.9528    70.21159
tranche_ty~y |   79.01926   4.215223    18.75   0.000     70.75463     87.2839
tranche_o_~y |   21.30582   4.856317     4.39   0.000     11.78421    30.82743
sponsor_du~y |   94.96401   5.908434    16.07   0.000     83.37956    106.5485
      log_at |  -5.756013    2.07293    -2.78   0.006    -9.820332   -1.691694
market_to_~k |  -6.993319   2.100138    -3.33   0.001    -11.11098   -2.875654
 ppent_by_at |   4.913992   11.93601     0.41   0.681    -18.48852     28.3165
  debt_by_at |   52.84379   11.53073     4.58   0.000      30.2359    75.45167
  cash_by_at |    45.0881   21.43562     2.10   0.036     3.060049    87.11614
dividend_p~r |   9.422819   4.934903     1.91   0.056    -.2528686    19.09851
     ret_vol |   292.2214   52.70863     5.54   0.000     188.8775    395.5653
    cash_etr |   11.68319   5.494071     2.13   0.034     .9111673    22.45522
             |
        year |
       2015  |  -3.026192   7.474441    -0.40   0.686    -17.68106    11.62868
       2016  |   5.930587   8.055818     0.74   0.462    -9.864167    21.72534
       2017  |  -12.70252   7.801303    -1.63   0.104    -27.99825    2.593216
       2018  |   -6.10215   7.870914    -0.78   0.438    -21.53437    9.330067
       2019  |  -4.833718   8.528271    -0.57   0.571    -21.55479    11.88736
       2022  |   8.234138   8.482739     0.97   0.332    -8.397664    24.86594
       2023  |   2.518332   9.757962     0.26   0.796    -16.61375    21.65042
             |
       ff_48 |
          2  |    138.878   85.46601     1.62   0.104    -28.69211    306.4481
          3  |   130.4807   88.68534     1.47   0.141    -43.40145    304.3629
          4  |   127.8093   96.21535     1.33   0.184    -60.83663    316.4553
          5  |   181.0013   91.50202     1.98   0.048     1.596562     360.406
          6  |   134.2901   88.59777     1.52   0.130    -39.42036    308.0005
          7  |    199.924   85.48349     2.34   0.019     32.31961    367.5284
          8  |   188.3244   88.52011     2.13   0.033     14.76615    361.8826
          9  |   165.4078   85.63982     1.93   0.054    -2.503129    333.3187
         10  |   150.6839   87.02853     1.73   0.083    -19.94977    321.3176
         11  |   158.3311   85.17224     1.86   0.063    -8.663048    325.3253
         12  |   162.4454   85.66298     1.90   0.058    -5.510938    330.4017
         13  |     187.44   85.41335     2.19   0.028      19.9731    354.9069
         14  |   150.3256   85.16191     1.77   0.078    -16.64832    317.2995
         15  |   131.8896   89.39494     1.48   0.140    -43.38379    307.1631
         16  |   156.0362    92.0817     1.69   0.090    -24.50503    336.5775
         17  |   202.0341   88.42539     2.28   0.022     28.66163    375.4066
         18  |   155.7036   86.09105     1.81   0.071    -13.09203    324.4992
         19  |   106.8881   88.48293     1.21   0.227    -66.59714    280.3734
         20  |   146.6085   109.8107     1.34   0.182    -68.69338    361.9105
         21  |   154.4321   85.18961     1.81   0.070    -12.59615    321.4603
         22  |   151.2638   87.34705     1.73   0.083    -19.99437    322.5221
         23  |   153.6338    85.2602     1.80   0.072     -13.5328    320.8004
         24  |   141.1338    85.8274     1.64   0.100    -27.14494    309.4124
         25  |   172.3194   97.71834     1.76   0.078    -19.27344    363.9122
         26  |   166.4559   98.09576     1.70   0.090    -25.87689    358.7887
         27  |   267.6269   109.6776     2.44   0.015     52.58593     482.668
         28  |     222.35   93.56791     2.38   0.018     38.89473    405.8052
         29  |   256.9652   88.73045     2.90   0.004     82.99465    430.9358
         30  |   191.0248   85.21059     2.24   0.025      23.9555    358.0942
         32  |   164.5599   85.26424     1.93   0.054    -2.614663    331.7344
         33  |   189.2041   86.22915     2.19   0.028     20.13765    358.2705
         34  |   158.5682   84.72952     1.87   0.061    -7.557884    324.6944
         35  |   194.0937   86.79361     2.24   0.025      23.9206    364.2668
         36  |   164.9602   84.93527     1.94   0.052    -1.569325    331.4897
         37  |   161.7716   85.20832     1.90   0.058    -5.293313    328.8365
         38  |   163.9373   85.92993     1.91   0.057    -4.542405     332.417
         39  |   111.0979   85.69802     1.30   0.195    -56.92712    279.1229
         40  |   141.2077   87.37134     1.62   0.106    -30.09817    312.5135
         41  |   148.6689   85.21492     1.74   0.081     -18.4089    315.7467
         42  |   133.4248    84.9445     1.57   0.116    -33.12286    299.9724
         43  |   149.9955    85.0177     1.76   0.078    -16.69568    316.6866
         44  |   142.3608   85.24897     1.67   0.095     -24.7838    309.5054
         49  |   112.7228   87.63282     1.29   0.198    -59.09576    284.5413
             |
sp_rating_~m |
          1  |   249.3468   50.33172     4.95   0.000     150.6633    348.0304
          4  |   204.3472   54.80166     3.73   0.000     96.89955    311.7948
          5  |   154.4983    60.1437     2.57   0.010     36.57669    272.4199
          6  |   133.2792   30.36644     4.39   0.000     73.74078    192.8176
          7  |   52.97324   14.85609     3.57   0.000     23.84543    82.10105
          8  |   24.26681   8.546709     2.84   0.005     7.509582    41.02403
          9  |   -10.4313   9.925908    -1.05   0.293    -29.89267    9.030066
         10  |   -36.3384   8.982024    -4.05   0.000    -53.94913   -18.72767
         11  |   -38.3156   8.296652    -4.62   0.000    -54.58255   -22.04866
         12  |  -36.50041   10.74484    -3.40   0.001    -57.56744   -15.43338
         13  |   4.289109   11.26546     0.38   0.703    -17.79867    26.37688
         14  |  -.9744054   10.37132    -0.09   0.925    -21.30907    19.36026
         15  |   27.31886    12.7438     2.14   0.032     2.332553    52.30516
         16  |   21.07131   10.29903     2.05   0.041      .878363    41.26426
         17  |   22.74514    25.6086     0.89   0.375    -27.46472    72.95501
         18  |   31.44025   32.13821     0.98   0.328    -31.57198    94.45248
         19  |   97.96966   49.92391     1.96   0.050     .0856497    195.8537
         20  |  -4.113938   85.67279    -0.05   0.962    -172.0895    163.8616
             |
       _cons |  -5.868953   86.68551    -0.07   0.946    -175.8301    164.0922
------------------------------------------------------------------------------

. estat vif

    Variable |       VIF       1/VIF  
-------------+----------------------
excess_int~d |      2.78    0.359794
excess_int~t |      2.42    0.413023
   leveraged |      2.24    0.446867
    maturity |      1.37    0.730308
log_deal_a~d |      2.04    0.489314
secured_du~y |      1.81    0.552318
tranche_ty~y |      1.09    0.916956
tranche_o_~y |      1.15    0.870115
sponsor_du~y |      1.37    0.731513
      log_at |      2.85    0.350562
market_to_~k |      1.49    0.672249
 ppent_by_at |      1.90    0.526997
  debt_by_at |      1.46    0.684580
  cash_by_at |      1.58    0.634233
dividend_p~r |      1.50    0.667082
     ret_vol |      1.89    0.530386
    cash_etr |      1.22    0.821897
        year |
       2015  |      1.73    0.576822
       2016  |      1.63    0.613455
       2017  |      1.72    0.582276
       2018  |      1.89    0.529606
       2019  |      1.72    0.580514
       2022  |      1.83    0.546149
       2023  |      1.75    0.571144
       ff_48 |
          2  |     48.88    0.020460
          3  |     11.65    0.085838
          4  |      4.59    0.217900
          5  |      7.11    0.140743
          6  |     11.63    0.086007
          7  |     46.94    0.021306
          8  |     12.16    0.082266
          9  |     40.18    0.024887
         10  |     19.15    0.052223
         11  |     65.37    0.015297
         12  |     42.68    0.023428
         13  |     56.11    0.017821
         14  |     75.28    0.013284
         15  |      9.59    0.104237
         16  |      6.60    0.151567
         17  |     11.58    0.086343
         18  |     26.94    0.037119
         19  |     12.15    0.082335
         20  |      2.56    0.389882
         21  |     66.82    0.014965
         22  |     16.10    0.062103
         23  |     57.36    0.017434
         24  |     34.85    0.028694
         25  |      4.06    0.246386
         26  |      4.09    0.244493
         27  |      2.56    0.390828
         28  |      5.58    0.179307
         29  |     12.77    0.078339
         30  |     96.66    0.010345
         32  |     64.08    0.015605
         33  |     24.98    0.040037
         34  |    181.51    0.005509
         35  |     20.61    0.048510
         36  |    121.40    0.008237
         37  |     76.30    0.013106
         38  |     34.43    0.029044
         39  |     36.75    0.027214
         40  |     17.18    0.058223
         41  |     73.02    0.013695
         42  |     91.51    0.010927
         43  |     93.95    0.010644
         44  |     62.62    0.015968
         49  |     14.60    0.068495
sp_rating_~m |
          1  |      1.08    0.928718
          4  |      1.06    0.939802
          5  |      1.03    0.975053
          6  |      1.11    0.903360
          7  |      1.16    0.858908
          8  |      1.33    0.754270
          9  |      1.22    0.816598
         10  |      1.26    0.790934
         11  |      1.32    0.756003
         12  |      1.21    0.829331
         13  |      1.23    0.815261
         14  |      1.43    0.701627
         15  |      1.28    0.780340
         16  |      1.58    0.633952
         17  |      1.11    0.901559
         18  |      1.09    0.913507
         19  |      1.06    0.943953
         20  |      1.04    0.960511
-------------+----------------------
    Mean VIF |     21.05

. reg margin_bps excess_interest_scaled excess_interest_scaled_post `deal_contr
> ols' `controls' `controls_post' i.year i.ff_48 i.sp_rating_num

      Source |       SS           df       MS      Number of obs   =     3,476
-------------+----------------------------------   F(93, 3382)     =     45.33
       Model |  59398296.2        93  638691.357   Prob > F        =    0.0000
    Residual |  47655579.6     3,382  14090.9461   R-squared       =    0.5548
-------------+----------------------------------   Adj R-squared   =    0.5426
       Total |   107053876     3,475  30806.8707   Root MSE        =    118.71

------------------------------------------------------------------------------
  margin_bps | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   82.30305   9.908489     8.31   0.000     62.87582    101.7303
excess_int~t |  -69.04148   14.51316    -4.76   0.000    -97.49694   -40.58602
   leveraged |   82.47069   6.294711    13.10   0.000     70.12887    94.81251
    maturity |   9.169267   1.627934     5.63   0.000     5.977432     12.3611
log_deal_a~d |  -16.04252   2.234926    -7.18   0.000    -20.42447   -11.66058
secured_du~y |   60.08224   5.456741    11.01   0.000      49.3834    70.78109
tranche_ty~y |   79.05732   4.217215    18.75   0.000     70.78877    87.32587
tranche_o_~y |   22.11279   4.878632     4.53   0.000     12.54742    31.67815
sponsor_du~y |   94.28842   5.934392    15.89   0.000     82.65306    105.9238
      log_at |  -4.422584   2.466223    -1.79   0.073    -9.258023     .412855
market_to_~k |  -4.135051   2.937117    -1.41   0.159    -9.893756    1.623653
 ppent_by_at |   .6716479   14.94325     0.04   0.964    -28.62706    29.97036
  debt_by_at |   39.58016   15.16901     2.61   0.009     9.838813    69.32151
  cash_by_at |   23.54175   28.38324     0.83   0.407    -32.10829    79.19179
dividend_p~r |   12.66405   6.380324     1.98   0.047      .154369    25.17373
     ret_vol |   280.8782   66.30251     4.24   0.000     150.8811    410.8752
    cash_etr |    15.8306   7.309291     2.17   0.030     1.499522    30.16167
 log_at_post |  -3.072441    2.96943    -1.03   0.301      -8.8945    2.749619
market_to_~t |  -6.151212   4.331193    -1.42   0.156    -14.64323     2.34081
ppent_by_~st |   5.019863   19.32501     0.26   0.795    -32.87002    42.90975
debt_by_at~t |   34.13057   22.86336     1.49   0.136    -10.69682    78.95797
cash_by_at~t |   42.28888   43.17044     0.98   0.327    -42.35391    126.9317
dividend_p~t |  -8.984797   9.549723    -0.94   0.347    -27.70861    9.739016
ret_vol_post |   34.92864   110.7714     0.32   0.753    -182.2571    252.1144
cash_etr_p~t |  -15.15814   15.57621    -0.97   0.331    -45.69788     15.3816
             |
        year |
       2015  |  -3.562961   7.487743    -0.48   0.634    -18.24392      11.118
       2016  |   6.339471    8.09311     0.78   0.433    -9.528411    22.20735
       2017  |  -12.12184   7.876781    -1.54   0.124    -27.56558    3.321891
       2018  |   18.79637   29.80723     0.63   0.528    -39.64564    77.23838
       2019  |   18.88151   30.55563     0.62   0.537    -41.02788    78.79089
       2022  |   33.20267   31.20188     1.06   0.287    -27.97379    94.37913
       2023  |   27.73368    32.3243     0.86   0.391    -35.64347    91.11083
             |
       ff_48 |
          2  |   132.4596   85.61709     1.55   0.122    -35.40687    300.3261
          3  |   130.0825   88.79886     1.46   0.143    -44.02241    304.1874
          4  |   126.0069   96.42852     1.31   0.191    -63.05723    315.0709
          5  |   181.1068   91.57774     1.98   0.048     1.553427    360.6601
          6  |   130.0271   88.75096     1.47   0.143     -43.9839     304.038
          7  |   195.3967   85.60403     2.28   0.023      27.5558    363.2376
          8  |   183.6636   88.64333     2.07   0.038     9.863696    357.4636
          9  |   161.7336   85.79827     1.89   0.060    -6.488077    329.9554
         10  |   145.4618   87.17274     1.67   0.095    -25.45481    316.3784
         11  |   153.6383   85.32347     1.80   0.072    -13.65251    320.9291
         12  |   156.4311   85.80483     1.82   0.068    -11.80351    324.6656
         13  |   181.3917   85.57335     2.12   0.034     13.61101    349.1725
         14  |   145.8053   85.30585     1.71   0.088    -21.45095    313.0615
         15  |    127.929   89.54438     1.43   0.153    -47.63758    303.4956
         16  |   151.5172   92.15544     1.64   0.100    -29.16883    332.2032
         17  |   198.1588   88.55966     2.24   0.025     24.52296    371.7947
         18  |   149.4344   86.21329     1.73   0.083    -19.60107    318.4698
         19  |   104.4808   88.58938     1.18   0.238    -69.21339    278.1749
         20  |   135.3794   109.9248     1.23   0.218    -80.14636    350.9052
         21  |   151.4563   85.30607     1.78   0.076    -15.80041    318.7129
         22  |   147.1557   87.49341     1.68   0.093    -24.38961     318.701
         23  |   149.1928   85.42864     1.75   0.081    -18.30416    316.6898
         24  |   138.6098   85.91179     1.61   0.107    -29.83451    307.0541
         25  |   169.6359   97.88417     1.73   0.083     -22.2822    361.5541
         26  |   161.7972   98.16975     1.65   0.099    -30.68085    354.2753
         27  |   262.2463   110.0547     2.38   0.017     46.46592    478.0267
         28  |   216.5737    93.6915     2.31   0.021     32.87595    400.2714
         29  |   250.8245   88.94033     2.82   0.005     76.44225    425.2068
         30  |   185.1472   85.37282     2.17   0.030      17.7596    352.5347
         32  |     159.26   85.41935     1.86   0.062    -8.218798    326.7388
         33  |   185.5613   86.39835     2.15   0.032     16.16299    354.9596
         34  |   153.0872   84.87157     1.80   0.071    -13.31761    319.4919
         35  |    189.601   86.89271     2.18   0.029     19.23342    359.9685
         36  |   160.2801   85.08011     1.88   0.060    -6.533522    327.0938
         37  |   157.8165   85.35095     1.85   0.065    -9.528219    325.1611
         38  |     160.19   86.06395     1.86   0.063    -8.552625    328.9327
         39  |   107.0613     85.813     1.25   0.212    -61.18933    275.3119
         40  |   132.2301   87.49805     1.51   0.131    -39.32436    303.7845
         41  |   144.6111   85.35295     1.69   0.090    -22.73752    311.9597
         42  |   128.2494   85.06043     1.51   0.132    -38.52565    295.0245
         43  |   143.3305   85.18831     1.68   0.093    -23.69525    310.3563
         44  |   136.9816   85.40246     1.60   0.109    -30.46408    304.4273
         49  |   107.4167   87.80177     1.22   0.221    -64.73321    279.5666
             |
sp_rating_~m |
          1  |   254.5314   50.44335     5.05   0.000     155.6288    353.4339
          4  |   207.8475   55.08717     3.77   0.000     99.84002    315.8551
          5  |   154.8347   60.40639     2.56   0.010     36.39799    273.2715
          6  |   136.9201    30.5473     4.48   0.000     77.02706    196.8132
          7  |    54.9064   14.91814     3.68   0.000     25.65691    84.15589
          8  |   25.73129   8.592827     2.99   0.003     8.883629    42.57895
          9  |  -9.785491    9.93731    -0.98   0.325    -29.26923    9.698252
         10  |  -35.98233   9.002685    -4.00   0.000    -53.63359   -18.33107
         11  |   -38.3242   8.330468    -4.60   0.000    -54.65746   -21.99094
         12  |  -36.58138   10.76551    -3.40   0.001    -57.68894   -15.47383
         13  |   4.868036   11.29039     0.43   0.666    -17.26865    27.00472
         14  |   .3694912   10.41452     0.04   0.972    -20.04991    20.78889
         15  |   27.95825   12.75648     2.19   0.028     2.947056    52.96945
         16  |   22.73628   10.34528     2.20   0.028     2.452647    43.01991
         17  |   21.61124   25.68976     0.84   0.400    -28.75778    71.98026
         18  |   31.84682   32.16622     0.99   0.322    -31.22038    94.91402
         19  |   95.73177   50.24149     1.91   0.057    -2.775001    194.2385
         20  |  -4.015889   86.51802    -0.05   0.963    -173.6488     165.617
             |
       _cons |  -11.93777   87.37925    -0.14   0.891    -183.2593    159.3837
------------------------------------------------------------------------------

. estat vif

    Variable |       VIF       1/VIF  
-------------+----------------------
excess_int~d |      3.17    0.315500
excess_int~t |      3.75    0.266486
   leveraged |      2.25    0.444256
    maturity |      1.38    0.723421
log_deal_a~d |      2.05    0.487033
secured_du~y |      1.83    0.545136
tranche_ty~y |      1.09    0.916030
tranche_o_~y |      1.16    0.862117
sponsor_du~y |      1.38    0.725081
      log_at |      4.04    0.247652
market_to_~k |      2.91    0.343681
 ppent_by_at |      2.97    0.336208
  debt_by_at |      2.53    0.395544
  cash_by_at |      2.76    0.361717
dividend_p~r |      2.51    0.399046
     ret_vol |      2.98    0.335172
    cash_etr |      2.15    0.464330
 log_at_post |     40.07    0.024954
market_to_~t |      6.31    0.158453
ppent_by_~st |      3.71    0.269216
debt_by_at~t |      6.18    0.161807
cash_by_at~t |      4.09    0.244497
dividend_p~t |      4.19    0.238727
ret_vol_post |     10.61    0.094264
cash_etr_p~t |      2.65    0.377701
        year |
       2015  |      1.74    0.574737
       2016  |      1.65    0.607775
       2017  |      1.75    0.571133
       2018  |     27.08    0.036926
       2019  |     22.11    0.045219
       2022  |     24.77    0.040364
       2023  |     19.21    0.052045
       ff_48 |
          2  |     49.05    0.020386
          3  |     11.68    0.085613
          4  |      4.61    0.216923
          5  |      7.12    0.140501
          6  |     11.67    0.085705
          7  |     47.07    0.021244
          8  |     12.19    0.082032
          9  |     40.33    0.024794
         10  |     19.21    0.052047
         11  |     65.61    0.015242
         12  |     42.83    0.023349
         13  |     56.33    0.017753
         14  |     75.54    0.013239
         15  |      9.63    0.103883
         16  |      6.61    0.151315
         17  |     11.62    0.086076
         18  |     27.02    0.037011
         19  |     12.18    0.082132
         20  |      2.57    0.389047
         21  |     67.01    0.014923
         22  |     16.16    0.061892
         23  |     57.59    0.017364
         24  |     34.92    0.028636
         25  |      4.07    0.245535
         26  |      4.10    0.244109
         27  |      2.58    0.388130
         28  |      5.59    0.178823
         29  |     12.83    0.077965
         30  |     97.04    0.010305
         32  |     64.32    0.015548
         33  |     25.08    0.039877
         34  |    182.13    0.005491
         35  |     20.66    0.048396
         36  |    121.82    0.008209
         37  |     76.56    0.013062
         38  |     34.54    0.028952
         39  |     36.85    0.027139
         40  |     17.23    0.058051
         41  |     73.26    0.013650
         42  |     91.77    0.010897
         43  |     94.34    0.010600
         44  |     62.85    0.015910
         49  |     14.66    0.068227
sp_rating_~m |
          1  |      1.08    0.924552
          4  |      1.08    0.930024
          5  |      1.03    0.966528
          6  |      1.12    0.892637
          7  |      1.17    0.851722
          8  |      1.34    0.746147
          9  |      1.23    0.814672
         10  |      1.27    0.787257
         11  |      1.33    0.749829
         12  |      1.21    0.826096
         13  |      1.23    0.811611
         14  |      1.44    0.695772
         15  |      1.28    0.778739
         16  |      1.59    0.628257
         17  |      1.12    0.895814
         18  |      1.10    0.911858
         19  |      1.07    0.931996
         20  |      1.06    0.941775
-------------+----------------------
    Mean VIF |     21.18

. *** *** *** 
. 
. ******************      Table 4: Main Results (Industry x Year FE) **********
> ********
. reghdfe margin_bps excess_interest_scaled excess_interest_scaled_post `deal_c
> ontrols', absorb(year#ff_48 sp_rating_num) vce(cluster gvkey)
(dropped 29 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =      3,447
Absorbing 2 HDFE groups                           F(   9,   1195) =     136.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5895
                                                  Adj R-squared   =     0.5515
                                                  Within R-sq.    =     0.3904
Number of clusters (gvkey)   =      1,196         Root MSE        =   117.5665

                              (Std. err. adjusted for 1,196 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   80.35339   14.98994     5.36   0.000     50.94387    109.7629
excess_int~t |  -39.97139   19.81916    -2.02   0.044    -78.85562   -1.087155
   leveraged |   96.23855   8.472882    11.36   0.000     79.61517    112.8619
    maturity |   9.173013   2.509717     3.65   0.000     4.249072    14.09695
log_deal_a~d |  -19.47792   2.638186    -7.38   0.000    -24.65391   -14.30193
secured_du~y |   58.05174   7.287126     7.97   0.000     43.75475    72.34872
tranche_ty~y |   76.86082   4.687905    16.40   0.000     67.66338    86.05826
tranche_o_~y |   17.96154   5.695454     3.15   0.002     6.787334    29.13574
sponsor_du~y |   88.95166   9.271032     9.59   0.000     70.76235     107.141
       _cons |   169.9665   22.86701     7.43   0.000     125.1026    214.8305
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
    year#ff_48 |       266           0         266     |
 sp_rating_num |        19           1          18     |
-------------------------------------------------------+

. estimates store m1

. 
. reghdfe margin_bps excess_interest_scaled excess_interest_scaled_post `contro
> ls' `deal_controls', absorb(year#ff_48 sp_rating_num) vce(cluster gvkey)
(dropped 29 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =      3,447
Absorbing 2 HDFE groups                           F(  17,   1195) =      79.38
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5990
                                                  Adj R-squared   =     0.5608
                                                  Within R-sq.    =     0.4044
Number of clusters (gvkey)   =      1,196         Root MSE        =   116.3531

                              (Std. err. adjusted for 1,196 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   71.69775   15.27684     4.69   0.000     41.72534    101.6701
excess_int~t |  -43.96472   19.27841    -2.28   0.023    -81.78803   -6.141421
      log_at |  -5.572513   2.954476    -1.89   0.060    -11.36905    .2240245
market_to_~k |  -7.722023   3.135045    -2.46   0.014    -13.87283   -1.571217
 ppent_by_at |   8.513807   15.41739     0.55   0.581    -21.73436    38.76197
  debt_by_at |   51.14642   17.94644     2.85   0.004     15.93639    86.35645
  cash_by_at |   48.04599   29.30344     1.64   0.101    -9.445917    105.5379
dividend_p~r |   7.101944   6.478008     1.10   0.273    -5.607591    19.81148
     ret_vol |   284.6837   87.94532     3.24   0.001     112.1393    457.2282
    cash_etr |   14.85329   7.171182     2.07   0.039     .7837842     28.9228
   leveraged |   89.18132   8.999465     9.91   0.000     71.52481    106.8378
    maturity |   9.552709     2.5205     3.79   0.000     4.607612    14.49781
log_deal_a~d |  -16.45895   3.043013    -5.41   0.000    -22.42919   -10.48871
secured_du~y |   54.44334   7.249844     7.51   0.000      40.2195    68.66718
tranche_ty~y |   76.58756   4.613091    16.60   0.000      67.5369    85.63822
tranche_o_~y |   18.90744   5.713716     3.31   0.001     7.697404    30.11747
sponsor_du~y |   93.11124    9.26269    10.05   0.000     74.93829    111.2842
       _cons |   153.8486   30.40692     5.06   0.000     94.19174    213.5055
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
    year#ff_48 |       266           0         266     |
 sp_rating_num |        19           1          18     |
-------------------------------------------------------+

. estimates store m2

. 
. reghdfe margin_bps excess_interest_scaled excess_interest_scaled_post `contro
> ls' `deal_controls' `controls_post', absorb(year#ff_48 sp_rating_num) vce(clu
> ster gvkey)
(dropped 29 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =      3,447
Absorbing 2 HDFE groups                           F(  25,   1195) =      56.08
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6004
                                                  Adj R-squared   =     0.5612
                                                  Within R-sq.    =     0.4065
Number of clusters (gvkey)   =      1,196         Root MSE        =   116.2951

                              (Std. err. adjusted for 1,196 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   81.50399   16.00291     5.09   0.000     50.10705    112.9009
excess_int~t |  -69.75027   22.30061    -3.13   0.002     -113.503   -25.99757
      log_at |  -6.204287   3.649338    -1.70   0.089    -13.36411    .9555364
market_to_~k |   -5.36699   5.128323    -1.05   0.296    -15.42851    4.694529
 ppent_by_at |   5.656526   21.99164     0.26   0.797    -37.48999    48.80304
  debt_by_at |   38.51662   22.94784     1.68   0.094    -6.505919    83.53915
  cash_by_at |   23.53346   40.04401     0.59   0.557    -55.03094    102.0979
dividend_p~r |   11.34993    8.87433     1.28   0.201    -6.061071    28.76093
     ret_vol |   214.7868   112.4872     1.91   0.056    -5.907524    435.4812
    cash_etr |   21.60995   10.44799     2.07   0.039     1.111509    42.10839
   leveraged |   88.56829   8.918985     9.93   0.000     71.06968    106.0669
    maturity |   9.560179   2.488226     3.84   0.000     4.678401    14.44196
log_deal_a~d |   -16.3671   3.050604    -5.37   0.000    -22.35223   -10.38196
secured_du~y |   54.24845   7.157056     7.58   0.000     40.20666    68.29024
tranche_ty~y |   76.63629   4.601296    16.66   0.000     67.60877    85.66381
tranche_o_~y |   19.05936   5.684736     3.35   0.001     7.906187    30.21254
sponsor_du~y |   92.88555   9.178751    10.12   0.000     74.87729    110.8938
 log_at_post |   1.307112   3.594676     0.36   0.716    -5.745467    8.359691
market_to_~t |   -5.18654   6.074787    -0.85   0.393    -17.10497    6.731894
ppent_by_~st |   2.752602    28.8554     0.10   0.924    -53.86027    59.36548
debt_by_at~t |   34.03097   31.53554     1.08   0.281    -27.84022    95.90217
cash_by_at~t |   50.32768   57.82986     0.87   0.384    -63.13168     163.787
dividend_p~t |  -10.62524   12.11129    -0.88   0.380    -34.38699    13.13651
ret_vol_post |   178.8162   161.1014     1.11   0.267    -137.2568    494.8892
cash_etr_p~t |   -24.9452   19.76146    -1.26   0.207    -63.71622    13.82582
       _cons |   153.5236   29.84855     5.14   0.000      94.9622     212.085
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
    year#ff_48 |       266           0         266     |
 sp_rating_num |        19           1          18     |
-------------------------------------------------------+

. estimates store m3

. 
. * save the results (esttab) using tabdir
. esttab m1 m2 m3 using "$tabdir/margin_ie_excess_industryyear.tex", replace //
> /
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant drop(_cons 
> `controls_post')
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_ie_excess_industryyear.tex)

. est clear

. 
. ******************      Table 4: Main Results  ******************
. 
. reghdfe margin_bps excess_interest_scaled excess_interest_scaled_post `deal_c
> ontrols', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(   9,   1206) =     123.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5432
                                                  Adj R-squared   =     0.5329
                                                  Within R-sq.    =     0.3949
Number of clusters (gvkey)   =      1,207         Root MSE        =   119.9588

                              (Std. err. adjusted for 1,207 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |    84.7032   15.06886     5.62   0.000      55.1391    114.2673
excess_int~t |  -45.93892   19.79634    -2.32   0.020    -84.77801   -7.099837
   leveraged |   89.40721   7.859952    11.38   0.000     73.98651    104.8279
    maturity |   8.737766   2.578691     3.39   0.001     3.678547    13.79698
log_deal_a~d |   -19.0215   2.629941    -7.23   0.000    -24.18127   -13.86173
secured_du~y |   63.83168   7.176139     8.89   0.000     49.75258    77.91079
tranche_ty~y |   79.58165   4.804527    16.56   0.000     70.15549    89.00782
tranche_o_~y |   20.58203   5.737967     3.59   0.000     9.324526    31.83954
sponsor_du~y |   90.54226    9.69309     9.34   0.000     71.52507    109.5595
       _cons |   166.8644   22.49523     7.42   0.000     122.7303    210.9985
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m1

. 
. reghdfe margin_bps excess_interest_scaled excess_interest_scaled_post `contro
> ls' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  17,   1206) =      78.52
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5538
                                                  Adj R-squared   =     0.5426
                                                  Within R-sq.    =     0.4088
Number of clusters (gvkey)   =      1,207         Root MSE        =   118.7092

                              (Std. err. adjusted for 1,207 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   74.62813   15.79435     4.72   0.000     43.64067    105.6156
excess_int~t |  -49.54736   19.18329    -2.58   0.010    -87.18368   -11.91104
      log_at |  -5.756013   3.013842    -1.91   0.056    -11.66897    .1569426
market_to_~k |  -6.993319   3.507397    -1.99   0.046     -13.8746   -.1120415
 ppent_by_at |   4.913992   16.77921     0.29   0.770     -28.0057    37.83369
  debt_by_at |   52.84379   18.32999     2.88   0.004     16.88157    88.80601
  cash_by_at |    45.0881   28.76634     1.57   0.117    -11.34954    101.5257
dividend_p~r |   9.422819   6.374027     1.48   0.140    -3.082595    21.92823
     ret_vol |   292.2214   82.49742     3.54   0.000      130.367    454.0758
    cash_etr |   11.68319   6.518655     1.79   0.073     -1.10597    24.47236
   leveraged |   83.34108   8.464602     9.85   0.000      66.7341    99.94806
    maturity |   9.263584   2.561601     3.62   0.000     4.237896    14.28927
log_deal_a~d |  -16.17368   3.095302    -5.23   0.000    -22.24646   -10.10091
secured_du~y |    59.5822   7.124054     8.36   0.000     45.60528    73.55912
tranche_ty~y |   79.01926   4.680189    16.88   0.000     69.83705    88.20148
tranche_o_~y |   21.30582   5.840357     3.65   0.000     9.847432    32.76421
sponsor_du~y |   94.96401   9.596128     9.90   0.000     76.13705     113.791
       _cons |   150.9155   31.05644     4.86   0.000     89.98479    211.8461
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m2

. 
. reghdfe margin_bps excess_interest_scaled excess_interest_scaled_post `contro
> ls' `deal_controls' `controls_post', absorb(year ff_48 sp_rating_num) vce(clu
> ster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  25,   1206) =      54.50
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5548
                                                  Adj R-squared   =     0.5426
                                                  Within R-sq.    =     0.4102
Number of clusters (gvkey)   =      1,207         Root MSE        =   118.7053

                              (Std. err. adjusted for 1,207 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   82.30305   16.81884     4.89   0.000     49.30561    115.3005
excess_int~t |  -69.04148   22.69109    -3.04   0.002    -113.5599   -24.52308
      log_at |  -4.422584    3.66833    -1.21   0.228     -11.6196    2.774434
market_to_~k |  -4.135051   6.146586    -0.67   0.501    -16.19424    7.924138
 ppent_by_at |   .6716479   20.81902     0.03   0.974    -40.17388    41.51718
  debt_by_at |   39.58016   23.71143     1.67   0.095    -6.940073     86.1004
  cash_by_at |   23.54175   37.69735     0.62   0.532    -50.41793    97.50142
dividend_p~r |   12.66405   8.573588     1.48   0.140    -4.156754    29.48486
     ret_vol |   280.8782   106.6631     2.63   0.009     71.61232     490.144
    cash_etr |    15.8306   9.392263     1.69   0.092    -2.596393    34.25759
   leveraged |   82.47069    8.30681     9.93   0.000     66.17329    98.76809
    maturity |   9.169267    2.53336     3.62   0.000     4.198983    14.13955
log_deal_a~d |  -16.04252   3.102132    -5.17   0.000     -22.1287    -9.95635
secured_du~y |   60.08224   6.985405     8.60   0.000     46.37735    73.78714
tranche_ty~y |   79.05732   4.691152    16.85   0.000      69.8536    88.26105
tranche_o_~y |   22.11279   5.718615     3.87   0.000     10.89325    33.33233
sponsor_du~y |   94.28842   9.485924     9.94   0.000     75.67767    112.8992
 log_at_post |  -3.072441   3.373919    -0.91   0.363    -9.691843    3.546962
market_to_~t |  -6.151212   7.036145    -0.87   0.382    -19.95566    7.653232
ppent_by_~st |   5.019863   23.43855     0.21   0.830      -40.965    51.00473
debt_by_at~t |   34.13057   28.92316     1.18   0.238    -22.61472    90.87587
cash_by_at~t |   42.28888    52.1119     0.81   0.417    -59.95117    144.5289
dividend_p~t |  -8.984797   11.19404    -0.80   0.422    -30.94676    12.97716
ret_vol_post |   34.92864   152.2861     0.23   0.819    -263.8465    333.7038
cash_etr_p~t |  -15.15814   17.87196    -0.85   0.397    -50.22174    19.90545
       _cons |   151.5617   30.62004     4.95   0.000     91.48722    211.6362
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m3

. 
. * save the results (esttab) using tabdir
. esttab m1 m2 m3 using "$tabdir/margin_ie_excess.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant drop(_cons 
> `controls_post')
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_ie_excess.tex)

. 
. * save one without control variables 
. esttab m1 m2 m3 using "$tabdir/margin_ie_excess_noctrl.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant drop(_cons 
> `controls_post' `controls' `deal_controls')
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_ie_excess_noctrl.tex)

. est clear

. 
. ******************      Table 4: Main Results (B + BB Only)  ****************
> **
. 
. preserve

.         keep if inrange(sp_rating_num, 7, 15) == 1
(1,795 observations deleted)

. 
.         reghdfe margin_bps excess_interest_scaled excess_interest_scaled_post
>  `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      1,681
Absorbing 3 HDFE groups                           F(   9,    559) =      46.73
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5853
                                                  Adj R-squared   =     0.5686
                                                  Within R-sq.    =     0.3116
Number of clusters (gvkey)   =        560         Root MSE        =   107.3405

                                (Std. err. adjusted for 560 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   45.31628   22.09327     2.05   0.041     1.920315    88.71225
excess_int~t |   -74.0091   26.11475    -2.83   0.005    -125.3041   -22.71407
   leveraged |   75.87389   10.24526     7.41   0.000     55.74999     95.9978
    maturity |   16.59085   3.400047     4.88   0.000     9.912416    23.26927
log_deal_a~d |  -16.84135   3.777742    -4.46   0.000    -24.26165   -9.421045
secured_du~y |   32.82969     9.2291     3.56   0.000     14.70174    50.95764
tranche_ty~y |   64.10125   5.635894    11.37   0.000     53.03113    75.17137
tranche_o_~y |   20.86386   7.137688     2.92   0.004     6.843891    34.88382
sponsor_du~y |   92.65548   13.13645     7.05   0.000     66.85264    118.4583
       _cons |   148.1423   32.87042     4.51   0.000     83.57764    212.7069
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        42           1          41     |
 sp_rating_num |         9           1           8    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

.         estimates store m1

. 
.         reghdfe margin_bps excess_interest_scaled excess_interest_scaled_post
>  `controls' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvk
> ey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      1,681
Absorbing 3 HDFE groups                           F(  17,    559) =      28.85
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5959
                                                  Adj R-squared   =     0.5776
                                                  Within R-sq.    =     0.3293
Number of clusters (gvkey)   =        560         Root MSE        =   106.2204

                                (Std. err. adjusted for 560 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   52.68672   23.55084     2.24   0.026      6.42776    98.94568
excess_int~t |  -80.32369   25.17696    -3.19   0.002    -129.7767   -30.87069
      log_at |  -14.55479   5.236881    -2.78   0.006    -24.84116   -4.268418
market_to_~k |  -12.96954   4.925006    -2.63   0.009    -22.64332   -3.295764
 ppent_by_at |   1.123739   20.47564     0.05   0.956    -39.09485    41.34233
  debt_by_at |   15.98119   22.40399     0.71   0.476    -28.02511    59.98749
  cash_by_at |    25.9161   39.51606     0.66   0.512      -51.702    103.5342
dividend_p~r |   9.312709   8.246603     1.13   0.259    -6.885408    25.51083
     ret_vol |   270.7815   107.9799     2.51   0.012     58.68554    482.8775
    cash_etr |   9.315362    6.96771     1.34   0.182    -4.370731    23.00145
   leveraged |   79.74857   10.16385     7.85   0.000     59.78456    99.71258
    maturity |   15.89295   3.438863     4.62   0.000     9.138283    22.64763
log_deal_a~d |  -9.744466   4.289095    -2.27   0.023    -18.16918   -1.319754
secured_du~y |   30.66533   8.806138     3.48   0.001     13.36817     47.9625
tranche_ty~y |   63.80181   5.489233    11.62   0.000     53.01977    74.58385
tranche_o_~y |   21.74328   7.218825     3.01   0.003     7.563941    35.92262
sponsor_du~y |   96.73818   12.82174     7.54   0.000      71.5535    121.9229
       _cons |   199.3615   54.04242     3.69   0.000     93.21047    305.5126
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        42           1          41     |
 sp_rating_num |         9           1           8    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

.         estimates store m2

. 
.         reghdfe margin_bps excess_interest_scaled excess_interest_scaled_post
>  `controls' `deal_controls' `controls_post', absorb(year ff_48 sp_rating_num)
>  vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      1,681
Absorbing 3 HDFE groups                           F(  25,    559) =      20.53
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5965
                                                  Adj R-squared   =     0.5761
                                                  Within R-sq.    =     0.3303
Number of clusters (gvkey)   =        560         Root MSE        =   106.4066

                                (Std. err. adjusted for 560 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   56.55187   25.16224     2.25   0.025      7.12777     105.976
excess_int~t |  -89.09764   29.47545    -3.02   0.003    -146.9938   -31.20148
      log_at |  -15.42492   7.134164    -2.16   0.031    -29.43796   -1.411875
market_to_~k |  -11.28349   10.49652    -1.07   0.283    -31.90094    9.333961
 ppent_by_at |  -2.661745   28.71618    -0.09   0.926    -59.06654    53.74305
  debt_by_at |    10.4674   33.90776     0.31   0.758    -56.13479    77.06958
  cash_by_at |   22.89191   52.53182     0.44   0.663    -80.29198    126.0758
dividend_p~r |    11.2811   12.25927     0.92   0.358    -12.79877    35.36097
     ret_vol |   217.4556    135.978     1.60   0.110    -49.63467    484.5459
    cash_etr |    9.62591   9.711283     0.99   0.322    -9.449155    28.70097
   leveraged |   79.44598   10.12496     7.85   0.000     59.55835     99.3336
    maturity |   16.05106   3.379796     4.75   0.000     9.412412    22.68972
log_deal_a~d |  -9.931294   4.294181    -2.31   0.021      -18.366   -1.496592
secured_du~y |   30.27323   8.737463     3.46   0.001     13.11096     47.4355
tranche_ty~y |   63.85809   5.530436    11.55   0.000     52.99512    74.72107
tranche_o_~y |   21.65947   7.239522     2.99   0.003     7.439477    35.87946
sponsor_du~y |   97.13022   12.89261     7.53   0.000     71.80633    122.4541
 log_at_post |    2.45993   6.609972     0.37   0.710    -10.52349    15.44335
market_to_~t |  -2.021713   11.55723    -0.17   0.861    -24.72263     20.6792
ppent_by_~st |   6.424373   30.55257     0.21   0.834     -53.5875    66.43624
debt_by_at~t |   12.05252   40.17714     0.30   0.764     -66.8641    90.96914
cash_by_at~t |  -6.469506   68.13951    -0.09   0.924    -140.3103    127.3713
dividend_p~t |  -4.018323   14.61104    -0.28   0.783    -32.71757    24.68092
ret_vol_post |   154.9012    184.417     0.84   0.401    -207.3337    517.1362
cash_etr_p~t |  -.0152471   18.39038    -0.00   0.999    -36.13794    36.10745
       _cons |   194.9682   52.88388     3.69   0.000     91.09284    298.8437
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        42           1          41     |
 sp_rating_num |         9           1           8    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

.         estimates store m3

. 
.         * save the results (esttab) using tabdir
.         esttab m1 m2 m3 using "$tabdir/margin_ie_excess_clo.tex", replace ///
>         nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses //
> /
>         star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant dro
> p(_cons `controls_post')
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_ie_excess_clo.tex)

. 
.         * save one without control variables 
.         esttab m1 m2 m3 using "$tabdir/margin_ie_excess_clo_noctrl.tex", repl
> ace ///
>         nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses //
> /
>         star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant dro
> p(_cons `controls_post' `controls' `deal_controls')
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_ie_excess_clo_noctrl.tex)

.         est clear

. restore

. 
. ******************      Figure 4: Main Results Binscatter  ******************
. * Export binned data
. binscatter margin_bps excess_interest_scaled, ///
>     controls(`controls' `deal_controls') ///
>     by(post) ///
>     line(lfit) ///
>     savedata(binned_data) replace
(file binned_data.csv written containing saved data)
(file binned_data.do written containing commands to process saved data)

. 
. preserve

. * Import the CSV
. import delimited binned_data.csv, clear
(encoding automatically selected: ISO-8859-1)
(4 vars, 20 obs)

. 
. twoway (scatter margin_bps_by1 excess_interest_scaled_by1, msymbol(O) mcolor(
> navy)) ///
>        (scatter margin_bps_by2 excess_interest_scaled_by2, msymbol(T) mcolor(
> maroon)) ///
>        (lfit margin_bps_by1 excess_interest_scaled_by1, lcolor(navy) lpattern
> (solid)) ///
>        (lfit margin_bps_by2 excess_interest_scaled_by2, lcolor(maroon) lpatte
> rn(dash)), ///
>        xtitle("Excess Interest Expense (Scaled)") ///
>        ytitle("Interest Spread (Basis Points)") ///
>        legend(order(1 "Pre-TCJA" 2 "Post-TCJA"))

. 
. graph export "$figdir/binscatter_margin_ie_prepost.png", as(png) replace
file /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incidence and Loan 
> Contract Terms/Figures/binscatter_margin_ie_prepost.png written in PNG format

. restore

. 
. ******************      Table C1: Logged Main Results  ******************
. 
. reghdfe log_margin_bps excess_interest_scaled excess_interest_scaled_post `de
> al_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(   9,   1206) =     207.93
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6785
                                                  Adj R-squared   =     0.6713
                                                  Within R-sq.    =     0.5278
Number of clusters (gvkey)   =      1,207         Root MSE        =     0.3442

                              (Std. err. adjusted for 1,207 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
log_margin~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   .2089294     .03955     5.28   0.000     .1313349    .2865239
excess_int~t |  -.0846004   .0528518    -1.60   0.110    -.1882922    .0190914
   leveraged |   .5050708   .0252948    19.97   0.000      .455444    .5546976
    maturity |     .03908   .0069501     5.62   0.000     .0254443    .0527157
log_deal_a~d |  -.0659716   .0082458    -8.00   0.000    -.0821493    -.049794
secured_du~y |   .1807277   .0214895     8.41   0.000     .1385668    .2228887
tranche_ty~y |   .2410018   .0143957    16.74   0.000     .2127584    .2692453
tranche_o_~y |   .0545752    .017621     3.10   0.002      .020004    .0891464
sponsor_du~y |      .2805   .0271933    10.32   0.000     .2271485    .3338514
       _cons |   4.946192   .0668241    74.02   0.000     4.815087    5.077296
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m1

. 
. reghdfe log_margin_bps excess_interest_scaled excess_interest_scaled_post `co
> ntrols' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  17,   1206) =     140.97
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6909
                                                  Adj R-squared   =     0.6832
                                                  Within R-sq.    =     0.5461
Number of clusters (gvkey)   =      1,207         Root MSE        =     0.3379

                              (Std. err. adjusted for 1,207 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
log_margin~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   .1707044   .0406011     4.20   0.000     .0910478    .2503609
excess_int~t |  -.0973666   .0498192    -1.95   0.051    -.1951086    .0003754
      log_at |  -.0335684   .0084995    -3.95   0.000    -.0502439   -.0168928
market_to_~k |  -.0423119   .0116911    -3.62   0.000     -.065249   -.0193747
 ppent_by_at |   .0310279    .050304     0.62   0.537    -.0676652    .1297209
  debt_by_at |   .1820854   .0489801     3.72   0.000     .0859898     .278181
  cash_by_at |   .1670068   .0851721     1.96   0.050    -.0000951    .3341087
dividend_p~r |   .0263908   .0191904     1.38   0.169    -.0112594     .064041
     ret_vol |   .7824132   .2319642     3.37   0.001     .3273149    1.237511
    cash_etr |   .0226343   .0187769     1.21   0.228    -.0142047    .0594734
   leveraged |   .4765802   .0270871    17.59   0.000     .4234371    .5297234
    maturity |   .0398899   .0067702     5.89   0.000     .0266073    .0531725
log_deal_a~d |  -.0492822    .009347    -5.27   0.000    -.0676205    -.030944
secured_du~y |    .164573     .02144     7.68   0.000     .1225092    .2066369
tranche_ty~y |   .2388383   .0138685    17.22   0.000     .2116293    .2660474
tranche_o_~y |   .0591768   .0179111     3.30   0.001     .0240364    .0943171
sponsor_du~y |   .2986823   .0271855    10.99   0.000      .245346    .3520185
       _cons |   5.019451   .0891944    56.28   0.000     4.844458    5.194445
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m2

. 
. reghdfe log_margin_bps excess_interest_scaled excess_interest_scaled_post `co
> ntrols' `deal_controls' `controls_post', absorb(year ff_48 sp_rating_num) vce
> (cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  25,   1206) =      98.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6924
                                                  Adj R-squared   =     0.6839
                                                  Within R-sq.    =     0.5482
Number of clusters (gvkey)   =      1,207         Root MSE        =     0.3375

                              (Std. err. adjusted for 1,207 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
log_margin~s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   .1973122   .0437925     4.51   0.000     .1113942    .2832302
excess_int~t |  -.1617488   .0596092    -2.71   0.007    -.2786981   -.0447995
      log_at |  -.0255503    .010387    -2.46   0.014    -.0459289   -.0051717
market_to_~k |   -.028771    .020335    -1.41   0.157    -.0686669    .0111248
 ppent_by_at |    .018822   .0602411     0.31   0.755    -.0993671    .1370111
  debt_by_at |   .1337199   .0638499     2.09   0.036     .0084506    .2589892
  cash_by_at |    .112726   .1090073     1.03   0.301    -.1011391    .3265911
dividend_p~r |   .0249574   .0249674     1.00   0.318     -.024027    .0739419
     ret_vol |   .6760367   .2952252     2.29   0.022     .0968248    1.255249
    cash_etr |   .0269079   .0264442     1.02   0.309     -.024974    .0787897
   leveraged |     .47281   .0264688    17.86   0.000       .42088    .5247399
    maturity |   .0395105   .0066897     5.91   0.000     .0263857    .0526353
log_deal_a~d |  -.0491611   .0093156    -5.28   0.000    -.0674377   -.0308845
secured_du~y |   .1668297   .0210276     7.93   0.000     .1255749    .2080844
tranche_ty~y |   .2386078   .0138826    17.19   0.000      .211371    .2658445
tranche_o_~y |   .0633671    .017419     3.64   0.000     .0291921    .0975421
sponsor_du~y |   .2966231   .0267201    11.10   0.000     .2442001    .3490462
 log_at_post |   -.018014   .0103216    -1.75   0.081    -.0382642    .0022363
market_to_~t |  -.0271897   .0230184    -1.18   0.238    -.0723502    .0179708
ppent_by_~st |   .0157592   .0686913     0.23   0.819    -.1190086    .1505269
debt_by_at~t |   .1235072   .0802277     1.54   0.124    -.0338942    .2809085
cash_by_at~t |   .0934892     .15566     0.60   0.548    -.2119053    .3988837
dividend_p~t |  -.0010024   .0333324    -0.03   0.976    -.0663984    .0643935
ret_vol_post |   .3424701   .4204701     0.81   0.416     -.482464    1.167404
cash_etr_p~t |   -.017815   .0527498    -0.34   0.736    -.1213067    .0856766
       _cons |   5.016841   .0883956    56.75   0.000     4.843415    5.190267
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m3

. 
. * save the results (esttab) using tabdir
. esttab m1 m2 m3 using "$tabdir/log_margin_ie_excess.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant drop(_cons 
> `controls_post')
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/log_margin_ie_excess.tex)

. est clear

. 
. ******************      Main Results: Dynamic  ******************
. 
. local years 2014 2015 2016 2017 2018 2019 2022 2023

. * generate year-specific treated dummies
. foreach y of local years {
  2.     gen treated_all_year_`y' = (treated_all == 1 & year == `y')
  3.     replace treated_all_year_`y' = 0 if treated_all != 1 | year != `y'
  4.         gen indicator_year_`y' = 1 if year == `y'
  5.         replace indicator_year_`y' = 0 if indicator_year_`y' == .
  6.         gen excess_interest_scaled_year_`y' = excess_interest_scaled * ind
> icator_year_`y'
  7. }
(0 real changes made)
(2,935 missing values generated)
(2,935 real changes made)
(0 real changes made)
(2,963 missing values generated)
(2,963 real changes made)
(0 real changes made)
(3,076 missing values generated)
(3,076 real changes made)
(0 real changes made)
(3,018 missing values generated)
(3,018 real changes made)
(0 real changes made)
(2,974 missing values generated)
(2,974 real changes made)
(0 real changes made)
(3,102 missing values generated)
(3,102 real changes made)
(0 real changes made)
(3,070 missing values generated)
(3,070 real changes made)
(0 real changes made)
(3,194 missing values generated)
(3,194 real changes made)

. 
. local dynamic_treated_all "treated_all_year_2015 treated_all_year_2016 treate
> d_all_year_2017  treated_all_year_2018 treated_all_year_2019 treated_all_year
> _2022 treated_all_year_2023"

. 
. local dynamic_treated_excess_interest "excess_interest_scaled_year_2014 exces
> s_interest_scaled_year_2015 excess_interest_scaled_year_2016 excess_interest_
> scaled_year_2018 excess_interest_scaled_year_2019 excess_interest_scaled_year
> _2022 excess_interest_scaled_year_2023"

. 
. * Q3 and Q4
. gen treated_q = 1 if ie_excess_q3 == 1 | ie_excess_q4 == 1
(2,891 missing values generated)

. replace treated_q = 0 if treated_q == .
(2,891 real changes made)

. 
. foreach y of local years {
  2.     gen treated_q_year_`y' = (treated_q == 1 & year == `y')
  3.     replace treated_q_year_`y' = 0 if treated_q != 1 | year != `y'
  4. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. local dynamic_treated_q "treated_q_year_2015 treated_q_year_2016 treated_q_ye
> ar_2017 treated_q_year_2018 treated_q_year_2019 treated_q_year_2022 treated_q
> _year_2023"

. 
. *** Both Rule ***
. reghdfe margin_bps treated_all `dynamic_treated_all' `controls' `deal_control
> s', absorb(year ff_48 sp_rating_num) vce(cluster ff_48)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  23,     43) =     161.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5504
                                                  Adj R-squared   =     0.5383
                                                  Within R-sq.    =     0.4044
Number of clusters (ff_48)   =         44         Root MSE        =   119.2587

                                 (Std. err. adjusted for 44 clusters in ff_48)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
 treated_all |   48.84299       19.4     2.52   0.016     9.719173    87.96681
treated_al~5 |  -30.44884   32.44702    -0.94   0.353     -95.8845    34.98682
treated_al~6 |  -2.560241   22.70328    -0.11   0.911    -48.34576    43.22528
treated_al~7 |  -34.30663   24.83201    -1.38   0.174    -84.38515     15.7719
treated_al~8 |  -42.23958   27.17824    -1.55   0.127    -97.04972    12.57056
treated_al~9 |  -79.73108   32.51476    -2.45   0.018    -145.3033   -14.15882
treated_al~2 |  -4.416741   30.96933    -0.14   0.887    -66.87235    58.03887
treated_al~3 |  -15.24753   26.18273    -0.58   0.563    -68.05004    37.55498
      log_at |  -5.633857   2.491553    -2.26   0.029    -10.65855    -.609161
market_to_~k |  -7.098743   4.116998    -1.72   0.092    -15.40146    1.203974
 ppent_by_at |   7.458148   16.33146     0.46   0.650    -25.47738    40.39367
  debt_by_at |   45.63725   21.87977     2.09   0.043     1.512489    89.76202
  cash_by_at |   44.31799   30.07408     1.47   0.148    -16.33217    104.9681
dividend_p~r |    8.56908   7.913034     1.08   0.285    -7.389075    24.52723
     ret_vol |   356.6935   71.71114     4.97   0.000     212.0742    501.3127
    cash_etr |   5.176665   6.802447     0.76   0.451    -8.541778    18.89511
   leveraged |   83.36525   12.34015     6.76   0.000     58.47896    108.2515
    maturity |   8.953492    2.60519     3.44   0.001     3.699626    14.20736
log_deal_a~d |  -17.00695   3.384201    -5.03   0.000    -23.83184   -10.18206
secured_du~y |   61.88866   6.551199     9.45   0.000     48.67691    75.10042
tranche_ty~y |   79.11396   9.722125     8.14   0.000     59.50743    98.72049
tranche_o_~y |   21.46649   5.348457     4.01   0.000      10.6803    32.25268
sponsor_du~y |      94.85   12.76364     7.43   0.000     69.10967    120.5903
       _cons |   156.0367    32.2934     4.83   0.000     90.91083    221.1625
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           1           7     |
         ff_48 |        44          44           0    *|
 sp_rating_num |        19           1          18     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$tabdir/margin_did_dynamic_all_ff48.csv", replace mlab
> (none)
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_did_dynamic_all_ff48.csv)

. 
. *** Treated (Q3 and Q4) ***
. reghdfe margin_bps treated_q `dynamic_treated_q' `controls' `deal_controls', 
> absorb(year ff_48 sp_rating_num) vce(cluster ff_48)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  23,     43) =     170.05
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5593
                                                  Adj R-squared   =     0.5475
                                                  Within R-sq.    =     0.4161
Number of clusters (ff_48)   =         44         Root MSE        =   118.0741

                                 (Std. err. adjusted for 44 clusters in ff_48)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   treated_q |   100.7688   23.22851     4.34   0.000     53.92407    147.6136
treated_q_~5 |  -56.70302   38.27902    -1.48   0.146       -133.9    20.49399
treated_q_~6 |   3.047931   33.60779     0.09   0.928    -64.72864     70.8245
treated_q_~7 |  -63.43056   38.30573    -1.66   0.105    -140.6814    13.82031
treated_q_~8 |  -100.3504   38.39932    -2.61   0.012      -177.79    -22.9108
treated_q_~9 |  -137.0406   38.51174    -3.56   0.001    -214.7069   -59.37424
treated_q_~2 |  -39.80482   38.82967    -1.03   0.311    -118.1123    38.50267
treated_q_~3 |  -50.51436   31.92279    -1.58   0.121    -114.8928    13.86408
      log_at |  -5.453838   2.642902    -2.06   0.045    -10.78376   -.1239183
market_to_~k |  -7.385561   4.010976    -1.84   0.072    -15.47446    .7033422
 ppent_by_at |   4.024626   15.93939     0.25   0.802    -28.12022    36.16948
  debt_by_at |    55.3803   20.69811     2.68   0.011     13.63859    97.12202
  cash_by_at |   43.43298   27.54495     1.58   0.122     -12.1167    98.98266
dividend_p~r |   8.956493   7.929653     1.13   0.265    -7.035176    24.94816
     ret_vol |   306.3962   72.40678     4.23   0.000      160.374    452.4184
    cash_etr |   9.865964   5.355923     1.84   0.072    -.9352839    20.66721
   leveraged |   84.72869   11.97943     7.07   0.000     60.56987    108.8875
    maturity |    9.66711    2.47565     3.90   0.000     4.674485    14.65973
log_deal_a~d |  -16.19304   3.546783    -4.57   0.000    -23.34581   -9.040266
secured_du~y |   59.44556   6.528571     9.11   0.000     46.27945    72.61168
tranche_ty~y |   78.53381   9.387306     8.37   0.000      59.6025    97.46511
tranche_o_~y |   21.40889   4.827951     4.43   0.000      11.6724    31.14538
sponsor_du~y |   95.54823   12.85145     7.43   0.000      69.6308    121.4657
       _cons |   147.1158   30.25935     4.86   0.000       86.092    208.1396
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           1           7     |
         ff_48 |        44          44           0    *|
 sp_rating_num |        19           1          18     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$tabdir/margin_did_dynamic_q_ff48.csv", replace mlab(n
> one)
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_did_dynamic_q_ff48.csv)

. 
. *** Excess Interest ***
. reghdfe margin_bps excess_interest_scaled `dynamic_treated_excess_interest' `
> controls' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster ff_48
> )
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  23,     43) =     174.18
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5594
                                                  Adj R-squared   =     0.5475
                                                  Within R-sq.    =     0.4162
Number of clusters (ff_48)   =         44         Root MSE        =   118.0664

                                 (Std. err. adjusted for 44 clusters in ff_48)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   42.12319   27.52829     1.53   0.133    -13.39289    97.63928
excess_~2014 |    63.5815   37.98685     1.67   0.101    -13.02628    140.1893
excess_~2015 |  -3.074518   50.28305    -0.06   0.952      -104.48    98.33091
excess_~2016 |   60.38393   31.22982     1.93   0.060       -2.597    123.3649
excess_~2018 |  -35.35749   35.72013    -0.99   0.328     -107.394    36.67902
excess_~2019 |  -80.61488   39.46829    -2.04   0.047    -160.2103   -1.019494
excess_~2022 |   30.98621   38.41746     0.81   0.424    -46.48999    108.4624
excess_~2023 |   20.42966   39.24007     0.52   0.605    -58.70548     99.5648
      log_at |  -5.592373   2.622105    -2.13   0.039    -10.88035   -.3043934
market_to_~k |  -6.970684   4.003782    -1.74   0.089    -15.04508    1.103713
 ppent_by_at |   4.581072   15.52341     0.30   0.769    -26.72486    35.88701
  debt_by_at |   49.64079   20.89869     2.38   0.022     7.494575    91.78701
  cash_by_at |   41.23054   28.11219     1.47   0.150     -15.4631    97.92418
dividend_p~r |   10.37117    7.92053     1.31   0.197    -5.602104    26.34444
     ret_vol |   299.9533   71.29422     4.21   0.000     156.1748    443.7318
    cash_etr |   10.94073    5.77769     1.89   0.065    -.7110867    22.59256
   leveraged |   84.37663   11.93285     7.07   0.000     60.31175    108.4415
    maturity |   9.512627   2.461805     3.86   0.000     4.547924    14.47733
log_deal_a~d |  -15.69969      3.512    -4.47   0.000    -22.78231   -8.617064
secured_du~y |   60.29124   6.570417     9.18   0.000     47.04073    73.54175
tranche_ty~y |   78.59128   9.502923     8.27   0.000     59.42681    97.75575
tranche_o_~y |   21.37144   4.962741     4.31   0.000     11.36312    31.37976
sponsor_du~y |   95.78376   12.73079     7.52   0.000     70.10967    121.4579
       _cons |   144.7291   29.86376     4.85   0.000     84.50308    204.9551
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           1           7     |
         ff_48 |        44          44           0    *|
 sp_rating_num |        19           1          18     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$tabdir/margin_ie_excess_dynamic.csv", replace mlab(no
> ne)
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_ie_excess_dynamic.csv)

. 
. *** Excess Interest (2014 as hold-out) ***
. local dynamic_ie_2014holdout "excess_interest_scaled_year_2015 excess_interes
> t_scaled_year_2016 excess_interest_scaled_year_2017 excess_interest_scaled_ye
> ar_2018 excess_interest_scaled_year_2019 excess_interest_scaled_year_2022 exc
> ess_interest_scaled_year_2023"

. 
. reghdfe margin_bps excess_interest_scaled `dynamic_ie_2014holdout' `controls'
>  `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster ff_48)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  23,     43) =     174.18
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5594
                                                  Adj R-squared   =     0.5475
                                                  Within R-sq.    =     0.4162
Number of clusters (ff_48)   =         44         Root MSE        =   118.0664

                                 (Std. err. adjusted for 44 clusters in ff_48)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   105.7047   24.84021     4.26   0.000     55.60963    155.7997
excess_~2015 |  -66.65602   42.75386    -1.56   0.126    -152.8774    19.56536
excess_~2016 |  -3.197569   32.74944    -0.10   0.923    -69.24312    62.84798
excess_~2017 |   -63.5815   37.98685    -1.67   0.101    -140.1893    13.02629
excess_~2018 |  -98.93899   39.84989    -2.48   0.017     -179.304   -18.57402
excess_~2019 |  -144.1964     41.899    -3.44   0.001    -228.6938   -59.69899
excess_~2022 |  -32.59529   37.30796    -0.87   0.387     -107.834    42.64338
excess_~2023 |  -43.15184   33.77098    -1.28   0.208    -111.2575    24.95383
      log_at |  -5.592373   2.622105    -2.13   0.039    -10.88035   -.3043934
market_to_~k |  -6.970684   4.003782    -1.74   0.089    -15.04508    1.103713
 ppent_by_at |   4.581071   15.52341     0.30   0.769    -26.72486    35.88701
  debt_by_at |   49.64079   20.89869     2.38   0.022     7.494575    91.78701
  cash_by_at |   41.23054   28.11219     1.47   0.150     -15.4631    97.92418
dividend_p~r |   10.37117    7.92053     1.31   0.197    -5.602104    26.34444
     ret_vol |   299.9533   71.29422     4.21   0.000     156.1748    443.7318
    cash_etr |   10.94073    5.77769     1.89   0.065    -.7110868    22.59256
   leveraged |   84.37663   11.93285     7.07   0.000     60.31175    108.4415
    maturity |   9.512627   2.461805     3.86   0.000     4.547924    14.47733
log_deal_a~d |  -15.69969      3.512    -4.47   0.000    -22.78231   -8.617064
secured_du~y |   60.29124   6.570417     9.18   0.000     47.04073    73.54175
tranche_ty~y |   78.59128   9.502923     8.27   0.000     59.42681    97.75575
tranche_o_~y |   21.37144   4.962741     4.31   0.000     11.36312    31.37976
sponsor_du~y |   95.78376   12.73079     7.52   0.000     70.10967    121.4579
       _cons |   144.7291   29.86376     4.85   0.000     84.50308    204.9551
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           1           7     |
         ff_48 |        44          44           0    *|
 sp_rating_num |        19           1          18     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$tabdir/margin_ie_excess_dynamic_2014holdout.csv", rep
> lace mlab(none)
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_ie_excess_dynamic_2014holdout.csv)

. 
. ******************      Table 6: Other Terms  ******************
. 
. *** DID regressions (Perf Pricing and Num Fin Cov) ***
. 
. reghdfe perf_pricing_dummy excess_interest_scaled excess_interest_scaled_post
>  `controls' `deal_controls' `controls_post', absorb(year ff_48 sp_rating_num)
>  vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  25,   1206) =      10.61
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2467
                                                  Adj R-squared   =     0.2260
                                                  Within R-sq.    =     0.0987
Number of clusters (gvkey)   =      1,207         Root MSE        =     0.3948

                              (Std. err. adjusted for 1,207 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
perf_prici~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |  -.0417838   .0416638    -1.00   0.316    -.1235253    .0399578
excess_int~t |   .0051996    .055404     0.09   0.925    -.1034992    .1138984
      log_at |  -.0293886   .0108658    -2.70   0.007    -.0507066   -.0080706
market_to_~k |   .0199595   .0141787     1.41   0.159    -.0078583    .0477772
 ppent_by_at |   -.009526   .0642328    -0.15   0.882    -.1355465    .1164945
  debt_by_at |  -.1376292   .0590656    -2.33   0.020     -.253512   -.0217464
  cash_by_at |  -.1174432   .1296395    -0.91   0.365    -.3717871    .1369008
dividend_p~r |  -.0143598   .0299508    -0.48   0.632    -.0731212    .0444016
     ret_vol |  -.4338682   .3124028    -1.39   0.165    -1.046782    .1790452
    cash_etr |  -.0170201   .0248245    -0.69   0.493    -.0657241    .0316839
   leveraged |  -.1869162   .0274886    -6.80   0.000     -.240847   -.1329855
    maturity |  -.0117196   .0059071    -1.98   0.047    -.0233089   -.0001303
log_deal_a~d |   .0577033    .009494     6.08   0.000     .0390766      .07633
secured_du~y |    .118879   .0249726     4.76   0.000     .0698844    .1678736
tranche_ty~y |  -.0716398    .013329    -5.37   0.000    -.0977905   -.0454892
tranche_o_~y |   .0868415   .0185979     4.67   0.000     .0503536    .1233293
sponsor_du~y |  -.1184678   .0257145    -4.61   0.000     -.168918   -.0680176
 log_at_post |    .022076   .0124039     1.78   0.075    -.0022596    .0464116
market_to_~t |   .0001184   .0178173     0.01   0.995    -.0348379    .0350747
ppent_by_~st |  -.0449649    .080148    -0.56   0.575    -.2022099      .11228
debt_by_at~t |   .0118954   .0855839     0.14   0.889    -.1560145    .1798054
cash_by_at~t |  -.0127822   .1778023    -0.07   0.943    -.3616184    .3360541
dividend_p~t |  -.0026987   .0410831    -0.07   0.948    -.0833009    .0779036
ret_vol_post |   .5299142   .4527468     1.17   0.242    -.3583446    1.418173
cash_etr_p~t |  -.0334303   .0548033    -0.61   0.542    -.1409506      .07409
       _cons |   .2404142   .0915278     2.63   0.009     .0608428    .4199856
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m1

. reghdfe sweep_dummy excess_interest_scaled excess_interest_scaled_post `contr
> ols' `deal_controls' `controls_post', absorb(year ff_48 sp_rating_num) vce(cl
> uster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  25,   1206) =       5.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2637
                                                  Adj R-squared   =     0.2435
                                                  Within R-sq.    =     0.0814
Number of clusters (gvkey)   =      1,207         Root MSE        =     0.2776

                              (Std. err. adjusted for 1,207 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
 sweep_dummy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |  -.0241303   .0414348    -0.58   0.560    -.1054226     .057162
excess_int~t |   .0072277   .0455433     0.16   0.874    -.0821251    .0965806
      log_at |  -.0405833   .0092921    -4.37   0.000    -.0588137   -.0223529
market_to_~k |  -.0150187   .0110923    -1.35   0.176    -.0367811    .0067437
 ppent_by_at |   -.031602   .0688985    -0.46   0.647    -.1667763    .1035724
  debt_by_at |   .0803448   .0667096     1.20   0.229    -.0505349    .2112245
  cash_by_at |   .2269217    .119778     1.89   0.058    -.0080746     .461918
dividend_p~r |  -.0353945    .031269    -1.13   0.258    -.0967421    .0259532
     ret_vol |  -.3798476   .2639443    -1.44   0.150    -.8976886    .1379935
    cash_etr |   -.011022    .038345    -0.29   0.774    -.0862523    .0642082
   leveraged |   .0455562   .0192458     2.37   0.018     .0077972    .0833152
    maturity |  -.0158089   .0042257    -3.74   0.000    -.0240995   -.0075183
log_deal_a~d |    .035017   .0073509     4.76   0.000     .0205952    .0494389
secured_du~y |    .119895   .0200618     5.98   0.000     .0805351    .1592549
tranche_ty~y |    .033711    .008917     3.78   0.000     .0162166    .0512055
tranche_o_~y |   .0188823   .0149226     1.27   0.206    -.0103948    .0481595
sponsor_du~y |  -.0735154   .0282193    -2.61   0.009    -.1288797   -.0181511
 log_at_post |   .0246468   .0092294     2.67   0.008     .0065393    .0427544
market_to_~t |    .021962    .012435     1.77   0.078    -.0024346    .0463587
ppent_by_~st |   .0506104   .0766783     0.66   0.509    -.0998273    .2010482
debt_by_at~t |  -.1581145   .0785882    -2.01   0.044    -.3122993   -.0039297
cash_by_at~t |  -.1563521   .1366741    -1.14   0.253    -.4244975    .1117934
dividend_p~t |   .0746541    .033538     2.23   0.026     .0088548    .1404533
ret_vol_post |   .3248507   .3378562     0.96   0.336    -.3380006    .9877019
cash_etr_p~t |   .0198753   .0553912     0.36   0.720    -.0887986    .1285492
       _cons |   .1083489   .0692064     1.57   0.118    -.0274294    .2441272
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m2

. reghdfe num_fin_cov excess_interest_scaled excess_interest_scaled_post `contr
> ols' `deal_controls' `controls_post', absorb(year ff_48 sp_rating_num) vce(cl
> uster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  25,   1206) =      10.23
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2193
                                                  Adj R-squared   =     0.1978
                                                  Within R-sq.    =     0.1202
Number of clusters (gvkey)   =      1,207         Root MSE        =     0.7678

                              (Std. err. adjusted for 1,207 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
 num_fin_cov | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |  -.1658222    .094512    -1.75   0.080    -.3512484    .0196039
excess_int~t |   .0915781   .1274168     0.72   0.472    -.1584051    .3415614
      log_at |  -.1381091    .023102    -5.98   0.000    -.1834336   -.0927845
market_to_~k |   .0245516   .0308161     0.80   0.426    -.0359075    .0850107
 ppent_by_at |  -.0266458   .1324569    -0.20   0.841    -.2865174    .2332257
  debt_by_at |    .076126   .1449777     0.53   0.600    -.2083104    .3605625
  cash_by_at |  -.4161516   .2859413    -1.46   0.146    -.9771492    .1448461
dividend_p~r |  -.0327194   .0645767    -0.51   0.612    -.1594146    .0939759
     ret_vol |  -1.035742    .590908    -1.75   0.080    -2.195064    .1235801
    cash_etr |   .0664208   .0567134     1.17   0.242     -.044847    .1776886
   leveraged |  -.3231551   .0633311    -5.10   0.000    -.4474064   -.1989038
    maturity |  -.0303584   .0136415    -2.23   0.026    -.0571221   -.0035946
log_deal_a~d |   .0893558   .0186185     4.80   0.000     .0528276    .1258841
secured_du~y |   .2270795   .0513685     4.42   0.000     .1262979     .327861
tranche_ty~y |   -.044791   .0243109    -1.84   0.066    -.0924874    .0029055
tranche_o_~y |  -.0491625   .0393953    -1.25   0.212    -.1264534    .0281285
sponsor_du~y |  -.4609488   .0515169    -8.95   0.000    -.5620215   -.3598761
 log_at_post |   .0312999    .025624     1.22   0.222    -.0189727    .0815725
market_to_~t |  -.0079236   .0392718    -0.20   0.840    -.0849722    .0691251
ppent_by_~st |   .0390407   .1576442     0.25   0.804    -.2702466    .3483281
debt_by_at~t |  -.1955668   .2004101    -0.98   0.329     -.588758    .1976244
cash_by_at~t |  -.0283127   .3685628    -0.08   0.939    -.7514082    .6947827
dividend_p~t |   .1470244   .0850102     1.73   0.084      -.01976    .3138087
ret_vol_post |   1.094472    .905586     1.21   0.227    -.6822273    2.871171
cash_etr_p~t |  -.0750578   .1132893    -0.66   0.508    -.2973238    .1472083
       _cons |   1.452003   .2099019     6.92   0.000      1.04019    1.863816
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m3

. *** DID regressions (covenant tightness)
. reghdfe pviol excess_interest_scaled excess_interest_scaled_post `controls' `
> deal_controls' `controls_post', absorb(year ff_48 sp_rating_num) vce(cluster 
> gvkey)
(dropped 3 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =        997
Absorbing 3 HDFE groups                           F(  25,    343) =       1.30
Statistics robust to heteroskedasticity           Prob > F        =     0.1586
                                                  R-squared       =     0.2316
                                                  Adj R-squared   =     0.1654
                                                  Within R-sq.    =     0.0935
Number of clusters (gvkey)   =        344         Root MSE        =     0.1905

                                (Std. err. adjusted for 344 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
       pviol | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   .0667482   .0507546     1.32   0.189    -.0330812    .1665776
excess_int~t |   .0276834   .0662208     0.42   0.676    -.1025666    .1579334
      log_at |  -.0067028   .0104645    -0.64   0.522    -.0272853    .0138798
market_to_~k |   .0330729   .0226353     1.46   0.145    -.0114486    .0775945
 ppent_by_at |  -.0035921    .061527    -0.06   0.953    -.1246098    .1174257
  debt_by_at |   .0944206   .0718921     1.31   0.190    -.0469843    .2358255
  cash_by_at |   .0740053   .1598421     0.46   0.644    -.2403889    .3883995
dividend_p~r |  -.0371774    .020433    -1.82   0.070    -.0773671    .0030123
     ret_vol |  -.0827791   .3337855    -0.25   0.804    -.7393032    .5737451
    cash_etr |   .0271448   .0324016     0.84   0.403    -.0365861    .0908757
   leveraged |   .0248337   .0197344     1.26   0.209    -.0139821    .0636494
    maturity |   .0033415    .005566     0.60   0.549    -.0076062    .0142893
log_deal_a~d |  -.0036023   .0084661    -0.43   0.671    -.0202543    .0130496
secured_du~y |   .0760452   .0212329     3.58   0.000     .0342821    .1178082
tranche_ty~y |   .0091053   .0121914     0.75   0.456    -.0148739    .0330846
tranche_o_~y |   .0037439   .0201002     0.19   0.852    -.0357913    .0432792
sponsor_du~y |  -.0457462   .0265614    -1.72   0.086      -.09799    .0064976
 log_at_post |   .0126139   .0131315     0.96   0.337    -.0132146    .0384423
market_to_~t |  -.0487177     .02577    -1.89   0.060    -.0994048    .0019695
ppent_by_~st |    .084073   .0801803     1.05   0.295     -.073634    .2417801
debt_by_at~t |  -.1059607   .1000484    -1.06   0.290    -.3027463    .0908249
cash_by_at~t |    .240465   .2318584     1.04   0.300    -.2155781    .6965082
dividend_p~t |   .0814632   .0460953     1.77   0.078    -.0092018    .1721282
ret_vol_post |  -.1432738   .5875209    -0.24   0.807    -1.298871    1.012324
cash_etr_p~t |   .0526572   .0609846     0.86   0.388    -.0672936    .1726081
       _cons |  -.0586892   .0925967    -0.63   0.527    -.2408181    .1234397
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        33           1          32     |
 sp_rating_num |        16           1          15    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m4

. 
. local deal_controls3 "leveraged maturity log_deal_amount_converted tranche_ty
> pe_dummy tranche_o_a_dummy sponsor_dummy"

. 
. reghdfe secured_dummy excess_interest_scaled excess_interest_scaled_post `con
> trols' `deal_controls3' `controls_post', absorb(year ff_48 sp_rating_num) vce
> (cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  24,   1206) =      33.02
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4549
                                                  Adj R-squared   =     0.4400
                                                  Within R-sq.    =     0.2492
Number of clusters (gvkey)   =      1,207         Root MSE        =     0.3740

                              (Std. err. adjusted for 1,207 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
secured_du~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   .0599526   .0446658     1.34   0.180    -.0276788    .1475839
excess_int~t |  -.0424112   .0660084    -0.64   0.521    -.1719153    .0870928
      log_at |  -.0307764   .0117759    -2.61   0.009    -.0538799   -.0076728
market_to_~k |  -.0196226    .015049    -1.30   0.193    -.0491477    .0099024
 ppent_by_at |   .0387291    .075592     0.51   0.609    -.1095774    .1870356
  debt_by_at |   .1518873   .0667287     2.28   0.023     .0209701    .2828045
  cash_by_at |   .2123674   .1418589     1.50   0.135    -.0659502     .490685
dividend_p~r |  -.0044911   .0323638    -0.14   0.890    -.0679867    .0590044
     ret_vol |   .1903947   .2987903     0.64   0.524    -.3958118    .7766012
    cash_etr |    .010737   .0329972     0.33   0.745    -.0540012    .0754753
   leveraged |   .3856633   .0288772    13.36   0.000     .3290081    .4423185
    maturity |   .0557873   .0060636     9.20   0.000     .0438909    .0676837
log_deal_a~d |    .025866   .0107051     2.42   0.016     .0048634    .0468685
tranche_ty~y |   .0595708   .0118697     5.02   0.000     .0362833    .0828583
tranche_o_~y |  -.0288898   .0201718    -1.43   0.152    -.0684656    .0106859
sponsor_du~y |   .1270298   .0331459     3.83   0.000     .0619997    .1920599
 log_at_post |   .0472191   .0127211     3.71   0.000     .0222612     .072177
market_to_~t |   .0026394   .0194323     0.14   0.892    -.0354856    .0407643
ppent_by_~st |   -.045772   .0901348    -0.51   0.612    -.2226105    .1310664
debt_by_at~t |   .0401842   .1005127     0.40   0.689     -.157015    .2373833
cash_by_at~t |   -.265147   .1895811    -1.40   0.162    -.6370925    .1067985
dividend_p~t |   .0236387   .0453559     0.52   0.602    -.0653466     .112624
ret_vol_post |   .3419392   .4996155     0.68   0.494    -.6382729    1.322151
cash_etr_p~t |  -.0535241   .0628353    -0.85   0.394    -.1768027    .0697546
       _cons |  -.2547504   .0939072    -2.71   0.007      -.43899   -.0705108
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m8

. 
. *** DID regressions (Loan Size and Maturity) ***
. 
. local deal_controls_2 "leveraged secured_dummy tranche_type_dummy tranche_o_a
> _dummy sponsor_dummy"

. 
. reghdfe deal_amount_converted excess_interest_scaled excess_interest_scaled_p
> ost `controls' `controls_post' maturity `deal_controls_2', absorb(year ff_48 
> sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  24,   1206) =       6.94
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.3037
                                                  Adj R-squared   =     0.2848
                                                  Within R-sq.    =     0.1737
Number of clusters (gvkey)   =      1,207         Root MSE        =  2310.0597

                              (Std. err. adjusted for 1,207 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
deal_amoun~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |  -505.0033   181.1839    -2.79   0.005    -860.4741   -149.5326
excess_int~t |   288.9055   303.7455     0.95   0.342    -307.0229    884.8338
      log_at |    744.202   108.8352     6.84   0.000     530.6747    957.7294
market_to_~k |   18.61368    103.189     0.18   0.857    -183.8362    221.0636
 ppent_by_at |  -78.89838   325.0474    -0.24   0.808    -716.6196    558.8229
  debt_by_at |   256.3593   534.3924     0.48   0.632    -792.0828    1304.802
  cash_by_at |   379.1268   914.6738     0.41   0.679    -1415.402    2173.655
dividend_p~r |   124.6727   192.5684     0.65   0.517    -253.1337    502.4791
     ret_vol |   1366.917   2127.384     0.64   0.521    -2806.868    5540.702
    cash_etr |  -283.7255   151.9958    -1.87   0.062    -581.9311    14.48005
 log_at_post |   70.85762   163.6975     0.43   0.665    -250.3058    392.0211
market_to_~t |    62.3682   116.2553     0.54   0.592    -165.7169    290.4533
ppent_by_~st |  -871.4983   447.3602    -1.95   0.052    -1749.189    6.192534
debt_by_at~t |  -125.5027   644.7577    -0.19   0.846    -1390.474    1139.469
cash_by_at~t |  -1054.894   1151.488    -0.92   0.360    -3314.037    1204.248
dividend_p~t |  -179.9987    358.936    -0.50   0.616     -884.207    524.2096
ret_vol_post |  -441.6071   3185.916    -0.14   0.890    -6692.161    5808.947
cash_etr_p~t |   204.7152   352.5053     0.58   0.562    -486.8766    896.3069
    maturity |   11.59925   39.51621     0.29   0.769    -65.92889     89.1274
   leveraged |  -257.8715   148.3787    -1.74   0.082    -548.9805    33.23752
secured_du~y |   273.6798   113.2094     2.42   0.016     51.57066     495.789
tranche_ty~y |   86.15019   102.9378     0.84   0.403    -115.8068    288.1072
tranche_o_~y |  -552.9578   138.8613    -3.98   0.000    -825.3944   -280.5211
sponsor_du~y |  -22.07208    179.981    -0.12   0.902    -375.1828    331.0386
       _cons |  -4334.733   678.5577    -6.39   0.000    -5666.018   -3003.449
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m5

. 
. reghdfe log_deal_amount_converted excess_interest_scaled excess_interest_scal
> ed_post `controls' `controls_post' maturity  `deal_controls_2', absorb(year f
> f_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  24,   1206) =      30.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5130
                                                  Adj R-squared   =     0.4997
                                                  Within R-sq.    =     0.3697
Number of clusters (gvkey)   =      1,207         Root MSE        =     0.9132

                              (Std. err. adjusted for 1,207 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
log_deal_a~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |  -.5305796   .1221178    -4.34   0.000    -.7701666   -.2909926
excess_int~t |   .2182133   .1727874     1.26   0.207     -.120784    .5572106
      log_at |   .4541725   .0302856    15.00   0.000     .3947543    .5135908
market_to_~k |   .1047152   .0404899     2.59   0.010     .0252768    .1841537
 ppent_by_at |  -.0312836   .1758779    -0.18   0.859    -.3763442    .3137771
  debt_by_at |   .4856962   .1897147     2.56   0.011     .1134886    .8579038
  cash_by_at |  -.2618292    .327885    -0.80   0.425    -.9051177    .3814593
dividend_p~r |    .013537   .0789761     0.17   0.864    -.1414088    .1684829
     ret_vol |  -.5934921   .8878171    -0.67   0.504     -2.33533    1.148346
    cash_etr |  -.1505118    .077729    -1.94   0.053    -.3030108    .0019872
 log_at_post |   .0089675   .0355672     0.25   0.801    -.0608129     .078748
market_to_~t |  -.0276352   .0508703    -0.54   0.587    -.1274393    .0721688
ppent_by_~st |  -.2852747   .2033608    -1.40   0.161     -.684255    .1137055
debt_by_at~t |  -.4888278   .2669378    -1.83   0.067    -1.012542    .0348863
cash_by_at~t |  -.3843939   .4254802    -0.90   0.366    -1.219158    .4503698
dividend_p~t |   .0347594   .1062836     0.33   0.744     -.173762    .2432807
ret_vol_post |    1.51549    1.27002     1.19   0.233    -.9762033    4.007183
cash_etr_p~t |   .0958694   .1600965     0.60   0.549    -.2182291    .4099679
    maturity |   .1127341   .0167213     6.74   0.000      .079928    .1455403
   leveraged |  -.2637339   .0752654    -3.50   0.000    -.4113995   -.1160683
secured_du~y |   .1541945   .0648374     2.38   0.018     .0269878    .2814012
tranche_ty~y |   .0561379   .0315327     1.78   0.075    -.0057271    .1180029
tranche_o_~y |  -.4353954    .043351   -10.04   0.000    -.5204472   -.3503436
sponsor_du~y |  -.0147111    .086298    -0.17   0.865    -.1840219    .1545997
       _cons |   2.697058   .2523238    10.69   0.000     2.202016      3.1921
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m6

. 
. reghdfe maturity excess_interest_scaled excess_interest_scaled_post `controls
> ' `controls_post' log_deal_amount_converted `deal_controls_2', absorb(year ff
> _48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,476
Absorbing 3 HDFE groups                           F(  24,   1206) =      17.96
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2766
                                                  Adj R-squared   =     0.2569
                                                  Within R-sq.    =     0.1250
Number of clusters (gvkey)   =      1,207         Root MSE        =     1.2537

                              (Std. err. adjusted for 1,207 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
    maturity | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |  -.1573794   .1286084    -1.22   0.221    -.4097004    .0949415
excess_int~t |  -.0973003   .1787465    -0.54   0.586     -.447989    .2533884
      log_at |  -.0605415   .0355462    -1.70   0.089    -.1302807    .0091978
market_to_~k |  -.0033385   .0312137    -0.11   0.915    -.0645777    .0579007
 ppent_by_at |  -.0223551   .1757528    -0.13   0.899    -.3671702    .3224601
  debt_by_at |  -.4674634   .2592092    -1.80   0.072    -.9760145    .0410876
  cash_by_at |  -.5882089   .3149101    -1.87   0.062    -1.206041    .0296235
dividend_p~r |   -.090647   .0789057    -1.15   0.251    -.2454548    .0641608
     ret_vol |  -.6738252   .8379237    -0.80   0.421    -2.317775    .9701249
    cash_etr |  -.0313839   .0826215    -0.38   0.704    -.1934818    .1307141
 log_at_post |   -.123488   .0369391    -3.34   0.001    -.1959601   -.0510159
market_to_~t |   .0242755   .0464071     0.52   0.601     -.066772    .1153231
ppent_by_~st |   .0172408   .2405177     0.07   0.943    -.4546389    .4891204
debt_by_at~t |  -.0140001   .3095073    -0.05   0.964    -.6212326    .5932324
cash_by_at~t |   1.157759   .4802455     2.41   0.016      .215549    2.099968
dividend_p~t |   .0646098   .1147465     0.56   0.573    -.1605152    .2897348
ret_vol_post |  -.2782369    1.39175    -0.20   0.842    -3.008757    2.452284
cash_etr_p~t |  -.0168439   .1753738    -0.10   0.924    -.3609157    .3272278
log_deal_a~d |   .2124751   .0308336     6.89   0.000     .1519816    .2729685
   leveraged |   .1653331   .0695632     2.38   0.018     .0288547    .3018115
secured_du~y |   .6267991   .0630966     9.93   0.000     .5030077    .7505904
tranche_ty~y |   .1627687   .0556461     2.93   0.004     .0535948    .2719427
tranche_o_~y |   .3192344   .0537219     5.94   0.000     .2138357    .4246331
sponsor_du~y |   .3915373   .0680953     5.75   0.000     .2579389    .5251357
       _cons |   3.886104   .2674349    14.53   0.000     3.361415    4.410794
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m7

. 
. * save the results (esttab) using tabdir
. esttab m5 m6 m7 m8 m1 m2 m3 m4 using "$tabdir/other_terms_ie_excess.tex", rep
> lace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant keep(excess
> _interest_scaled excess_interest_scaled_post)
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/other_terms_ie_excess.tex)

. est clear

. 
. ******************      Alternative: Fixed Pre-Period Treatment  ************
> ******
. * Treatment is fixed at pre-period average (2014-2017) from Compustat panel
. 
. * Step 1: Calculate pre-period average from Compustat panel
. import delimited "$cleandir/comp_crspa_merged.csv", clear
(encoding automatically selected: ISO-8859-1)
(123 vars, 58,685 obs)

. 
. * Calculate excess_interest_scaled from Compustat variables
. gen excess_interest_scaled_compa = interest_expense_total_excess / xint

. replace excess_interest_scaled_compa = 0 if excess_interest_scaled_compa == .
>  | excess_interest_scaled_compa < 0
(0 real changes made)

. 
. * Keep pre-period years (2014-2017)
. keep if fyear >= 2014 & fyear <= 2017
(44,231 observations deleted)

. 
. * Calculate firm-level pre-period average
. collapse (mean) excess_interest_pre = excess_interest_scaled_compa, by(gvkey)

. 
. tempfile pre_period_treatment

. save `pre_period_treatment'
file /var/folders/n2/pgdf58ms1yd3ch8xjn9fmpmm0000gq/T//St66276.000003 saved
    as .dta format

. 
. * Step 2: Load loan sample and merge pre-period treatment
. use "$cleandir/tranche_level_ds_compa_wlabel.dta", clear

. merge m:1 gvkey using `pre_period_treatment', keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             3,350  
    -----------------------------------------

. 
. * Create interaction with post
. gen excess_pre_X_post = excess_interest_pre * post

. 
. * Label variables
. label var excess_interest_pre "Excess Interest (Pre-Period Avg, Scaled)"

. label var excess_pre_X_post "Excess Interest (Pre-Period Avg, Scaled) x Post"

. 
. local controls "log_at market_to_book ppent_by_at debt_by_at cash_by_at divid
> end_payer ret_vol cash_etr"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dum
> my tranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. local controls_post "log_at_post market_to_book_post ppent_by_at_post debt_by
> _at_post cash_by_at_post dividend_payer_post ret_vol_post cash_etr_post"

. 
. * Run regressions with fixed pre-period treatment
. reghdfe margin_bps excess_interest_pre excess_pre_X_post `deal_controls', abs
> orb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,350
Absorbing 3 HDFE groups                           F(   9,   1138) =     115.15
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5453
                                                  Adj R-squared   =     0.5346
                                                  Within R-sq.    =     0.3926
Number of clusters (gvkey)   =      1,139         Root MSE        =   118.5655

                              (Std. err. adjusted for 1,139 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~e |    88.2553   17.74629     4.97   0.000     53.43618    123.0744
excess_pre~t |  -66.57013   21.13962    -3.15   0.002    -108.0471   -25.09312
   leveraged |   86.63362   8.063421    10.74   0.000     70.81278    102.4545
    maturity |   9.169505    2.64887     3.46   0.001     3.972288    14.36672
log_deal_a~d |  -20.67074   2.655845    -7.78   0.000    -25.88165   -15.45984
secured_du~y |   63.32926   7.243873     8.74   0.000     49.11642    77.54211
tranche_ty~y |   79.29831   4.883039    16.24   0.000     69.71754    88.87909
tranche_o_~y |   17.31605   5.704953     3.04   0.002     6.122645    28.50946
sponsor_du~y |   95.16353   9.670982     9.84   0.000     76.18857    114.1385
       _cons |   177.3002   22.21435     7.98   0.000     133.7145    220.8858
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store f1

. 
. reghdfe margin_bps excess_interest_pre excess_pre_X_post `controls' `deal_con
> trols', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,350
Absorbing 3 HDFE groups                           F(  17,   1138) =      75.06
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5574
                                                  Adj R-squared   =     0.5459
                                                  Within R-sq.    =     0.4088
Number of clusters (gvkey)   =      1,139         Root MSE        =   117.1098

                              (Std. err. adjusted for 1,139 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~e |   72.90458   18.23005     4.00   0.000     37.13629    108.6729
excess_pre~t |  -70.92339   20.93302    -3.39   0.001     -111.995   -29.85173
      log_at |  -4.951756   2.997467    -1.65   0.099    -10.83294    .9294277
market_to_~k |  -6.963322   3.857855    -1.80   0.071    -14.53263    .6059849
 ppent_by_at |   3.784066   17.23575     0.22   0.826    -30.03335    37.60148
  debt_by_at |   64.52578   18.91951     3.41   0.001     27.40474    101.6468
  cash_by_at |   33.86634   28.37161     1.19   0.233     -21.8002    89.53289
dividend_p~r |   8.560503   6.517458     1.31   0.189    -4.227081    21.34809
     ret_vol |   311.4402   83.63549     3.72   0.000     147.3431    475.5373
    cash_etr |   3.219449   6.069209     0.53   0.596    -8.688648    15.12755
   leveraged |   79.92397    8.66129     9.23   0.000     62.93008    96.91786
    maturity |   9.917993    2.60123     3.81   0.000     4.814247    15.02174
log_deal_a~d |  -18.58595   3.044664    -6.10   0.000    -24.55973   -12.61216
secured_du~y |   58.10475   7.153165     8.12   0.000     44.06987    72.13962
tranche_ty~y |    78.4971   4.761913    16.48   0.000     69.15399    87.84022
tranche_o_~y |   18.08258   5.809606     3.11   0.002     6.683842    29.48132
sponsor_du~y |   99.29855   9.622164    10.32   0.000     80.41937    118.1777
       _cons |   158.8194   30.62486     5.19   0.000     98.73187    218.9069
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store f2

. 
. reghdfe margin_bps excess_interest_pre excess_pre_X_post `controls' `deal_con
> trols' `controls_post', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      3,350
Absorbing 3 HDFE groups                           F(  25,   1138) =      52.94
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5598
                                                  Adj R-squared   =     0.5473
                                                  Within R-sq.    =     0.4120
Number of clusters (gvkey)   =      1,139         Root MSE        =   116.9378

                              (Std. err. adjusted for 1,139 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~e |   84.89797   19.26796     4.41   0.000     47.09326    122.7027
excess_pre~t |  -99.51731   24.97098    -3.99   0.000    -148.5116   -50.52298
      log_at |   -2.92062   3.615668    -0.81   0.419    -10.01474    4.173504
market_to_~k |  -2.313891   6.199841    -0.37   0.709    -14.47829    9.850512
 ppent_by_at |  -2.154447   21.12727    -0.10   0.919    -43.60723    39.29834
  debt_by_at |   51.51019   24.05465     2.14   0.032     4.313753    98.70663
  cash_by_at |   21.99667   38.04102     0.58   0.563    -52.64174    96.63508
dividend_p~r |   14.73556   8.596569     1.71   0.087    -2.131342    31.60247
     ret_vol |   298.9331    108.386     2.76   0.006     86.27435    511.5918
    cash_etr |   3.936296    9.15665     0.43   0.667    -14.02952    21.90211
   leveraged |   78.04246   8.361507     9.33   0.000     61.63676    94.44816
    maturity |   9.956275   2.539582     3.92   0.000     4.973485    14.93906
log_deal_a~d |  -18.31689   3.028936    -6.05   0.000    -24.25982   -12.37397
secured_du~y |   58.32101   6.915661     8.43   0.000     44.75213    71.88989
tranche_ty~y |   78.58929   4.765515    16.49   0.000     69.23911    87.93948
tranche_o_~y |   19.21116   5.620846     3.42   0.001     8.182775    30.23955
sponsor_du~y |    99.1482   9.428009    10.52   0.000     80.64997    117.6464
 log_at_post |  -5.285487   3.387035    -1.56   0.119    -11.93102    1.360047
market_to_~t |  -10.03629   6.792228    -1.48   0.140    -23.36299    3.290402
ppent_by_~st |   7.577679   23.91669     0.32   0.751    -39.34807    54.50343
debt_by_at~t |   39.68275    28.9968     1.37   0.171    -17.21044    96.57594
cash_by_at~t |   17.91126   51.08313     0.35   0.726    -82.31644     118.139
dividend_p~t |   -17.6514   11.38541    -1.55   0.121    -39.99016    4.687363
ret_vol_post |   29.93776   158.1168     0.19   0.850    -280.2954     340.171
cash_etr_p~t |  -3.398482   16.52118    -0.21   0.837    -35.81389    29.01692
       _cons |   160.0416   30.15375     5.31   0.000     100.8784    219.2048
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        44           1          43     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store f3

. 
. * Save results
. esttab f1 f2 f3 using "$tabdir/margin_ie_excess_fixedpre.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant drop(_cons 
> `controls_post')
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_ie_excess_fixedpre.tex)

. 
end of do-file
