
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 60-user network, expiring 14 Aug 2026
Serial number: 401909327398
  Licensed to: Zirui Song
               MIT Sloan

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do AN_5_MechanismTests.do 

. /***********
>         Globals for Paths
>         ***********/
. 
. *** Change repodir and overleafdir paths for different users
. global repodir "/Users/zrsong/MIT Dropbox/Zirui Song/Research Projects/MPS_In
> terest Deductibility and Debt Contracting"

. global overleafdir "/Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax In
> cidence and Loan Contract Terms"

. 
. global datadir "$repodir/3. Data"

. global rawdir "$datadir/Raw"

. global cleandir "$datadir/Processed"

. 
. global tabdir "$overleafdir/Tables"

. global figdir "$overleafdir/Figures"

. 
. global codedir "$repodir/4. Code/Replication"

. 
. /***********
>         Mechanism Tests
>         ***********/
.         
.         *** Table 7: Competition
. 
. *** construct firm-level and industry-level competition measures
. * firm
. use "$cleandir/tranche_level_ds_compa_wlabel.dta", clear

. 
. bysort gvkey: egen avg_number_of_lead_byfirm = mean(number_of_lead_arrangers)

. egen median_number_of_lead = median(avg_number_of_lead_byfirm)

. egen p33_number_of_lead_byfirm = pctile(avg_number_of_lead_byfirm), p(33)

. egen p67_number_of_lead_byfirm = pctile(avg_number_of_lead_byfirm), p(67)

. 
. gen high_competition = 1 if avg_number_of_lead_byfirm >= p67_number_of_lead_b
> yfirm
(2,322 missing values generated)

. replace high_competition = 0 if avg_number_of_lead_byfirm <= p33_number_of_le
> ad_byfirm
(1,179 real changes made)

. 
. keep gvkey high_competition

. duplicates drop 

Duplicates in terms of all variables

(2,269 observations deleted)

. tempfile firm_competition_measure

. save `firm_competition_measure'
file /var/folders/n2/pgdf58ms1yd3ch8xjn9fmpmm0000gq/T//St66364.000001 saved
    as .dta format

. 
. * industry
. use "$cleandir/tranche_level_ds_compa_wlabel.dta", clear

. 
. replace lender_parent_id = lender_id if lender_parent_id == .
(1 real change made)

. * KKR and Everbank have missing lender_parent_id
. bysort ff_48: egen number_of_lead_byindustry = nvals(lender_parent_id)

. bysort ff_48: egen number_of_firms = nvals(gvkey)

. replace number_of_lead_byindustry = number_of_lead_byindustry/number_of_firms
(3,471 real changes made)

. 
. egen median_number_of_lead = median(number_of_lead_byindustry)

. egen p33_number_of_lead = pctile(number_of_lead_byindustry), p(33)

. egen p67_number_of_lead = pctile(number_of_lead_byindustry), p(67)

. 
. gen high_competition_industry = 1 if number_of_lead_byindustry >= p67_number_
> of_lead
(2,303 missing values generated)

. replace high_competition_industry = 0 if number_of_lead_byindustry <= p33_num
> ber_of_lead
(1,269 real changes made)

. 
. keep ff_48 high_competition_industry

. duplicates drop 

Duplicates in terms of all variables

(3,432 observations deleted)

. tempfile industry_competition_measure

. save `industry_competition_measure'
file /var/folders/n2/pgdf58ms1yd3ch8xjn9fmpmm0000gq/T//St66364.000002 saved
    as .dta format

. 
. *** merge back to data for regressions
. use "$cleandir/tranche_level_ds_compa_wlabel.dta", clear

. merge m:1 gvkey using `firm_competition_measure', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             3,476  
    -----------------------------------------

. merge m:1 ff_48 using `industry_competition_measure', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             3,476  
    -----------------------------------------

. 
. save "$cleandir/tranche_level_ds_compa_wlabel_withcomp.dta", replace
file /Users/zrsong/MIT Dropbox/Zirui Song/Research Projects/MPS_Interest
    Deductibility and Debt Contracting/3.
    Data/Processed/tranche_level_ds_compa_wlabel_withcomp.dta saved

. 
. use "$cleandir/tranche_level_ds_compa_wlabel_withcomp.dta", clear

. 
. local controls "log_at market_to_book ppent_by_at debt_by_at cash_by_at divid
> end_payer ret_vol cash_etr"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dum
> my tranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. local controls_post "log_at_post market_to_book_post ppent_by_at_post debt_by
> _at_post cash_by_at_post dividend_payer_post ret_vol_post cash_etr_post"   

. 
. local treat_vars "treated treated_post treated_loss treated_loss_post"

. 
. *** split sample tests with continuous measure
. 
. fvset base 1 ff_48

. fvset base 1 gvkey

. 
. reg margin_bps excess_interest_scaled excess_interest_scaled_post `controls' 
> `deal_controls' `controls_post' i.year i.ff_48 ib2.sp_rating_num if high_comp
> etition_industry == 0
note: 1b.ff_48 identifies no observations in the sample.
note: 44.ff_48 omitted because of collinearity.
note: 2b.sp_rating_num identifies no observations in the sample.
note: 20.sp_rating_num omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =     1,269
-------------+----------------------------------   F(53, 1215)     =     31.44
       Model |  22329600.2        53  421313.211   Prob > F        =    0.0000
    Residual |  16282454.4     1,215   13401.197   R-squared       =    0.5783
-------------+----------------------------------   Adj R-squared   =    0.5599
       Total |  38612054.6     1,268  30451.1472   Root MSE        =    115.76

------------------------------------------------------------------------------
  margin_bps | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   63.13052   15.74767     4.01   0.000     32.23488    94.02617
excess_int~t |  -25.44418   23.29956    -1.09   0.275    -71.15602    20.26767
      log_at |  -1.806013   4.230606    -0.43   0.670    -10.10612     6.49409
market_to_~k |  -1.683202   4.050258    -0.42   0.678    -9.629478    6.263073
 ppent_by_at |   36.95546   27.05412     1.37   0.172    -16.12252    90.03345
  debt_by_at |   37.04673   27.28133     1.36   0.175    -16.47701    90.57048
  cash_by_at |   19.40196   43.69972     0.44   0.657    -66.33333    105.1373
dividend_p~r |   12.46733   10.31374     1.21   0.227    -7.767381    32.70205
     ret_vol |   340.6961   114.0575     2.99   0.003     116.9246    564.4675
    cash_etr |    38.4578   11.95597     3.22   0.001     15.00117    61.91444
   leveraged |   111.3149   10.36033    10.74   0.000     90.98882    131.6411
    maturity |   7.811101   2.811274     2.78   0.006     2.295611    13.32659
log_deal_a~d |  -15.05652   3.483923    -4.32   0.000     -21.8917   -8.221352
secured_du~y |   61.11302   8.782741     6.96   0.000       43.882    78.34404
tranche_ty~y |   67.90415   6.892962     9.85   0.000     54.38072    81.42758
tranche_o_~y |   10.16815   7.969329     1.28   0.202    -5.467025    25.80332
sponsor_du~y |   111.5947   9.658076    11.55   0.000     92.64632     130.543
 log_at_post |   3.452839   4.862542     0.71   0.478    -6.087071    12.99275
market_to_~t |   -2.84567   6.017734    -0.47   0.636    -14.65197    8.960632
ppent_by_~st |  -49.10008   35.51503    -1.38   0.167    -118.7777    20.57751
debt_by_at~t |   47.68656   38.32164     1.24   0.214    -27.49736    122.8705
cash_by_at~t |   6.745905   63.25156     0.11   0.915    -117.3485    130.8403
dividend_p~t |  -12.01413   15.11701    -0.79   0.427    -41.67247    17.64421
ret_vol_post |   178.8065   180.8798     0.99   0.323    -176.0649    533.6779
cash_etr_p~t |    -49.398   25.24926    -1.96   0.051    -98.93498    .1389813
             |
        year |
       2015  |   14.88384   12.75298     1.17   0.243    -10.13647    39.90416
       2016  |   5.320133       13.5     0.39   0.694    -21.16576    31.80603
       2017  |   2.318862   13.26907     0.17   0.861    -23.71397     28.3517
       2018  |  -13.83624   47.54685    -0.29   0.771    -107.1193    79.44681
       2019  |   -47.2064   48.87733    -0.97   0.334    -143.0997    48.68694
       2022  |   -19.8438   50.99849    -0.39   0.697    -119.8987    80.21106
       2023  |  -39.79862   52.44672    -0.76   0.448    -142.6948    63.09757
             |
       ff_48 |
          1  |          0  (empty)
         21  |   20.26863   16.38688     1.24   0.216    -11.88109    52.41835
         34  |   15.97425   13.77218     1.16   0.246    -11.04564    42.99414
         36  |   23.22309     15.457     1.50   0.133    -7.102292    53.54847
         37  |   25.70724   16.07868     1.60   0.110    -5.837816    57.25229
         43  |   .9566575   14.90468     0.06   0.949     -28.2851    30.19841
         44  |          0  (omitted)
             |
sp_rating_~m |
          0  |   41.04573   87.08218     0.47   0.637    -129.8024    211.8939
          2  |          0  (empty)
          4  |   193.0655   107.6492     1.79   0.073    -18.13343    404.2643
          5  |   229.7508   121.9862     1.88   0.060    -9.576106    469.0778
          7  |   102.2371   92.06625     1.11   0.267    -78.38938    282.8635
          8  |   37.85454   88.36679     0.43   0.668    -135.5139     211.223
          9  |   11.31273   88.21644     0.13   0.898    -161.7607    184.3862
         10  |  -27.33177   88.02555    -0.31   0.756    -200.0307    145.3672
         11  |  -31.07602   87.96582    -0.35   0.724    -203.6578    141.5058
         12  |  -6.829412   89.04091    -0.08   0.939    -181.5204    167.8616
         13  |   52.78475    88.1078     0.60   0.549    -120.0756    225.6451
         14  |   40.02194   87.45136     0.46   0.647    -131.5505    211.5944
         15  |   105.1598   89.12022     1.18   0.238    -69.68684    280.0063
         16  |   67.97169   87.20367     0.78   0.436    -103.1148    239.0582
         17  |   44.80342   95.32998     0.47   0.638    -142.2262    231.8331
         18  |   33.46396   109.8895     0.30   0.761    -182.1304    249.0583
         19  |   158.4034   111.0057     1.43   0.154    -59.38061    376.1875
         20  |          0  (omitted)
             |
       _cons |    33.8263   98.27714     0.34   0.731    -158.9854     226.638
------------------------------------------------------------------------------

. estimates store m1

. 
. reg margin_bps excess_interest_scaled excess_interest_scaled_post `controls' 
> `deal_controls' `controls_post' i.year i.ff_48 ib2.sp_rating_num if high_comp
> etition_industry == 1
note: 2b.sp_rating_num identifies no observations in the sample.
note: 19.sp_rating_num omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =     1,173
-------------+----------------------------------   F(77, 1095)     =     18.46
       Model |  20208482.1        77  262447.819   Prob > F        =    0.0000
    Residual |  15571236.7     1,095  14220.3075   R-squared       =    0.5648
-------------+----------------------------------   Adj R-squared   =    0.5342
       Total |  35779718.7     1,172  30528.7703   Root MSE        =    119.25

------------------------------------------------------------------------------
  margin_bps | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   106.4038   17.60929     6.04   0.000     71.85204    140.9556
excess_int~t |  -98.11124   26.71233    -3.67   0.000    -150.5244   -45.69811
      log_at |  -4.673171   4.201219    -1.11   0.266    -12.91652    3.570179
market_to_~k |  -5.077287   7.023709    -0.72   0.470    -18.85874    8.704164
 ppent_by_at |  -35.41239   26.88534    -1.32   0.188    -88.16501    17.34022
  debt_by_at |   24.55138   25.44739     0.96   0.335    -25.37979    74.48254
  cash_by_at |  -61.28446   58.94243    -1.04   0.299    -176.9373    54.36842
dividend_p~r |   12.69755   11.01873     1.15   0.249    -8.922674    34.31777
     ret_vol |   198.3694   113.1362     1.75   0.080    -23.61892    420.3578
    cash_etr |   7.928195   11.04319     0.72   0.473       -13.74    29.59639
   leveraged |   67.61132    11.4259     5.92   0.000     45.19218    90.03046
    maturity |   6.623769   2.724496     2.43   0.015     1.277947    11.96959
log_deal_a~d |   -18.3094   4.057225    -4.51   0.000    -26.27021   -10.34858
secured_du~y |   49.09627   10.05604     4.88   0.000     29.36499    68.82755
tranche_ty~y |    69.0075   7.441342     9.27   0.000      54.4066     83.6084
tranche_o_~y |    23.6052   8.705528     2.71   0.007       6.5238     40.6866
sponsor_du~y |   113.3282   11.42927     9.92   0.000     90.90241    135.7539
 log_at_post |  -2.718025   5.569614    -0.49   0.626    -13.64635    8.210296
market_to_~t |  -4.533001   9.604996    -0.47   0.637    -23.37928    14.31328
ppent_by_~st |    48.4763   38.90594     1.25   0.213    -27.86232    124.8149
debt_by_at~t |   14.89974    41.6302     0.36   0.720    -66.78425    96.58373
cash_by_at~t |   54.61962   94.11502     0.58   0.562    -130.0465    239.2858
dividend_p~t |  -18.26117   17.87606    -1.02   0.307    -53.33638    16.81404
ret_vol_post |  -59.35383   213.3527    -0.28   0.781    -477.9801    359.2725
cash_etr_p~t |   20.19617   26.58433     0.76   0.448     -31.9658    72.35815
             |
        year |
       2015  |  -22.03443    13.6474    -1.61   0.107    -48.81244    4.743584
       2016  |  -9.646955    14.7943    -0.65   0.514    -38.67533    19.38142
       2017  |  -26.93748   13.86098    -1.94   0.052    -54.13456    .2595927
       2018  |  -9.914302   59.85776    -0.17   0.868    -127.3632    107.5346
       2019  |   11.30254   61.08714     0.19   0.853    -108.5585    131.1636
       2022  |    10.6029    61.4289     0.17   0.863    -109.9288    131.1346
       2023  |   8.109575   65.36374     0.12   0.901    -120.1428    136.3619
             |
       ff_48 |
          2  |   133.2625   87.97687     1.51   0.130    -39.35984    305.8848
          3  |   117.7515   91.52457     1.29   0.199     -61.8319    297.3348
          4  |   148.6519   99.78507     1.49   0.137    -47.13969    344.4434
          5  |    176.196   94.45444     1.87   0.062    -9.136146    361.5282
          6  |    141.488   91.36761     1.55   0.122    -37.78738    320.7634
          7  |   199.2993   87.82712     2.27   0.023     26.97087    371.6278
          8  |    191.752    91.4303     2.10   0.036     12.35356    371.1504
          9  |   169.6683   88.13068     1.93   0.054     -3.25585    342.5924
         10  |   156.3434   89.85611     1.74   0.082     -19.9662    332.6531
         12  |   159.2717   88.29838     1.80   0.072    -13.98145    332.5248
         14  |   159.0245   87.73924     1.81   0.070    -13.13154    331.1805
         15  |   128.2544   91.81136     1.40   0.163    -51.89169    308.4005
         16  |   150.9121   94.42922     1.60   0.110    -34.37057    336.1948
         17  |   202.9826   90.64925     2.24   0.025     25.11674    380.8485
         18  |   154.8661   88.25015     1.75   0.080     -18.2924    328.0246
         19  |   111.3357   91.22836     1.22   0.223    -67.66642    290.3379
         20  |   128.9431   113.8813     1.13   0.258    -94.50718    352.3934
         22  |   162.3732   89.82449     1.81   0.071    -13.87435    338.6208
         24  |    146.724   88.12717     1.66   0.096    -26.19326    319.6412
         25  |   174.6098   100.6374     1.74   0.083    -22.85414    372.0736
         26  |   159.5728   101.3995     1.57   0.116    -39.38644     358.532
         27  |   279.9647   114.7267     2.44   0.015     54.85577    505.0736
         28  |   239.9741   96.71576     2.48   0.013     50.20494    429.7433
         29  |   259.6584   92.51231     2.81   0.005     78.13693    441.1798
         32  |   170.1922   87.89547     1.94   0.053    -2.270335    342.6548
         33  |   198.5622   88.53329     2.24   0.025     24.84808    372.2762
         35  |   194.4388    89.2827     2.18   0.030     19.25429    369.6233
         40  |   140.6356    90.0921     1.56   0.119    -36.13704    317.4083
         49  |   112.9439   89.92934     1.26   0.209    -63.50938    289.3972
             |
sp_rating_~m |
          0  |  -180.6541   125.2097    -1.44   0.149    -426.3322    65.02404
          1  |    74.1484   137.8446     0.54   0.591     -196.321    344.6178
          2  |          0  (empty)
          5  |  -51.64967   177.4556    -0.29   0.771    -399.8411    296.5417
          6  |  -98.82793   142.3227    -0.69   0.488    -378.0839     180.428
          7  |  -138.0639   128.5422    -1.07   0.283    -390.2808     114.153
          8  |  -127.9674   126.2336    -1.01   0.311    -375.6545    119.7198
          9  |  -177.4065   126.5108    -1.40   0.161    -425.6374    70.82446
         10  |    -194.27   125.9954    -1.54   0.123    -441.4896    52.94964
         11  |   -196.775   126.1066    -1.56   0.119    -444.2129    50.66285
         12  |  -215.1714   126.0878    -1.71   0.088    -462.5724    32.22953
         13  |  -188.3604   126.4612    -1.49   0.137    -436.4941    59.77319
         14  |  -175.3281   126.2138    -1.39   0.165    -422.9764    72.32021
         15  |  -177.9216   126.2054    -1.41   0.159    -425.5533    69.71008
         16  |  -179.5377   126.1408    -1.42   0.155    -427.0428    67.96738
         17  |  -2.694813   139.0372    -0.02   0.985    -275.5042    270.1146
         18  |  -129.0258   130.8589    -0.99   0.324    -385.7884    127.7368
         19  |          0  (omitted)
             |
       _cons |   247.8232   159.3564     1.56   0.120    -64.85519    560.5015
------------------------------------------------------------------------------

. estimates store m2

. 
. suest m1 m2, vce(cluster gvkey)

Simultaneous results for m1, m2                          Number of obs = 2,442

                                (Std. err. adjusted for 850 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
             | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
m1_mean      |
excess_int~d |   63.13052   23.19605     2.72   0.006     17.66709     108.594
excess_int~t |  -25.44418   31.87085    -0.80   0.425    -87.90989    37.02153
      log_at |  -1.806013   6.203841    -0.29   0.771    -13.96532    10.35329
market_to_~k |  -1.683202   6.462076    -0.26   0.794    -14.34864    10.98223
 ppent_by_at |   36.95546   38.25766     0.97   0.334    -38.02816    111.9391
  debt_by_at |   37.04673   35.51206     1.04   0.297    -32.55563    106.6491
  cash_by_at |   19.40196   48.40091     0.40   0.689    -75.46208     114.266
dividend_p~r |   12.46733   13.14152     0.95   0.343    -13.28958    38.22424
     ret_vol |   340.6961   185.5084     1.84   0.066    -22.89367    704.2858
    cash_etr |    38.4578   15.72299     2.45   0.014     7.641304     69.2743
   leveraged |   111.3149   13.14187     8.47   0.000     85.55735    137.0725
    maturity |   7.811101   3.843921     2.03   0.042     .2771545    15.34505
log_deal_a~d |  -15.05652    4.70634    -3.20   0.001    -24.28078   -5.832267
secured_du~y |   61.11302   11.32325     5.40   0.000     38.91986    83.30618
tranche_ty~y |   67.90415   6.698273    10.14   0.000     54.77578    81.03252
tranche_o_~y |   10.16815   9.581508     1.06   0.289    -8.611262    28.94756
sponsor_du~y |   111.5947   14.14321     7.89   0.000     83.87449    139.3149
 log_at_post |   3.452839   5.699405     0.61   0.545    -7.717789    14.62347
market_to_~t |   -2.84567   7.620259    -0.37   0.709     -17.7811    12.08976
ppent_by_~st |  -49.10008    43.0653    -1.14   0.254    -133.5065    35.30635
debt_by_at~t |   47.68656   45.74422     1.04   0.297    -41.97046    137.3436
cash_by_at~t |   6.745905   70.17461     0.10   0.923    -130.7938    144.2856
dividend_p~t |  -12.01413   17.00641    -0.71   0.480    -45.34608    21.31783
ret_vol_post |   178.8065   242.1723     0.74   0.460    -295.8425    653.4555
cash_etr_p~t |    -49.398   31.07362    -1.59   0.112    -110.3012    11.50518
             |
        year |
       2015  |   14.88384   14.72602     1.01   0.312    -13.97862    43.74631
       2016  |   5.320133   15.08452     0.35   0.724    -24.24498    34.88525
       2017  |   2.318862   17.08705     0.14   0.892    -31.17113    35.80886
       2018  |  -13.83624   60.29513    -0.23   0.818    -132.0125    104.3401
       2019  |   -47.2064   61.56417    -0.77   0.443      -167.87    73.45716
       2022  |   -19.8438   62.97746    -0.32   0.753    -143.2774    103.5897
       2023  |  -39.79862   65.58765    -0.61   0.544     -168.348    88.75081
             |
       ff_48 |
         21  |   20.26863    23.3408     0.87   0.385     -25.4785    66.01575
         34  |   15.97425   20.48518     0.78   0.436    -24.17596    56.12447
         36  |   23.22309   23.04617     1.01   0.314    -21.94657    68.39275
         37  |   25.70724   23.53572     1.09   0.275    -20.42193    71.83641
         43  |   .9566575   19.87612     0.05   0.962    -37.99983    39.91315
         44  |          0  (omitted)
             |
sp_rating_~m |
          0  |   41.04573   35.76146     1.15   0.251    -29.04544    111.1369
          2  |          0  (empty)
          4  |   193.0655   51.28637     3.76   0.000     92.54602    293.5849
          5  |   229.7508   131.3059     1.75   0.080    -27.60402    487.1057
          7  |   102.2371   51.84706     1.97   0.049     .6187153    203.8555
          8  |   37.85454   38.62602     0.98   0.327    -37.85107    113.5602
          9  |   11.31273   41.81026     0.27   0.787    -70.63387    93.25933
         10  |  -27.33177   36.56761    -0.75   0.455    -99.00296    44.33943
         11  |  -31.07602   39.04631    -0.80   0.426    -107.6054    45.45334
         12  |  -6.829412   37.24949    -0.18   0.855    -79.83707    66.17824
         13  |   52.78475   36.20341     1.46   0.145    -18.17263    123.7421
         14  |   40.02194   33.61602     1.19   0.234    -25.86424    105.9081
         15  |   105.1598   38.76399     2.71   0.007     29.18374    181.1358
         16  |   67.97169   31.79159     2.14   0.033     5.661326    130.2821
         17  |   44.80342   36.52374     1.23   0.220    -26.78179    116.3886
         18  |   33.46396   45.24031     0.74   0.459    -55.20543    122.1333
         19  |   158.4034   45.32207     3.50   0.000     69.57382    247.2331
         20  |          0  (omitted)
             |
       _cons |    33.8263   72.64346     0.47   0.641    -108.5523    176.2049
-------------+----------------------------------------------------------------
m1_lnvar     |
       _cons |   9.503099   .0728105   130.52   0.000     9.360393    9.645805
-------------+----------------------------------------------------------------
m2_mean      |
excess_int~d |   106.4038   28.59723     3.72   0.000     50.35426    162.4533
excess_int~t |  -98.11124    37.7795    -2.60   0.009    -172.1577   -24.06478
      log_at |  -4.673171   6.467299    -0.72   0.470    -17.34884    8.002501
market_to_~k |  -5.077287   9.752342    -0.52   0.603    -24.19153    14.03695
 ppent_by_at |  -35.41239   37.19234    -0.95   0.341     -108.308    37.48325
  debt_by_at |   24.55138    40.3962     0.61   0.543    -54.62372    103.7265
  cash_by_at |  -61.28446     77.972    -0.79   0.432    -214.1068    91.53786
dividend_p~r |   12.69755   14.76803     0.86   0.390    -16.24727    41.64236
     ret_vol |   198.3694   170.6497     1.16   0.245    -136.0978    532.8366
    cash_etr |   7.928195   12.55731     0.63   0.528    -16.68368    32.54007
   leveraged |   67.61132   11.39794     5.93   0.000     45.27177    89.95087
    maturity |   6.623769   4.853408     1.36   0.172    -2.888736    16.13627
log_deal_a~d |   -18.3094   5.486602    -3.34   0.001    -29.06294   -7.555854
secured_du~y |   49.09627   11.62004     4.23   0.000     26.32142    71.87113
tranche_ty~y |    69.0075   6.986357     9.88   0.000     55.31449    82.70051
tranche_o_~y |    23.6052   9.086837     2.60   0.009     5.795327    41.41507
sponsor_du~y |   113.3282   18.62357     6.09   0.000     76.82664    149.8297
 log_at_post |  -2.718025   5.668298    -0.48   0.632    -13.82769    8.391634
market_to_~t |  -4.533001   11.50134    -0.39   0.693    -27.07521    18.00921
ppent_by_~st |    48.4763    44.1791     1.10   0.273    -38.11314    135.0657
debt_by_at~t |   14.89974   48.01304     0.31   0.756    -79.20409    109.0036
cash_by_at~t |   54.61962   100.9567     0.54   0.588    -143.2519    252.4911
dividend_p~t |  -18.26117   19.09432    -0.96   0.339    -55.68535    19.16301
ret_vol_post |  -59.35383   251.3453    -0.24   0.813    -551.9816     433.274
cash_etr_p~t |   20.19617   24.67135     0.82   0.413    -28.15879    68.55114
             |
        year |
       2015  |  -22.03443   17.75285    -1.24   0.215    -56.82937    12.76051
       2016  |  -9.646955   16.90744    -0.57   0.568    -42.78492    23.49101
       2017  |  -26.93748   17.77642    -1.52   0.130    -61.77863    7.903667
       2018  |  -9.914302   66.03862    -0.15   0.881    -139.3476     119.519
       2019  |   11.30254   69.73477     0.16   0.871    -125.3751    147.9802
       2022  |    10.6029   68.80648     0.15   0.878    -124.2553    145.4611
       2023  |   8.109575   69.71075     0.12   0.907     -128.521    144.7401
             |
       ff_48 |
          2  |   133.2625   33.61479     3.96   0.000      67.3787    199.1462
          3  |   117.7515   45.76097     2.57   0.010     28.06161    207.4413
          4  |   148.6519    37.3897     3.98   0.000     75.36941    221.9343
          5  |    176.196   58.77612     3.00   0.003     60.99693    291.3951
          6  |    141.488   35.39998     4.00   0.000     72.10531    210.8707
          7  |   199.2993   34.47286     5.78   0.000     131.7338    266.8649
          8  |    191.752   53.07221     3.61   0.000     87.73235    295.7716
          9  |   169.6683   39.67009     4.28   0.000      91.9163    247.4202
         10  |   156.3434   39.15256     3.99   0.000     79.60583     233.081
         12  |   159.2717   34.27376     4.65   0.000     92.09636     226.447
         14  |   159.0245   35.59405     4.47   0.000     89.26145    228.7876
         15  |   128.2544   39.80497     3.22   0.001     50.23807    206.2707
         16  |   150.9121   69.01695     2.19   0.029     15.64137    286.1828
         17  |   202.9826   58.16554     3.49   0.000     88.98023     316.985
         18  |   154.8661   31.44753     4.92   0.000     93.23007    216.5021
         19  |   111.3357   40.88898     2.72   0.006     31.19481    191.4767
         20  |   128.9431   41.80832     3.08   0.002      47.0003    210.8859
         22  |   162.3732   34.18177     4.75   0.000     95.37817    229.3683
         24  |    146.724     40.341     3.64   0.000     67.65704    225.7909
         25  |   174.6098   34.22545     5.10   0.000     107.5291    241.6904
         26  |   159.5728   38.69073     4.12   0.000     83.74033    235.4052
         27  |   279.9647   100.4149     2.79   0.005     83.15515    476.7742
         28  |   239.9741   69.54225     3.45   0.001     103.6738    376.2744
         29  |   259.6584   55.96422     4.64   0.000     149.9705    369.3462
         32  |   170.1922   32.96125     5.16   0.000     105.5894    234.7951
         33  |   198.5622   39.28589     5.05   0.000     121.5632    275.5611
         35  |   194.4388   41.56253     4.68   0.000     112.9777    275.8999
         40  |   140.6356    35.0844     4.01   0.000     71.87147    209.3998
         49  |   112.9439    35.8843     3.15   0.002     42.61199    183.2759
             |
sp_rating_~m |
          0  |  -180.6541   49.67259    -3.64   0.000    -278.0106   -83.29762
          1  |    74.1484   66.18843     1.12   0.263    -55.57854    203.8753
          2  |          0  (empty)
          5  |  -51.64967   66.46126    -0.78   0.437    -181.9113    78.61201
          6  |  -98.82793   121.8065    -0.81   0.417    -337.5643    139.9084
          7  |  -138.0639   61.14373    -2.26   0.024    -257.9034   -18.22437
          8  |  -127.9674   51.58484    -2.48   0.013    -229.0718   -26.86294
          9  |  -177.4065   53.78202    -3.30   0.001    -282.8173   -71.99568
         10  |    -194.27   54.40723    -3.57   0.000    -300.9062   -87.63377
         11  |   -196.775    52.6379    -3.74   0.000    -299.9434   -93.60662
         12  |  -215.1714   50.30504    -4.28   0.000    -313.7675   -116.5754
         13  |  -188.3604   49.61242    -3.80   0.000     -285.599   -91.12187
         14  |  -175.3281   49.81258    -3.52   0.000     -272.959   -77.69724
         15  |  -177.9216   49.59282    -3.59   0.000    -275.1217   -80.72146
         16  |  -179.5377   51.88473    -3.46   0.001    -281.2299   -77.84549
         17  |  -2.694813   112.8075    -0.02   0.981    -223.7935    218.4039
         18  |  -129.0258   47.70688    -2.70   0.007    -222.5296   -35.52204
         19  |          0  (omitted)
             |
       _cons |   247.8232    94.4932     2.62   0.009     62.61989    433.0264
-------------+----------------------------------------------------------------
m2_lnvar     |
       _cons |   9.562426   .0841594   113.62   0.000     9.397477    9.727376
------------------------------------------------------------------------------

. test [m1_mean]excess_interest_scaled = [m2_mean]excess_interest_scaled

 ( 1)  [m1_mean]excess_interest_scaled - [m2_mean]excess_interest_scaled = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2411

. test [m1_mean]excess_interest_scaled_post = [m2_mean]excess_interest_scaled_p
> ost

 ( 1)  [m1_mean]excess_interest_scaled_post -
       [m2_mean]excess_interest_scaled_post = 0

           chi2(  1) =    2.18
         Prob > chi2 =    0.1398

. 
. * save the results (esttab) using tabdir
. esttab m1 m2 using "$tabdir/margin_did_both_rule_competition_cts.tex", replac
> e ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant keep( exces
> s_interest_scaled excess_interest_scaled_post)
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_did_both_rule_competition_cts.tex)

. est clear 

. 
. ****************** Demand Side Elasticity ******************
. 
. *** Table 8: HP Financial Constraint (RFS 2015) and Linn Weagley 2024 Extensi
> on 
. 
. local controls "log_at market_to_book ppent_by_at debt_by_at cash_by_at divid
> end_payer ret_vol cash_etr"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dum
> my tranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. local controls_post "log_at_post market_to_book_post ppent_by_at_post debt_by
> _at_post cash_by_at_post dividend_payer_post ret_vol_post cash_etr_post"   

. 
. use "$cleandir/tranche_level_ds_compa_wlabel.dta", clear        

. fvset base 1 ff_48

. merge m:1 gvkey year using "$rawdir/LinnWeagley_Constraint_Data_2025_01.dta"
(variable year was long, now double to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                       263,078
        from master                       530  (_merge==1)
        from using                    262,548  (_merge==2)

    Matched                             2,946  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(263,078 observations deleted)

. 
. bysort ff_48: egen median_lw_debtcon_full = median(lw_debtcon_full)

. bysort ff_48: egen p33_lw_debtcon_full = pctile(lw_debtcon_full), p(33)

. bysort ff_48: egen p67_lw_debtcon_full = pctile(lw_debtcon_full), p(67)

. 
. gen high_debtcon = 1 if lw_debtcon_full >= p67_lw_debtcon_full
(1,980 missing values generated)

. replace high_debtcon = 0 if lw_debtcon_full <= p33_lw_debtcon_full
(956 real changes made)

. 
. reg margin_bps excess_interest_scaled excess_interest_scaled_post `controls' 
> `deal_controls' `controls_post' i.year i.ff_48 ib2.sp_rating_num if high_debt
> con == 0
note: 2b.sp_rating_num identifies no observations in the sample.
note: 19.sp_rating_num omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =       956
-------------+----------------------------------   F(87, 868)      =     19.15
       Model |  16714770.2        87  192123.795   Prob > F        =    0.0000
    Residual |  8709607.12       868  10034.1096   R-squared       =    0.6574
-------------+----------------------------------   Adj R-squared   =    0.6231
       Total |  25424377.3       955  26622.3846   Root MSE        =    100.17

------------------------------------------------------------------------------
  margin_bps | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   157.6897   18.45874     8.54   0.000     121.4607    193.9187
excess_int~t |   -125.156    29.4832    -4.24   0.000    -183.0227    -67.2893
      log_at |  -14.03907    3.89266    -3.61   0.000     -21.6792   -6.398947
market_to_~k |    5.58762   4.346853     1.29   0.199    -2.943952    14.11919
 ppent_by_at |  -27.69832   27.54514    -1.01   0.315    -81.76119    26.36454
  debt_by_at |   110.5498   27.98012     3.95   0.000     55.63324    165.4664
  cash_by_at |   34.05403   43.17979     0.79   0.431    -50.69498     118.803
dividend_p~r |   12.52046   11.40572     1.10   0.273    -9.865548    34.90648
     ret_vol |    212.842   132.6396     1.60   0.109    -47.48983    473.1737
    cash_etr |   46.30981   12.70383     3.65   0.000     21.37599    71.24362
   leveraged |   69.85864   10.79168     6.47   0.000      48.6778    91.03949
    maturity |   6.727346   2.758407     2.44   0.015     1.313418    12.14127
log_deal_a~d |  -13.67076   3.851475    -3.55   0.000    -21.23005   -6.111466
secured_du~y |   45.37024   9.782321     4.64   0.000     26.17047       64.57
tranche_ty~y |   57.93062   7.005571     8.27   0.000     44.18078    71.68046
tranche_o_~y |  -.6333735   8.777437    -0.07   0.942    -17.86086    16.59411
sponsor_du~y |   127.6181   13.13642     9.71   0.000     101.8353     153.401
 log_at_post |   6.106854   4.818751     1.27   0.205    -3.350913    15.56462
market_to_~t |  -11.11924   6.370092    -1.75   0.081    -23.62183    1.383344
ppent_by_~st |   30.82008   36.52903     0.84   0.399    -40.87547    102.5156
debt_by_at~t |  -68.07259   47.10155    -1.45   0.149    -160.5188    24.37366
cash_by_at~t |   45.16978   66.17764     0.68   0.495    -84.71713    175.0567
dividend_p~t |  -12.05231   18.48393    -0.65   0.515    -48.33074    24.22612
ret_vol_post |  -38.10537   217.4372    -0.18   0.861    -464.8694    388.6587
cash_etr_p~t |  -31.98354    33.7013    -0.95   0.343    -98.12912    34.16203
             |
        year |
       2015  |   11.51323   11.65507     0.99   0.324    -11.36218    34.38864
       2016  |     16.366   13.75654     1.19   0.234    -10.63397    43.36596
       2017  |  -3.064245   14.34496    -0.21   0.831     -31.2191    25.09061
       2018  |  -14.25645   52.58915    -0.27   0.786    -117.4732    88.96032
       2019  |   .1141329   53.31266     0.00   0.998    -104.5227    104.7509
       2022  |   8.006258   54.64816     0.15   0.884    -99.25172    115.2642
       2023  |   14.81832   56.42113     0.26   0.793    -95.91947    125.5561
             |
       ff_48 |
          2  |    226.999   77.36439     2.93   0.003     75.15581    378.8421
          3  |   215.6076   85.78038     2.51   0.012      47.2464    383.9688
          4  |   221.9007   91.74272     2.42   0.016     41.83722    401.9642
          5  |   206.3334   106.0068     1.95   0.052    -1.726316     414.393
          6  |   192.4149    88.0785     2.18   0.029      19.5432    365.2867
          7  |   243.1746   78.17028     3.11   0.002     89.74971    396.5994
          8  |   210.6298   86.65294     2.43   0.015     40.55604    380.7036
          9  |   199.1516   76.88305     2.59   0.010     48.25322    350.0501
         10  |   241.6607   85.35204     2.83   0.005     74.14022    409.1813
         11  |   264.3398   77.14263     3.43   0.001     112.9319    415.7477
         12  |   253.7445   77.25151     3.28   0.001     102.1229    405.3661
         13  |   281.8122   78.22125     3.60   0.000     128.2873    435.3371
         14  |   222.2185   76.38403     2.91   0.004     72.29953    372.1375
         15  |    268.883   93.31711     2.88   0.004     85.72948    452.0366
         16  |   244.9088   86.19017     2.84   0.005     75.74325    414.0743
         17  |   347.0731   83.94574     4.13   0.000     182.3127    511.8334
         18  |   213.6438   78.26183     2.73   0.006     60.03929    367.2484
         19  |    202.689    87.9873     2.30   0.021     29.99621    375.3817
         21  |   226.7088   76.99254     2.94   0.003     75.59553    377.8222
         22  |   204.8517   81.29908     2.52   0.012     45.28594    364.4175
         23  |   223.5108   77.10622     2.90   0.004     72.17441    374.8473
         24  |    272.055   78.00911     3.49   0.001     118.9464    425.1635
         26  |   233.5529   132.0706     1.77   0.077    -25.66219    492.7681
         28  |   285.0357    127.706     2.23   0.026     34.38701    535.6845
         29  |   361.7799   87.71999     4.12   0.000     189.6118     533.948
         30  |   263.2921   77.21842     3.41   0.001     111.7355    414.8488
         32  |   233.8434   76.91597     3.04   0.002     82.88038    384.8065
         33  |   218.8655   80.01624     2.74   0.006     61.81756    375.9134
         34  |    213.093   75.11561     2.84   0.005     65.66357    360.5225
         35  |   284.8553   83.80032     3.40   0.001     120.3803    449.3302
         36  |   194.7042   75.81023     2.57   0.010     45.91141     343.497
         37  |   205.9008   76.71758     2.68   0.007     55.32715    356.4745
         38  |   247.5067   78.35493     3.16   0.002     93.71939     401.294
         39  |   195.9511    79.1083     2.48   0.013     40.68514     351.217
         40  |   177.5566   81.67753     2.17   0.030     17.24805    337.8652
         41  |   193.8971   77.22179     2.51   0.012     42.33385    345.4604
         42  |   210.5839   75.97617     2.77   0.006     61.46546    359.7024
         43  |   220.6789   76.53584     2.88   0.004     70.46198    370.8959
         44  |   231.7083   77.82311     2.98   0.003     78.96485    384.4518
         49  |   209.9916   126.3683     1.66   0.097    -38.03156    458.0148
             |
sp_rating_~m |
          0  |  -129.5031   46.00377    -2.82   0.005    -219.7947   -39.21149
          2  |          0  (empty)
          5  |  -145.5522   114.9233    -1.27   0.206    -371.1123     80.0079
          6  |    102.136   65.21144     1.57   0.118     -25.8545    230.1266
          7  |  -108.5629   61.86369    -1.75   0.080    -229.9829    12.85697
          8  |  -48.10646    53.2422    -0.90   0.366     -152.605    56.39205
          9  |  -154.8993   51.45421    -3.01   0.003    -255.8885   -53.91007
         10  |  -164.4971   49.17118    -3.35   0.001    -261.0054   -67.98878
         11  |  -119.0041   47.33452    -2.51   0.012    -211.9076    -26.1006
         12  |  -134.5048   48.65936    -2.76   0.006    -230.0086   -39.00107
         13  |  -120.4456   47.19282    -2.55   0.011    -213.0709   -27.82019
         14  |  -130.0197   47.24643    -2.75   0.006    -222.7503   -37.28912
         15  |   -91.2637   46.86622    -1.95   0.052    -183.2481    .7206724
         16  |  -113.8219   46.50824    -2.45   0.015    -205.1037   -22.54017
         17  |  -132.9828   60.61386    -2.19   0.029    -251.9497   -14.01591
         18  |  -106.3899   60.18192    -1.77   0.077     -224.509     11.7292
         19  |          0  (omitted)
             |
       _cons |   105.9962    97.1154     1.09   0.275     -84.6123    296.6047
------------------------------------------------------------------------------

. estimates store m1

. 
. reg margin_bps excess_interest_scaled excess_interest_scaled_post `controls' 
> `deal_controls' `controls_post' i.year i.ff_48 ib2.sp_rating_num if high_debt
> con == 1
note: 1b.ff_48 identifies no observations in the sample.
note: 44.ff_48 omitted because of collinearity.
note: 2b.sp_rating_num identifies no observations in the sample.
note: 17.sp_rating_num omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =       966
-------------+----------------------------------   F(86, 879)      =     11.43
       Model |  14899206.8        86   173246.59   Prob > F        =    0.0000
    Residual |  13320016.9       879  15153.6028   R-squared       =    0.5280
-------------+----------------------------------   Adj R-squared   =    0.4818
       Total |  28219223.7       965  29242.7188   Root MSE        =     123.1

------------------------------------------------------------------------------
  margin_bps | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |    68.4974   19.62388     3.49   0.001     29.98227    107.0125
excess_int~t |  -8.877126   29.92885    -0.30   0.767    -67.61748    49.86323
      log_at |   -.248643   5.387112    -0.05   0.963    -10.82175    10.32446
market_to_~k |  -24.58543    8.13985    -3.02   0.003    -40.56124   -8.609618
 ppent_by_at |   37.88722   30.97392     1.22   0.222    -22.90426    98.67869
  debt_by_at |    22.1688   32.63837     0.68   0.497    -41.88943    86.22703
  cash_by_at |   -61.8206   65.51566    -0.94   0.346     -190.406    66.76478
dividend_p~r |   4.329456    12.9129     0.34   0.737    -21.01426    29.67318
     ret_vol |   283.9006   128.9816     2.20   0.028     30.75273    537.0486
    cash_etr |   39.09991   16.60854     2.35   0.019     6.502888    71.69692
   leveraged |    67.9315   13.40399     5.07   0.000     41.62395    94.23905
    maturity |   2.670182   3.469331     0.77   0.442    -4.138958    9.479321
log_deal_a~d |  -6.669738    4.98781    -1.34   0.182    -16.45915    3.119669
secured_du~y |   56.47671   10.69404     5.28   0.000     35.48787    77.46555
tranche_ty~y |   95.48568   8.581094    11.13   0.000     78.64385    112.3275
tranche_o_~y |   33.01809   9.719118     3.40   0.001     13.94271    52.09348
sponsor_du~y |   73.86617   13.41151     5.51   0.000     47.54385    100.1885
 log_at_post |  -21.69457   7.717043    -2.81   0.005    -36.84055   -6.548593
market_to_~t |   4.250955   12.17987     0.35   0.727    -19.65406    28.15597
ppent_by_~st |  -15.61839   40.56478    -0.39   0.700    -95.23353    63.99675
debt_by_at~t |   81.51114   48.11714     1.69   0.091    -12.92675     175.949
cash_by_at~t |   76.92805   117.0488     0.66   0.511    -152.7997    306.6558
dividend_p~t |  -8.326506   19.62595    -0.42   0.671    -46.84569    30.19268
ret_vol_post |  -185.2605   225.2373    -0.82   0.411    -627.3262    256.8051
cash_etr_p~t |  -39.92509   31.57167    -1.26   0.206    -101.8897    22.03957
             |
        year |
       2015  |  -32.81274   14.56543    -2.25   0.025    -61.39983   -4.225648
       2016  |   16.27843   16.84813     0.97   0.334    -16.78883     49.3457
       2017  |  -20.74216   16.91173    -1.23   0.220    -53.93425    12.44992
       2018  |   134.3124   73.75636     1.82   0.069    -10.44676    279.0715
       2019  |   137.4099   74.63953     1.84   0.066    -9.082564    283.9024
       2022  |   154.2085   76.48528     2.02   0.044     4.093425    304.3236
       2023  |   161.9007   79.03278     2.05   0.041     6.785745    317.0157
             |
       ff_48 |
          1  |          0  (empty)
          2  |  -55.24327    37.8745    -1.46   0.145    -129.5783    19.09174
          3  |  -65.72056   55.74858    -1.18   0.239    -175.1364     43.6953
          4  |  -15.03308   81.45112    -0.18   0.854    -174.8945    144.8283
          5  |   104.2934   56.48594     1.85   0.065    -6.569672    215.1565
          6  |  -53.84891   59.45434    -0.91   0.365    -170.5379    62.84012
          7  |   101.7048   37.93988     2.68   0.007     27.24151    176.1682
          8  |   111.8021   53.94763     2.07   0.039     5.920944    217.6833
          9  |   10.69172    36.0314     0.30   0.767    -60.02591    81.40935
         10  |   4.171759   50.39054     0.08   0.934    -94.72807    103.0716
         11  |   15.64973   33.73456     0.46   0.643    -50.55997    81.85943
         12  |  -2.652413   36.79281    -0.07   0.943    -74.86443     69.5596
         13  |   17.34949   35.95791     0.48   0.630    -53.22389    87.92288
         14  |  -2.350683   32.58957    -0.07   0.943    -66.31314    61.61177
         15  |  -25.73556   69.97013    -0.37   0.713    -163.0636    111.5925
         16  |  -82.21918   94.47205    -0.87   0.384    -267.6363    103.1979
         17  |   -16.0862   58.56883    -0.27   0.784    -131.0373    98.86487
         18  |   14.35717   40.79551     0.35   0.725    -65.71081    94.42515
         19  |  -45.63481   56.39108    -0.81   0.419    -156.3117    65.04206
         20  |  -32.25679   80.20953    -0.40   0.688    -189.6813    125.1678
         21  |   43.06406   34.00803     1.27   0.206    -23.68235    109.8105
         22  |  -4.148604    49.6195    -0.08   0.933    -101.5351    93.23793
         23  |   19.60244   34.90557     0.56   0.575    -48.90556    88.11044
         24  |  -22.72698   37.88246    -0.60   0.549    -97.07762    51.62366
         25  |    58.8206    131.237     0.45   0.654    -198.7538     316.395
         28  |   182.3827   77.00789     2.37   0.018     31.24186    333.5235
         29  |   106.4879   53.98599     1.97   0.049     .5314387    212.4444
         30  |   17.57567   31.43643     0.56   0.576    -44.12355    79.27489
         32  |   3.076665   32.22189     0.10   0.924    -60.16416    66.31749
         33  |   26.24661   43.23497     0.61   0.544    -58.60921    111.1024
         34  |   -28.3014   29.99986    -0.94   0.346    -87.18111    30.57831
         35  |   -37.9651   52.56088    -0.72   0.470    -141.1246    65.19437
         36  |    24.1234    31.7526     0.76   0.448    -38.19636    86.44316
         37  |   20.73469   32.77104     0.63   0.527    -43.58392    85.05331
         38  |   23.46538   39.44735     0.59   0.552    -53.95661    100.8874
         39  |  -20.69087   36.69529    -0.56   0.573    -92.71149    51.32975
         40  |  -6.840674   53.27165    -0.13   0.898    -111.3952    97.71382
         41  |  -4.691579   32.63594    -0.14   0.886    -68.74504    59.36188
         42  |   4.158743   32.11285     0.13   0.897    -58.86807    67.18555
         43  |   18.41012   31.05811     0.59   0.553    -42.54659    79.36684
         44  |          0  (omitted)
             |
sp_rating_~m |
          0  |   125.7088   127.0547     0.99   0.323    -123.6573    375.0749
          1  |   392.3985   150.7837     2.60   0.009     96.46038    688.3367
          2  |          0  (empty)
          4  |   284.7139   140.1602     2.03   0.043     9.626124    559.8017
          5  |   325.4402   147.4897     2.21   0.028     35.96717    614.9132
          6  |   181.6181    148.012     1.23   0.220      -108.88    472.1163
          7  |   212.9425   129.9857     1.64   0.102    -42.17617    468.0611
          8  |   130.2973   128.5728     1.01   0.311    -122.0482    382.6428
          9  |   123.7855   128.4998     0.96   0.336    -128.4168    375.9878
         10  |   102.0949   128.2723     0.80   0.426    -149.6609    353.8506
         11  |   74.35624    127.898     0.58   0.561    -176.6648    325.3773
         12  |    81.9995   128.2936     0.64   0.523    -169.7981    333.7971
         13  |   95.40525   130.0985     0.73   0.464    -159.9347    350.7452
         14  |   121.8125    128.045     0.95   0.342    -129.4972    373.1222
         15  |    126.163   137.3245     0.92   0.358    -143.3592    395.6852
         16  |   94.65651   128.6181     0.74   0.462    -157.7779     347.091
         17  |          0  (omitted)
             |
       _cons |  -6.874316   141.2709    -0.05   0.961    -284.1421    270.3934
------------------------------------------------------------------------------

. estimates store m2

. 
. suest m1 m2, vce(cluster gvkey)

Simultaneous results for m1, m2                          Number of obs = 1,922

                                (Std. err. adjusted for 790 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
             | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
m1_mean      |
excess_int~d |   157.6897    36.6087     4.31   0.000     85.93796    229.4414
excess_int~t |   -125.156   45.35288    -2.76   0.006     -214.046   -36.26597
      log_at |  -14.03907   5.650665    -2.48   0.013    -25.11417   -2.963973
market_to_~k |    5.58762    5.88195     0.95   0.342    -5.940789    17.11603
 ppent_by_at |  -27.69832   35.74747    -0.77   0.438    -97.76208    42.36544
  debt_by_at |   110.5498   43.30034     2.55   0.011     25.68274    195.4169
  cash_by_at |   34.05403   62.50757     0.54   0.586    -88.45857    156.5666
dividend_p~r |   12.52046   12.55635     1.00   0.319    -12.08953    37.13046
     ret_vol |    212.842   208.2464     1.02   0.307    -195.3134    620.9973
    cash_etr |   46.30981    17.0617     2.71   0.007     12.86949    79.75012
   leveraged |   69.85864   16.93326     4.13   0.000     36.67006    103.0472
    maturity |   6.727346   3.624477     1.86   0.063    -.3764985    13.83119
log_deal_a~d |  -13.67076   4.041664    -3.38   0.001    -21.59228   -5.749243
secured_du~y |   45.37024   12.19703     3.72   0.000      21.4645    69.27597
tranche_ty~y |   57.93062   6.923513     8.37   0.000     44.36078    71.50046
tranche_o_~y |  -.6333735   8.641726    -0.07   0.942    -17.57085     16.3041
sponsor_du~y |   127.6181   16.17893     7.89   0.000     95.90801    159.3282
 log_at_post |   6.106854      6.112     1.00   0.318    -5.872446    18.08615
market_to_~t |  -11.11924   6.996115    -1.59   0.112    -24.83137    2.592893
ppent_by_~st |   30.82008   33.50232     0.92   0.358    -34.84326    96.48342
debt_by_at~t |  -68.07259   48.40152    -1.41   0.160    -162.9378    26.79263
cash_by_at~t |   45.16978   77.60528     0.58   0.561    -106.9338    197.2733
dividend_p~t |  -12.05231   17.55506    -0.69   0.492    -46.45961    22.35498
ret_vol_post |  -38.10537   251.7415    -0.15   0.880    -531.5095    455.2988
cash_etr_p~t |  -31.98354   30.59887    -1.05   0.296    -91.95623    27.98914
             |
        year |
       2015  |   11.51323    14.4058     0.80   0.424    -16.72161    39.74808
       2016  |     16.366    17.1891     0.95   0.341    -17.32402    50.05601
       2017  |  -3.064245   16.44158    -0.19   0.852    -35.28915    29.16066
       2018  |  -14.25645   67.18083    -0.21   0.832    -145.9285    117.4156
       2019  |   .1141329   68.38046     0.00   0.999    -133.9091    134.1374
       2022  |   8.006258   66.67971     0.12   0.904    -122.6836    138.6961
       2023  |   14.81832   72.71462     0.20   0.839    -127.6997    157.3364
             |
       ff_48 |
          2  |    226.999    29.7619     7.63   0.000     168.6667    285.3312
          3  |   215.6076   29.71065     7.26   0.000     157.3758    273.8394
          4  |   221.9007   43.25564     5.13   0.000     137.1212    306.6802
          5  |   206.3334    36.6975     5.62   0.000     134.4076    278.2591
          6  |   192.4149   40.11155     4.80   0.000     113.7977    271.0321
          7  |   243.1746   42.70741     5.69   0.000     159.4696    326.8796
          8  |   210.6298   37.16044     5.67   0.000     137.7967     283.463
          9  |   199.1516   30.54443     6.52   0.000     139.2857    259.0176
         10  |   241.6607   32.68465     7.39   0.000        177.6    305.7215
         11  |   264.3398   38.69456     6.83   0.000     188.4998    340.1797
         12  |   253.7445   32.32835     7.85   0.000     190.3821     317.107
         13  |   281.8122   39.53494     7.13   0.000     204.3251    359.2993
         14  |   222.2185   30.30358     7.33   0.000     162.8246    281.6124
         15  |    268.883    41.6008     6.46   0.000      187.347    350.4191
         16  |   244.9088   123.6106     1.98   0.048     2.636401    487.1811
         17  |   347.0731   111.5543     3.11   0.002     128.4307    565.7154
         18  |   213.6438   30.78516     6.94   0.000      153.306    273.9816
         19  |    202.689   32.69097     6.20   0.000     138.6158    266.7621
         21  |   226.7088   35.85936     6.32   0.000     156.4258    296.9919
         22  |   204.8517   33.55342     6.11   0.000     139.0882    270.6152
         23  |   223.5108   30.26411     7.39   0.000     164.1943    282.8274
         24  |    272.055   35.41405     7.68   0.000     202.6447    341.4652
         26  |   233.5529   30.98515     7.54   0.000     172.8232    294.2827
         28  |   285.0357   34.78369     8.19   0.000      216.861    353.2105
         29  |   361.7799   71.06034     5.09   0.000     222.5042    501.0556
         30  |   263.2921   38.02686     6.92   0.000     188.7609    337.8234
         32  |   233.8434   34.20941     6.84   0.000     166.7942    300.8926
         33  |   218.8655   35.18453     6.22   0.000     149.9051    287.8259
         34  |    213.093   27.65536     7.71   0.000     158.8895    267.2965
         35  |   284.8553   59.77406     4.77   0.000     167.7003    402.0103
         36  |   194.7042   29.62779     6.57   0.000     136.6348    252.7736
         37  |   205.9008   27.40406     7.51   0.000     152.1898    259.6118
         38  |   247.5067   33.43179     7.40   0.000     181.9816    313.0318
         39  |   195.9511   37.13032     5.28   0.000      123.177    268.7252
         40  |   177.5566   33.68236     5.27   0.000     111.5404    243.5728
         41  |   193.8971   32.95155     5.88   0.000     129.3133     258.481
         42  |   210.5839   30.59211     6.88   0.000     150.6245    270.5434
         43  |   220.6789   29.55545     7.47   0.000     162.7513    278.6065
         44  |   231.7083   47.68335     4.86   0.000     138.2507     325.166
         49  |   209.9916   35.51633     5.91   0.000     140.3809    279.6023
             |
sp_rating_~m |
          0  |  -129.5031   42.67587    -3.03   0.002    -213.1463   -45.85994
          2  |          0  (empty)
          5  |  -145.5522   50.96192    -2.86   0.004    -245.4357   -45.66865
          6  |    102.136   77.07631     1.33   0.185    -48.93074    253.2028
          7  |  -108.5629   81.81542    -1.33   0.185    -268.9182    51.79233
          8  |  -48.10646   54.28657    -0.89   0.376    -154.5062    58.29327
          9  |  -154.8993   53.11038    -2.92   0.004    -258.9937   -50.80485
         10  |  -164.4971   48.23587    -3.41   0.001    -259.0377   -69.95653
         11  |  -119.0041   43.48764    -2.74   0.006    -204.2383   -33.76988
         12  |  -134.5048   42.89043    -3.14   0.002    -218.5685   -50.44113
         13  |  -120.4456   42.91488    -2.81   0.005    -204.5572   -36.33394
         14  |  -130.0197   42.64972    -3.05   0.002    -213.6116    -46.4278
         15  |   -91.2637   43.59936    -2.09   0.036    -176.7169   -5.810515
         16  |  -113.8219   42.01641    -2.71   0.007    -196.1726   -31.47129
         17  |  -132.9828   45.73589    -2.91   0.004    -222.6235   -43.34209
         18  |  -106.3899   42.22962    -2.52   0.012    -189.1584   -23.62137
         19  |          0  (omitted)
             |
       _cons |   105.9962   92.24373     1.15   0.251    -74.79822    286.7906
-------------+----------------------------------------------------------------
m1_lnvar     |
       _cons |   9.213746    .102012    90.32   0.000     9.013806    9.413685
-------------+----------------------------------------------------------------
m2_mean      |
excess_int~d |    68.4974   26.49154     2.59   0.010     16.57492    120.4199
excess_int~t |  -8.877126   39.36131    -0.23   0.822    -86.02388    68.26963
      log_at |   -.248643   8.958959    -0.03   0.978    -17.80788    17.31059
market_to_~k |  -24.58543   7.711909    -3.19   0.001    -39.70049   -9.470364
 ppent_by_at |   37.88722   36.75256     1.03   0.303    -34.14648    109.9209
  debt_by_at |    22.1688   38.30434     0.58   0.563    -52.90633    97.24392
  cash_by_at |   -61.8206   66.24214    -0.93   0.351    -191.6528    68.01161
dividend_p~r |   4.329456   15.60842     0.28   0.781    -26.26248    34.92139
     ret_vol |   283.9006   174.4705     1.63   0.104    -58.05518    625.8565
    cash_etr |   39.09991   21.55502     1.81   0.070     -3.14716    81.34697
   leveraged |    67.9315   13.11673     5.18   0.000     42.22319    93.63981
    maturity |   2.670182   4.225254     0.63   0.527    -5.611164    10.95153
log_deal_a~d |  -6.669738   6.895154    -0.97   0.333    -20.18399    6.844515
secured_du~y |   56.47671    11.1973     5.04   0.000      34.5304    78.42303
tranche_ty~y |   95.48568   9.022334    10.58   0.000     77.80222    113.1691
tranche_o_~y |   33.01809   9.943122     3.32   0.001     13.52993    52.50625
sponsor_du~y |   73.86617   18.79098     3.93   0.000     37.03652    110.6958
 log_at_post |  -21.69457   8.447425    -2.57   0.010    -38.25122   -5.137926
market_to_~t |   4.250955   10.41447     0.41   0.683    -16.16103    24.66294
ppent_by_~st |  -15.61839   46.61598    -0.34   0.738     -106.984    75.74725
debt_by_at~t |   81.51114   53.47903     1.52   0.127    -23.30582    186.3281
cash_by_at~t |   76.92805   106.5627     0.72   0.470    -131.9309     285.787
dividend_p~t |  -8.326506    18.7362    -0.44   0.657    -45.04879    28.39578
ret_vol_post |  -185.2605   259.2364    -0.71   0.475    -693.3545    322.8335
cash_etr_p~t |  -39.92509   38.82793    -1.03   0.304    -116.0264    36.17625
             |
        year |
       2015  |  -32.81274   15.91835    -2.06   0.039    -64.01212   -1.613354
       2016  |   16.27843   22.63543     0.72   0.472     -28.0862    60.64307
       2017  |  -20.74216   21.01546    -0.99   0.324    -61.93171    20.44738
       2018  |   134.3124   85.89131     1.56   0.118    -34.03148    302.6562
       2019  |   137.4099   86.06502     1.60   0.110    -31.27441    306.0943
       2022  |   154.2085   88.16302     1.75   0.080    -18.58783    327.0049
       2023  |   161.9007   96.61857     1.68   0.094    -27.46819    351.2696
             |
       ff_48 |
          2  |  -55.24327   38.91468    -1.42   0.156    -131.5146     21.0281
          3  |  -65.72056   67.95252    -0.97   0.333     -198.905    67.46392
          4  |  -15.03308   40.38932    -0.37   0.710     -94.1947    64.12854
          5  |   104.2934   80.82462     1.29   0.197    -54.11995    262.7067
          6  |  -53.84891   47.48852    -1.13   0.257    -146.9247    39.22688
          7  |   101.7048   54.64075     1.86   0.063    -5.389056    208.7987
          8  |   111.8021   99.07363     1.13   0.259    -82.37861    305.9829
          9  |   10.69172   47.64845     0.22   0.822    -82.69752     104.081
         10  |   4.171759   42.34915     0.10   0.922    -78.83104    87.17456
         11  |   15.64973   45.77467     0.34   0.732    -74.06698    105.3664
         12  |  -2.652413   44.99325    -0.06   0.953    -90.83757    85.53275
         13  |   17.34949   42.59304     0.41   0.684    -66.13134    100.8303
         14  |  -2.350683    41.3071    -0.06   0.955    -83.31112    78.60975
         15  |  -25.73556   42.36637    -0.61   0.544    -108.7721      57.301
         16  |  -82.21918   43.71231    -1.88   0.060    -167.8937    3.455361
         17  |   -16.0862   40.20027    -0.40   0.689    -94.87728    62.70487
         18  |   14.35717    44.7342     0.32   0.748    -73.32025    102.0346
         19  |  -45.63481   53.84688    -0.85   0.397    -151.1728    59.90314
         20  |  -32.25679   47.56073    -0.68   0.498    -125.4741    60.96053
         21  |   43.06406   44.68937     0.96   0.335     -44.5255    130.6536
         22  |  -4.148604    41.0261    -0.10   0.919    -84.55829    76.26108
         23  |   19.60244   48.18932     0.41   0.684     -74.8469    114.0518
         24  |  -22.72698   41.72943    -0.54   0.586    -104.5152     59.0612
         25  |    58.8206    47.7499     1.23   0.218    -34.76749    152.4087
         28  |   182.3827   64.51788     2.83   0.005     55.92996    308.8354
         29  |   106.4879   65.29939     1.63   0.103    -21.49653    234.4724
         30  |   17.57567   44.57529     0.39   0.693    -69.79029    104.9416
         32  |   3.076665   46.61357     0.07   0.947    -88.28425    94.43758
         33  |   26.24661   62.15694     0.42   0.673    -95.57876     148.072
         34  |   -28.3014   39.42493    -0.72   0.473    -105.5728    48.97005
         35  |   -37.9651   43.19377    -0.88   0.379    -122.6233    46.69314
         36  |    24.1234   41.50095     0.58   0.561    -57.21696    105.4638
         37  |   20.73469   42.45783     0.49   0.625    -62.48113    103.9505
         38  |   23.46538   45.39417     0.52   0.605    -65.50555    112.4363
         39  |  -20.69087   41.86318    -0.49   0.621    -102.7412    61.35946
         40  |  -6.840674   39.50945    -0.17   0.863    -84.27776    70.59642
         41  |  -4.691579   44.55976    -0.11   0.916     -92.0271    82.64394
         42  |   4.158743   40.87551     0.10   0.919    -75.95579    84.27328
         43  |   18.41012   41.18849     0.45   0.655    -62.31784    99.13809
         44  |          0  (omitted)
             |
sp_rating_~m |
          0  |   125.7088   31.64525     3.97   0.000     63.68524    187.7324
          1  |   392.3985   47.98675     8.18   0.000     298.3462    486.4508
          2  |          0  (empty)
          4  |   284.7139    67.5908     4.21   0.000     152.2384    417.1895
          5  |   325.4402    107.736     3.02   0.003     114.2816    536.5988
          6  |   181.6181   110.7056     1.64   0.101    -35.36081    398.5971
          7  |   212.9425   48.93185     4.35   0.000     117.0378    308.8471
          8  |   130.2973   36.59905     3.56   0.000     58.56448    202.0301
          9  |   123.7855   34.87413     3.55   0.000     55.43345    192.1375
         10  |   102.0949    35.6521     2.86   0.004     32.21802    171.9717
         11  |   74.35624   33.34897     2.23   0.026      8.99346     139.719
         12  |    81.9995   32.32113     2.54   0.011     18.65125    145.3477
         13  |   95.40525   35.51099     2.69   0.007     25.80499    165.0055
         14  |   121.8125   31.92642     3.82   0.000     59.23786    184.3871
         15  |    126.163   35.16703     3.59   0.000     57.23687    195.0891
         16  |   94.65651    28.3276     3.34   0.001     39.13543    150.1776
         17  |          0  (omitted)
             |
       _cons |  -6.874316   84.68906    -0.08   0.935    -172.8618    159.1132
-------------+----------------------------------------------------------------
m2_lnvar     |
       _cons |   9.625994   .0713322   134.95   0.000     9.486185    9.765802
------------------------------------------------------------------------------

. test [m1_mean]excess_interest_scaled_post = [m2_mean]excess_interest_scaled_p
> ost

 ( 1)  [m1_mean]excess_interest_scaled_post -
       [m2_mean]excess_interest_scaled_post = 0

           chi2(  1) =    3.63
         Prob > chi2 =    0.0566

.         
. * save the results (esttab) using tabdir
. esttab m1 m2 using "$tabdir/hp_finconstr_cross.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant keep( exces
> s_interest_scaled excess_interest_scaled_post)
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/hp_finconstr_cross.tex)

. 
. /***********
>         Alternative Mechanism Tests
>         ***********/
. 
. *** Approach 1: Interaction Terms (Full Sample)
. display "=========================================="
==========================================

. display "APPROACH 1: INTERACTION TERMS"
APPROACH 1: INTERACTION TERMS

. display "=========================================="
==========================================

. 
. * Competition - Interaction approach
. use "$cleandir/tranche_level_ds_compa_wlabel_withcomp.dta", clear

. 
. local controls "log_at market_to_book ppent_by_at debt_by_at cash_by_at divid
> end_payer ret_vol cash_etr"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dum
> my tranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. local controls_post "log_at_post market_to_book_post ppent_by_at_post debt_by
> _at_post cash_by_at_post dividend_payer_post ret_vol_post cash_etr_post"

. 
. fvset base 1 ff_48

. 
. * Create interaction terms
. cap drop post_X_highcomp

. gen post_X_highcomp = post * high_competition_industry
(1,034 missing values generated)

. gen excess_X_highcomp = excess_interest_scaled * high_competition_industry
(1,034 missing values generated)

. gen excess_post_X_highcomp = excess_interest_scaled_post * high_competition_i
> ndustry
(1,034 missing values generated)

. 
. reghdfe margin_bps excess_interest_scaled excess_interest_scaled_post excess_
> X_highcomp excess_post_X_highcomp high_competition_industry post_X_highcomp `
> controls' `deal_controls' `controls_post', absorb(year ff_48 sp_rating_num) v
> ce(cluster gvkey)
(MWFE estimator converged in 8 iterations)
note: high_competition_industry is probably collinear with the fixed effects (a
> ll partialled-out values are close to zero; tol = 1.0e-09)

HDFE Linear regression                            Number of obs   =      2,442
Absorbing 3 HDFE groups                           F(  28,    849) =      36.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5599
                                                  Adj R-squared   =     0.5434
                                                  Within R-sq.    =     0.4216
Number of clusters (gvkey)   =        850         Root MSE        =   117.9808

                                (Std. err. adjusted for 850 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |    61.7267    22.0171     2.80   0.005     18.51236     104.941
excess_int~t |  -11.24531   30.71145    -0.37   0.714    -71.52459    49.03396
excess_X_h~p |   44.65635   31.96804     1.40   0.163    -18.08932     107.402
excess_pos~p |  -110.6394   42.71706    -2.59   0.010    -194.4828   -26.79601
high_compe~y |          0  (omitted)
post_X_hig~p |   7.601184   12.06402     0.63   0.529    -16.07762    31.27999
      log_at |  -3.851473   4.460118    -0.86   0.388    -12.60562    4.902679
market_to_~k |  -1.211318    6.88512    -0.18   0.860    -14.72517    12.30253
 ppent_by_at |  -8.216656   27.89459    -0.29   0.768     -62.9671    46.53379
  debt_by_at |   32.16801   29.76957     1.08   0.280    -26.26257    90.59858
  cash_by_at |  -16.52504    43.4469    -0.38   0.704     -101.801    68.75089
dividend_p~r |   13.62093    10.4983     1.30   0.195    -6.984734    34.22659
     ret_vol |   261.7493   134.1879     1.95   0.051    -1.629732    525.1282
    cash_etr |   19.57868   10.51011     1.86   0.063    -1.050166    40.20753
   leveraged |   89.20353   9.334535     9.56   0.000     70.88206     107.525
    maturity |   7.323397   3.300044     2.22   0.027     .8461963     13.8006
log_deal_a~d |   -16.5201   3.677036    -4.49   0.000    -23.73724   -9.302951
secured_du~y |   54.40522   8.524401     6.38   0.000     37.67385    71.13659
tranche_ty~y |   68.33483   4.943717    13.82   0.000     58.63149    78.03817
tranche_o_~y |   19.76782   7.026203     2.81   0.005     5.977056    33.55858
sponsor_du~y |   114.1908    11.5505     9.89   0.000     91.51987    136.8616
 log_at_post |  -.3203432   4.101858    -0.08   0.938    -8.371315    7.730629
market_to_~t |  -6.027648   7.906738    -0.76   0.446    -21.54669    9.491397
ppent_by_~st |   13.51114   31.05501     0.44   0.664    -47.44244    74.46473
debt_by_at~t |   40.20941   34.87942     1.15   0.249    -28.25059    108.6694
cash_by_at~t |   34.68617   60.47026     0.57   0.566    -84.00257    153.3749
dividend_p~t |  -10.83223   13.01263    -0.83   0.405    -36.37293    14.70847
ret_vol_post |   112.6757   186.2239     0.61   0.545    -252.8375     478.189
cash_etr_p~t |  -12.99844    20.4325    -0.64   0.525    -53.10258     27.1057
       _cons |   147.3592   38.94496     3.78   0.000     70.91954    223.7989
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        36           1          35     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store comp_interaction

. 
. display "Competition Interaction Test - coefficient on excess_post_X_highcomp
> :"
Competition Interaction Test - coefficient on excess_post_X_highcomp:

. test excess_post_X_highcomp = 0

 ( 1)  excess_post_X_highcomp = 0

       F(  1,   849) =    6.71
            Prob > F =    0.0098

. 
. * Label interaction variables
. label var excess_X_highcomp "Excess Interest (Scaled) x High Competition"

. label var excess_post_X_highcomp "Excess Interest (Scaled) x Post x High Comp
> etition"

. label var post_X_highcomp "Post x High Competition"

. 
. * Save competition interaction table
. esttab comp_interaction using "$tabdir/competition_interaction.tex", replace 
> ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant ///
> order(excess_interest_scaled excess_interest_scaled_post excess_post_X_highco
> mp excess_X_highcomp post_X_highcomp) ///
> keep(excess_interest_scaled excess_interest_scaled_post excess_post_X_highcom
> p excess_X_highcomp post_X_highcomp)
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/competition_interaction.tex)

. est clear

. 
. * Financial Constraint - Interaction approach
. use "$cleandir/tranche_level_ds_compa_wlabel.dta", clear

. fvset base 1 ff_48

. merge m:1 gvkey year using "$rawdir/LinnWeagley_Constraint_Data_2025_01.dta"
(variable year was long, now double to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                       263,078
        from master                       530  (_merge==1)
        from using                    262,548  (_merge==2)

    Matched                             2,946  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(263,078 observations deleted)

. 
. bysort ff_48: egen median_lw_debtcon_full = median(lw_debtcon_full)

. bysort ff_48: egen p33_lw_debtcon_full = pctile(lw_debtcon_full), p(33)

. bysort ff_48: egen p67_lw_debtcon_full = pctile(lw_debtcon_full), p(67)

. 
. * Low constraint = bottom tercile (low LW values)
. gen low_debtcon = 1 if lw_debtcon_full <= p33_lw_debtcon_full
(1,990 missing values generated)

. replace low_debtcon = 0 if lw_debtcon_full >= p67_lw_debtcon_full
(966 real changes made)

. 
. * Create interaction terms
. cap drop post_X_lowdebt

. gen post_X_lowdebt = post * low_debtcon
(1,024 missing values generated)

. gen excess_X_lowdebt = excess_interest_scaled * low_debtcon
(1,024 missing values generated)

. gen excess_post_X_lowdebt = excess_interest_scaled_post * low_debtcon
(1,024 missing values generated)

. 
. reghdfe margin_bps excess_interest_scaled excess_interest_scaled_post excess_
> X_lowdebt excess_post_X_lowdebt low_debtcon post_X_lowdebt `controls' `deal_c
> ontrols' `controls_post', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(dropped 3 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      1,919
Absorbing 3 HDFE groups                           F(  29,    787) =      28.64
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5660
                                                  Adj R-squared   =     0.5442
                                                  Within R-sq.    =     0.3979
Number of clusters (gvkey)   =        788         Root MSE        =   114.3232

                                (Std. err. adjusted for 788 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   70.75474   26.46441     2.67   0.008     18.80557    122.7039
excess_int~t |   1.277007   40.34817     0.03   0.975    -77.92576    80.47977
excess_X_l~t |   78.12369   38.44781     2.03   0.042     2.651301    153.5961
excess_pos~t |  -146.0465   53.46355    -2.73   0.006    -250.9945   -41.09846
 low_debtcon |  -.4834826   10.45742    -0.05   0.963    -21.01123    20.04426
post_X_low~t |   22.26609   15.87759     1.40   0.161    -8.901354    53.43354
      log_at |  -6.367646   5.281618    -1.21   0.228    -16.73537     4.00008
market_to_~k |  -2.116573    5.08181    -0.42   0.677    -12.09208    7.858934
 ppent_by_at |   22.40169   26.11804     0.86   0.391    -28.86757    73.67095
  debt_by_at |   60.96006   30.24636     2.02   0.044     1.586972    120.3331
  cash_by_at |  -5.442898    50.3616    -0.11   0.914    -104.3019    93.41605
dividend_p~r |   12.26559   11.01674     1.11   0.266    -9.360074    33.89125
     ret_vol |    298.751   138.0867     2.16   0.031     27.68911    569.8129
    cash_etr |   37.89283   14.48038     2.62   0.009     9.468086    66.31758
   leveraged |   74.72355   10.81853     6.91   0.000     53.48696    95.96013
    maturity |   7.008459   3.064276     2.29   0.022     .9933377    13.02358
log_deal_a~d |  -11.31552   4.266247    -2.65   0.008    -19.69009   -2.940951
secured_du~y |   54.86354   8.662102     6.33   0.000     37.85998    71.86709
tranche_ty~y |   77.33996    6.01544    12.86   0.000     65.53175    89.14816
tranche_o_~y |   17.40765   7.058732     2.47   0.014     3.551479    31.26382
sponsor_du~y |   92.87588   14.48022     6.41   0.000     64.45146    121.3003
 log_at_post |  -6.149027   5.043943    -1.22   0.223     -16.0502    3.752146
market_to_~t |  -7.267148   6.023867    -1.21   0.228     -19.0919      4.5576
ppent_by_~st |   5.451817   31.29482     0.17   0.862    -55.97937      66.883
debt_by_at~t |    26.4031   39.49157     0.67   0.504    -51.11817    103.9244
cash_by_at~t |   63.89564   64.53528     0.99   0.322    -62.78602    190.5773
dividend_p~t |  -12.32891   13.53617    -0.91   0.363    -38.90017    14.24236
ret_vol_post |  -110.9042   194.5703    -0.57   0.569    -492.8424     271.034
cash_etr_p~t |  -34.31603   26.92452    -1.27   0.203    -87.16841    18.53635
       _cons |   151.7327   36.08352     4.21   0.000      80.9014     222.564
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         8           0           8     |
         ff_48 |        40           1          39     |
 sp_rating_num |        18           1          17    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store fincon_interaction

. 
. display "Financial Constraint Interaction Test - coefficient on excess_post_X
> _lowdebt:"
Financial Constraint Interaction Test - coefficient on excess_post_X_lowdebt:

. test excess_post_X_lowdebt = 0

 ( 1)  excess_post_X_lowdebt = 0

       F(  1,   787) =    7.46
            Prob > F =    0.0064

. 
. * Label interaction variables
. label var excess_X_lowdebt "Excess Interest (Scaled) x Low Constraint"

. label var excess_post_X_lowdebt "Excess Interest (Scaled) x Post x Low Constr
> aint"

. label var post_X_lowdebt "Post x Low Constraint"

. 
. * Save financial constraint interaction table
. esttab fincon_interaction using "$tabdir/finconstraint_interaction.tex", repl
> ace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant ///
> order(excess_interest_scaled excess_interest_scaled_post excess_post_X_lowdeb
> t excess_X_lowdebt post_X_lowdebt) ///
> keep(excess_interest_scaled excess_interest_scaled_post excess_post_X_lowdebt
>  excess_X_lowdebt post_X_lowdebt)
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/finconstraint_interaction.tex)

. est clear

. 
end of do-file
