
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 60-user network, expiring 14 Aug 2026
Serial number: 401909327398
  Licensed to: Zirui Song
               MIT Sloan

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do AN_5_MechanismTests.do 

. /***********
>         Globals for Paths
>         ***********/
. 
. *** Change repodir and overleafdir paths for different users
. global repodir "/Users/zrsong/MIT Dropbox/Zirui Song/Research Projects/MPS_In
> terest Deductibility and Debt Contracting"

. global overleafdir "/Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax In
> cidence and Loan Contract Terms"

. 
. global datadir "$repodir/3. Data"

. global rawdir "$datadir/Raw"

. global cleandir "$datadir/Processed"

. 
. global tabdir "$overleafdir/Tables"

. global figdir "$overleafdir/Figures"

. 
. global codedir "$repodir/4. Code/Replication"

. 
. /***********
>         Mechanism Tests
>         ***********/
.         
.         *** Table 7: Competition
. 
. *** construct firm-level and industry-level competition measures
. * firm
. use "$cleandir/tranche_level_ds_compa_wlabel.dta", clear

. 
. bysort gvkey: egen avg_number_of_lead_byfirm = mean(number_of_lead_arrangers)

. egen median_number_of_lead = median(avg_number_of_lead_byfirm)

. egen p33_number_of_lead_byfirm = pctile(avg_number_of_lead_byfirm), p(33)

. egen p67_number_of_lead_byfirm = pctile(avg_number_of_lead_byfirm), p(67)

. 
. gen high_competition = 1 if avg_number_of_lead_byfirm >= p67_number_of_lead_b
> yfirm
(2,322 missing values generated)

. replace high_competition = 0 if avg_number_of_lead_byfirm <= p33_number_of_le
> ad_byfirm
(1,179 real changes made)

. 
. keep gvkey high_competition

. duplicates drop 

Duplicates in terms of all variables

(2,269 observations deleted)

. tempfile firm_competition_measure

. save `firm_competition_measure'
file /var/folders/n2/pgdf58ms1yd3ch8xjn9fmpmm0000gq/T//St81847.000001 saved
    as .dta format

. 
. * industry
. use "$cleandir/tranche_level_ds_compa_wlabel.dta", clear

. 
. replace lender_parent_id = lender_id if lender_parent_id == .
(1 real change made)

. * KKR and Everbank have missing lender_parent_id
. bysort ff_48: egen number_of_lead_byindustry = nvals(lender_parent_id)

. bysort ff_48: egen number_of_firms = nvals(gvkey)

. replace number_of_lead_byindustry = number_of_lead_byindustry/number_of_firms
(3,471 real changes made)

. 
. egen median_number_of_lead = median(number_of_lead_byindustry)

. egen p33_number_of_lead = pctile(number_of_lead_byindustry), p(33)

. egen p67_number_of_lead = pctile(number_of_lead_byindustry), p(67)

. 
. gen high_competition_industry = 1 if number_of_lead_byindustry >= p67_number_
> of_lead
(2,303 missing values generated)

. replace high_competition_industry = 0 if number_of_lead_byindustry <= p33_num
> ber_of_lead
(1,269 real changes made)

. 
. keep ff_48 high_competition_industry

. duplicates drop 

Duplicates in terms of all variables

(3,432 observations deleted)

. tempfile industry_competition_measure

. save `industry_competition_measure'
file /var/folders/n2/pgdf58ms1yd3ch8xjn9fmpmm0000gq/T//St81847.000002 saved
    as .dta format

. 
. *** merge back to data for regressions
. use "$cleandir/tranche_level_ds_compa_wlabel.dta", clear

. merge m:1 gvkey using `firm_competition_measure', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             3,476  
    -----------------------------------------

. merge m:1 ff_48 using `industry_competition_measure', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             3,476  
    -----------------------------------------

. 
. save "$cleandir/tranche_level_ds_compa_wlabel_withcomp.dta", replace
file /Users/zrsong/MIT Dropbox/Zirui Song/Research Projects/MPS_Interest
    Deductibility and Debt Contracting/3.
    Data/Processed/tranche_level_ds_compa_wlabel_withcomp.dta saved

. 
. use "$cleandir/tranche_level_ds_compa_wlabel_withcomp.dta", clear

. 
. local controls "log_at market_to_book ppent_by_at debt_by_at cash_by_at divid
> end_payer ret_vol cash_etr"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dum
> my tranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. local controls_post "log_at_post market_to_book_post ppent_by_at_post debt_by
> _at_post cash_by_at_post dividend_payer_post ret_vol_post cash_etr_post"   

. 
. local treat_vars "treated treated_post treated_loss treated_loss_post"

. 
. *** split sample tests with continuous measure
. 
. fvset base 1 ff_48

. fvset base 1 gvkey

. 
. reg margin_bps excess_interest_scaled excess_interest_scaled_post `controls' 
> `deal_controls' `controls_post' i.year i.ff_48 ib2.sp_rating_num if high_comp
> etition_industry == 0
note: 1b.ff_48 identifies no observations in the sample.
note: 44.ff_48 omitted because of collinearity.
note: 2b.sp_rating_num identifies no observations in the sample.
note: 20.sp_rating_num omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =     1,269
-------------+----------------------------------   F(53, 1215)     =     31.44
       Model |  22329600.2        53  421313.211   Prob > F        =    0.0000
    Residual |  16282454.4     1,215   13401.197   R-squared       =    0.5783
-------------+----------------------------------   Adj R-squared   =    0.5599
       Total |  38612054.6     1,268  30451.1472   Root MSE        =    115.76

------------------------------------------------------------------------------
  margin_bps | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   63.13052   15.74767     4.01   0.000     32.23488    94.02617
excess_int~t |  -25.44418   23.29956    -1.09   0.275    -71.15602    20.26767
      log_at |  -1.806013   4.230606    -0.43   0.670    -10.10612     6.49409
market_to_~k |  -1.683202   4.050258    -0.42   0.678    -9.629478    6.263073
 ppent_by_at |   36.95546   27.05412     1.37   0.172    -16.12252    90.03345
  debt_by_at |   37.04673   27.28133     1.36   0.175    -16.47701    90.57048
  cash_by_at |   19.40196   43.69972     0.44   0.657    -66.33333    105.1373
dividend_p~r |   12.46733   10.31374     1.21   0.227    -7.767381    32.70205
     ret_vol |   340.6961   114.0575     2.99   0.003     116.9246    564.4675
    cash_etr |    38.4578   11.95597     3.22   0.001     15.00117    61.91444
   leveraged |   111.3149   10.36033    10.74   0.000     90.98882    131.6411
    maturity |   7.811101   2.811274     2.78   0.006     2.295611    13.32659
log_deal_a~d |  -15.05652   3.483923    -4.32   0.000     -21.8917   -8.221352
secured_du~y |   61.11302   8.782741     6.96   0.000       43.882    78.34404
tranche_ty~y |   67.90415   6.892962     9.85   0.000     54.38072    81.42758
tranche_o_~y |   10.16815   7.969329     1.28   0.202    -5.467025    25.80332
sponsor_du~y |   111.5947   9.658076    11.55   0.000     92.64632     130.543
 log_at_post |   3.452839   4.862542     0.71   0.478    -6.087071    12.99275
market_to_~t |   -2.84567   6.017734    -0.47   0.636    -14.65197    8.960632
ppent_by_~st |  -49.10008   35.51503    -1.38   0.167    -118.7777    20.57751
debt_by_at~t |   47.68656   38.32164     1.24   0.214    -27.49736    122.8705
cash_by_at~t |   6.745905   63.25156     0.11   0.915    -117.3485    130.8403
dividend_p~t |  -12.01413   15.11701    -0.79   0.427    -41.67247    17.64421
ret_vol_post |   178.8065   180.8798     0.99   0.323    -176.0649    533.6779
cash_etr_p~t |    -49.398   25.24926    -1.96   0.051    -98.93498    .1389813
             |
        year |
       2015  |   14.88384   12.75298     1.17   0.243    -10.13647    39.90416
       2016  |   5.320133       13.5     0.39   0.694    -21.16576    31.80603
       2017  |   2.318862   13.26907     0.17   0.861    -23.71397     28.3517
       2018  |  -13.83624   47.54685    -0.29   0.771    -107.1193    79.44681
       2019  |   -47.2064   48.87733    -0.97   0.334    -143.0997    48.68694
       2022  |   -19.8438   50.99849    -0.39   0.697    -119.8987    80.21106
       2023  |  -39.79862   52.44672    -0.76   0.448    -142.6948    63.09757
             |
       ff_48 |
          1  |          0  (empty)
         21  |   20.26863   16.38688     1.24   0.216    -11.88109    52.41835
         34  |   15.97425   13.77218     1.16   0.246    -11.04564    42.99414
         36  |   23.22309     15.457     1.50   0.133    -7.102292    53.54847
         37  |   25.70724   16.07868     1.60   0.110    -5.837816    57.25229
         43  |   .9566575   14.90468     0.06   0.949     -28.2851    30.19841
         44  |          0  (omitted)
             |
sp_rating_~m |
          0  |   41.04573   87.08218     0.47   0.637    -129.8024    211.8939
          2  |          0  (empty)
          4  |   193.0655   107.6492     1.79   0.073    -18.13343    404.2643
          5  |   229.7508   121.9862     1.88   0.060    -9.576106    469.0778
          7  |   102.2371   92.06625     1.11   0.267    -78.38938    282.8635
          8  |   37.85454   88.36679     0.43   0.668    -135.5139     211.223
          9  |   11.31273   88.21644     0.13   0.898    -161.7607    184.3862
         10  |  -27.33177   88.02555    -0.31   0.756    -200.0307    145.3672
         11  |  -31.07602   87.96582    -0.35   0.724    -203.6578    141.5058
         12  |  -6.829412   89.04091    -0.08   0.939    -181.5204    167.8616
         13  |   52.78475    88.1078     0.60   0.549    -120.0756    225.6451
         14  |   40.02194   87.45136     0.46   0.647    -131.5505    211.5944
         15  |   105.1598   89.12022     1.18   0.238    -69.68684    280.0063
         16  |   67.97169   87.20367     0.78   0.436    -103.1148    239.0582
         17  |   44.80342   95.32998     0.47   0.638    -142.2262    231.8331
         18  |   33.46396   109.8895     0.30   0.761    -182.1304    249.0583
         19  |   158.4034   111.0057     1.43   0.154    -59.38061    376.1875
         20  |          0  (omitted)
             |
       _cons |    33.8263   98.27714     0.34   0.731    -158.9854     226.638
------------------------------------------------------------------------------

. estimates store m1

. 
. reg margin_bps excess_interest_scaled excess_interest_scaled_post `controls' 
> `deal_controls' `controls_post' i.year i.ff_48 ib2.sp_rating_num if high_comp
> etition_industry == 1
note: 2b.sp_rating_num identifies no observations in the sample.
note: 19.sp_rating_num omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =     1,173
-------------+----------------------------------   F(77, 1095)     =     18.46
       Model |  20208482.1        77  262447.819   Prob > F        =    0.0000
    Residual |  15571236.7     1,095  14220.3075   R-squared       =    0.5648
-------------+----------------------------------   Adj R-squared   =    0.5342
       Total |  35779718.7     1,172  30528.7703   Root MSE        =    119.25

------------------------------------------------------------------------------
  margin_bps | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   106.4038   17.60929     6.04   0.000     71.85204    140.9556
excess_int~t |  -98.11124   26.71233    -3.67   0.000    -150.5244   -45.69811
      log_at |  -4.673171   4.201219    -1.11   0.266    -12.91652    3.570179
market_to_~k |  -5.077287   7.023709    -0.72   0.470    -18.85874    8.704164
 ppent_by_at |  -35.41239   26.88534    -1.32   0.188    -88.16501    17.34022
  debt_by_at |   24.55138   25.44739     0.96   0.335    -25.37979    74.48254
  cash_by_at |  -61.28446   58.94243    -1.04   0.299    -176.9373    54.36842
dividend_p~r |   12.69755   11.01873     1.15   0.249    -8.922674    34.31777
     ret_vol |   198.3694   113.1362     1.75   0.080    -23.61892    420.3578
    cash_etr |   7.928195   11.04319     0.72   0.473       -13.74    29.59639
   leveraged |   67.61132    11.4259     5.92   0.000     45.19218    90.03046
    maturity |   6.623769   2.724496     2.43   0.015     1.277947    11.96959
log_deal_a~d |   -18.3094   4.057225    -4.51   0.000    -26.27021   -10.34858
secured_du~y |   49.09627   10.05604     4.88   0.000     29.36499    68.82755
tranche_ty~y |    69.0075   7.441342     9.27   0.000      54.4066     83.6084
tranche_o_~y |    23.6052   8.705528     2.71   0.007       6.5238     40.6866
sponsor_du~y |   113.3282   11.42927     9.92   0.000     90.90241    135.7539
 log_at_post |  -2.718025   5.569614    -0.49   0.626    -13.64635    8.210296
market_to_~t |  -4.533001   9.604996    -0.47   0.637    -23.37928    14.31328
ppent_by_~st |    48.4763   38.90594     1.25   0.213    -27.86232    124.8149
debt_by_at~t |   14.89974    41.6302     0.36   0.720    -66.78425    96.58373
cash_by_at~t |   54.61962   94.11502     0.58   0.562    -130.0465    239.2858
dividend_p~t |  -18.26117   17.87606    -1.02   0.307    -53.33638    16.81404
ret_vol_post |  -59.35383   213.3527    -0.28   0.781    -477.9801    359.2725
cash_etr_p~t |   20.19617   26.58433     0.76   0.448     -31.9658    72.35815
             |
        year |
       2015  |  -22.03443    13.6474    -1.61   0.107    -48.81244    4.743584
       2016  |  -9.646955    14.7943    -0.65   0.514    -38.67533    19.38142
       2017  |  -26.93748   13.86098    -1.94   0.052    -54.13456    .2595927
       2018  |  -9.914302   59.85776    -0.17   0.868    -127.3632    107.5346
       2019  |   11.30254   61.08714     0.19   0.853    -108.5585    131.1636
       2022  |    10.6029    61.4289     0.17   0.863    -109.9288    131.1346
       2023  |   8.109575   65.36374     0.12   0.901    -120.1428    136.3619
             |
       ff_48 |
          2  |   133.2625   87.97687     1.51   0.130    -39.35984    305.8848
          3  |   117.7515   91.52457     1.29   0.199     -61.8319    297.3348
          4  |   148.6519   99.78507     1.49   0.137    -47.13969    344.4434
          5  |    176.196   94.45444     1.87   0.062    -9.136146    361.5282
          6  |    141.488   91.36761     1.55   0.122    -37.78738    320.7634
          7  |   199.2993   87.82712     2.27   0.023     26.97087    371.6278
          8  |    191.752    91.4303     2.10   0.036     12.35356    371.1504
          9  |   169.6683   88.13068     1.93   0.054     -3.25585    342.5924
         10  |   156.3434   89.85611     1.74   0.082     -19.9662    332.6531
         12  |   159.2717   88.29838     1.80   0.072    -13.98145    332.5248
         14  |   159.0245   87.73924     1.81   0.070    -13.13154    331.1805
         15  |   128.2544   91.81136     1.40   0.163    -51.89169    308.4005
         16  |   150.9121   94.42922     1.60   0.110    -34.37057    336.1948
         17  |   202.9826   90.64925     2.24   0.025     25.11674    380.8485
         18  |   154.8661   88.25015     1.75   0.080     -18.2924    328.0246
         19  |   111.3357   91.22836     1.22   0.223    -67.66642    290.3379
         20  |   128.9431   113.8813     1.13   0.258    -94.50718    352.3934
         22  |   162.3732   89.82449     1.81   0.071    -13.87435    338.6208
         24  |    146.724   88.12717     1.66   0.096    -26.19326    319.6412
         25  |   174.6098   100.6374     1.74   0.083    -22.85414    372.0736
         26  |   159.5728   101.3995     1.57   0.116    -39.38644     358.532
         27  |   279.9647   114.7267     2.44   0.015     54.85577    505.0736
         28  |   239.9741   96.71576     2.48   0.013     50.20494    429.7433
         29  |   259.6584   92.51231     2.81   0.005     78.13693    441.1798
         32  |   170.1922   87.89547     1.94   0.053    -2.270335    342.6548
         33  |   198.5622   88.53329     2.24   0.025     24.84808    372.2762
         35  |   194.4388    89.2827     2.18   0.030     19.25429    369.6233
         40  |   140.6356    90.0921     1.56   0.119    -36.13704    317.4083
         49  |   112.9439   89.92934     1.26   0.209    -63.50938    289.3972
             |
sp_rating_~m |
          0  |  -180.6541   125.2097    -1.44   0.149    -426.3322    65.02404
          1  |    74.1484   137.8446     0.54   0.591     -196.321    344.6178
          2  |          0  (empty)
          5  |  -51.64967   177.4556    -0.29   0.771    -399.8411    296.5417
          6  |  -98.82793   142.3227    -0.69   0.488    -378.0839     180.428
          7  |  -138.0639   128.5422    -1.07   0.283    -390.2808     114.153
          8  |  -127.9674   126.2336    -1.01   0.311    -375.6545    119.7198
          9  |  -177.4065   126.5108    -1.40   0.161    -425.6374    70.82446
         10  |    -194.27   125.9954    -1.54   0.123    -441.4896    52.94964
         11  |   -196.775   126.1066    -1.56   0.119    -444.2129    50.66285
         12  |  -215.1714   126.0878    -1.71   0.088    -462.5724    32.22953
         13  |  -188.3604   126.4612    -1.49   0.137    -436.4941    59.77319
         14  |  -175.3281   126.2138    -1.39   0.165    -422.9764    72.32021
         15  |  -177.9216   126.2054    -1.41   0.159    -425.5533    69.71008
         16  |  -179.5377   126.1408    -1.42   0.155    -427.0428    67.96738
         17  |  -2.694813   139.0372    -0.02   0.985    -275.5042    270.1146
         18  |  -129.0258   130.8589    -0.99   0.324    -385.7884    127.7368
         19  |          0  (omitted)
             |
       _cons |   247.8232   159.3564     1.56   0.120    -64.85519    560.5015
------------------------------------------------------------------------------

. estimates store m2

. 
. suest m1 m2, vce(cluster gvkey)

Simultaneous results for m1, m2                          Number of obs = 2,442

                                (Std. err. adjusted for 850 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
             | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
m1_mean      |
excess_int~d |   63.13052   23.19605     2.72   0.006     17.66709     108.594
excess_int~t |  -25.44418   31.87085    -0.80   0.425    -87.90989    37.02153
      log_at |  -1.806013   6.203841    -0.29   0.771    -13.96532    10.35329
market_to_~k |  -1.683202   6.462076    -0.26   0.794    -14.34864    10.98223
 ppent_by_at |   36.95546   38.25766     0.97   0.334    -38.02816    111.9391
  debt_by_at |   37.04673   35.51206     1.04   0.297    -32.55563    106.6491
  cash_by_at |   19.40196   48.40091     0.40   0.689    -75.46208     114.266
dividend_p~r |   12.46733   13.14152     0.95   0.343    -13.28958    38.22424
     ret_vol |   340.6961   185.5084     1.84   0.066    -22.89367    704.2858
    cash_etr |    38.4578   15.72299     2.45   0.014     7.641304     69.2743
   leveraged |   111.3149   13.14187     8.47   0.000     85.55735    137.0725
    maturity |   7.811101   3.843921     2.03   0.042     .2771545    15.34505
log_deal_a~d |  -15.05652    4.70634    -3.20   0.001    -24.28078   -5.832267
secured_du~y |   61.11302   11.32325     5.40   0.000     38.91986    83.30618
tranche_ty~y |   67.90415   6.698273    10.14   0.000     54.77578    81.03252
tranche_o_~y |   10.16815   9.581508     1.06   0.289    -8.611262    28.94756
sponsor_du~y |   111.5947   14.14321     7.89   0.000     83.87449    139.3149
 log_at_post |   3.452839   5.699405     0.61   0.545    -7.717789    14.62347
market_to_~t |   -2.84567   7.620259    -0.37   0.709     -17.7811    12.08976
ppent_by_~st |  -49.10008    43.0653    -1.14   0.254    -133.5065    35.30635
debt_by_at~t |   47.68656   45.74422     1.04   0.297    -41.97046    137.3436
cash_by_at~t |   6.745905   70.17461     0.10   0.923    -130.7938    144.2856
dividend_p~t |  -12.01413   17.00641    -0.71   0.480    -45.34608    21.31783
ret_vol_post |   178.8065   242.1723     0.74   0.460    -295.8425    653.4555
cash_etr_p~t |    -49.398   31.07362    -1.59   0.112    -110.3012    11.50518
             |
        year |
       2015  |   14.88384   14.72602     1.01   0.312    -13.97862    43.74631
       2016  |   5.320133   15.08452     0.35   0.724    -24.24498    34.88525
       2017  |   2.318862   17.08705     0.14   0.892    -31.17113    35.80886
       2018  |  -13.83624   60.29513    -0.23   0.818    -132.0125    104.3401
       2019  |   -47.2064   61.56417    -0.77   0.443      -167.87    73.45716
       2022  |   -19.8438   62.97746    -0.32   0.753    -143.2774    103.5897
       2023  |  -39.79862   65.58765    -0.61   0.544     -168.348    88.75081
             |
       ff_48 |
         21  |   20.26863    23.3408     0.87   0.385     -25.4785    66.01575
         34  |   15.97425   20.48518     0.78   0.436    -24.17596    56.12447
         36  |   23.22309   23.04617     1.01   0.314    -21.94657    68.39275
         37  |   25.70724   23.53572     1.09   0.275    -20.42193    71.83641
         43  |   .9566575   19.87612     0.05   0.962    -37.99983    39.91315
         44  |          0  (omitted)
             |
sp_rating_~m |
          0  |   41.04573   35.76146     1.15   0.251    -29.04544    111.1369
          2  |          0  (empty)
          4  |   193.0655   51.28637     3.76   0.000     92.54602    293.5849
          5  |   229.7508   131.3059     1.75   0.080    -27.60402    487.1057
          7  |   102.2371   51.84706     1.97   0.049     .6187153    203.8555
          8  |   37.85454   38.62602     0.98   0.327    -37.85107    113.5602
          9  |   11.31273   41.81026     0.27   0.787    -70.63387    93.25933
         10  |  -27.33177   36.56761    -0.75   0.455    -99.00296    44.33943
         11  |  -31.07602   39.04631    -0.80   0.426    -107.6054    45.45334
         12  |  -6.829412   37.24949    -0.18   0.855    -79.83707    66.17824
         13  |   52.78475   36.20341     1.46   0.145    -18.17263    123.7421
         14  |   40.02194   33.61602     1.19   0.234    -25.86424    105.9081
         15  |   105.1598   38.76399     2.71   0.007     29.18374    181.1358
         16  |   67.97169   31.79159     2.14   0.033     5.661326    130.2821
         17  |   44.80342   36.52374     1.23   0.220    -26.78179    116.3886
         18  |   33.46396   45.24031     0.74   0.459    -55.20543    122.1333
         19  |   158.4034   45.32207     3.50   0.000     69.57382    247.2331
         20  |          0  (omitted)
             |
       _cons |    33.8263   72.64346     0.47   0.641    -108.5523    176.2049
-------------+----------------------------------------------------------------
m1_lnvar     |
       _cons |   9.503099   .0728105   130.52   0.000     9.360393    9.645805
-------------+----------------------------------------------------------------
m2_mean      |
excess_int~d |   106.4038   28.59723     3.72   0.000     50.35426    162.4533
excess_int~t |  -98.11124    37.7795    -2.60   0.009    -172.1577   -24.06478
      log_at |  -4.673171   6.467299    -0.72   0.470    -17.34884    8.002501
market_to_~k |  -5.077287   9.752342    -0.52   0.603    -24.19153    14.03695
 ppent_by_at |  -35.41239   37.19234    -0.95   0.341     -108.308    37.48325
  debt_by_at |   24.55138    40.3962     0.61   0.543    -54.62372    103.7265
  cash_by_at |  -61.28446     77.972    -0.79   0.432    -214.1068    91.53786
dividend_p~r |   12.69755   14.76803     0.86   0.390    -16.24727    41.64236
     ret_vol |   198.3694   170.6497     1.16   0.245    -136.0978    532.8366
    cash_etr |   7.928195   12.55731     0.63   0.528    -16.68368    32.54007
   leveraged |   67.61132   11.39794     5.93   0.000     45.27177    89.95087
    maturity |   6.623769   4.853408     1.36   0.172    -2.888736    16.13627
log_deal_a~d |   -18.3094   5.486602    -3.34   0.001    -29.06294   -7.555854
secured_du~y |   49.09627   11.62004     4.23   0.000     26.32142    71.87113
tranche_ty~y |    69.0075   6.986357     9.88   0.000     55.31449    82.70051
tranche_o_~y |    23.6052   9.086837     2.60   0.009     5.795327    41.41507
sponsor_du~y |   113.3282   18.62357     6.09   0.000     76.82664    149.8297
 log_at_post |  -2.718025   5.668298    -0.48   0.632    -13.82769    8.391634
market_to_~t |  -4.533001   11.50134    -0.39   0.693    -27.07521    18.00921
ppent_by_~st |    48.4763    44.1791     1.10   0.273    -38.11314    135.0657
debt_by_at~t |   14.89974   48.01304     0.31   0.756    -79.20409    109.0036
cash_by_at~t |   54.61962   100.9567     0.54   0.588    -143.2519    252.4911
dividend_p~t |  -18.26117   19.09432    -0.96   0.339    -55.68535    19.16301
ret_vol_post |  -59.35383   251.3453    -0.24   0.813    -551.9816     433.274
cash_etr_p~t |   20.19617   24.67135     0.82   0.413    -28.15879    68.55114
             |
        year |
       2015  |  -22.03443   17.75285    -1.24   0.215    -56.82937    12.76051
       2016  |  -9.646955   16.90744    -0.57   0.568    -42.78492    23.49101
       2017  |  -26.93748   17.77642    -1.52   0.130    -61.77863    7.903667
       2018  |  -9.914302   66.03862    -0.15   0.881    -139.3476     119.519
       2019  |   11.30254   69.73477     0.16   0.871    -125.3751    147.9802
       2022  |    10.6029   68.80648     0.15   0.878    -124.2553    145.4611
       2023  |   8.109575   69.71075     0.12   0.907     -128.521    144.7401
             |
       ff_48 |
          2  |   133.2625   33.61479     3.96   0.000      67.3787    199.1462
          3  |   117.7515   45.76097     2.57   0.010     28.06161    207.4413
          4  |   148.6519    37.3897     3.98   0.000     75.36941    221.9343
          5  |    176.196   58.77612     3.00   0.003     60.99693    291.3951
          6  |    141.488   35.39998     4.00   0.000     72.10531    210.8707
          7  |   199.2993   34.47286     5.78   0.000     131.7338    266.8649
          8  |    191.752   53.07221     3.61   0.000     87.73235    295.7716
          9  |   169.6683   39.67009     4.28   0.000      91.9163    247.4202
         10  |   156.3434   39.15256     3.99   0.000     79.60583     233.081
         12  |   159.2717   34.27376     4.65   0.000     92.09636     226.447
         14  |   159.0245   35.59405     4.47   0.000     89.26145    228.7876
         15  |   128.2544   39.80497     3.22   0.001     50.23807    206.2707
         16  |   150.9121   69.01695     2.19   0.029     15.64137    286.1828
         17  |   202.9826   58.16554     3.49   0.000     88.98023     316.985
         18  |   154.8661   31.44753     4.92   0.000     93.23007    216.5021
         19  |   111.3357   40.88898     2.72   0.006     31.19481    191.4767
         20  |   128.9431   41.80832     3.08   0.002      47.0003    210.8859
         22  |   162.3732   34.18177     4.75   0.000     95.37817    229.3683
         24  |    146.724     40.341     3.64   0.000     67.65704    225.7909
         25  |   174.6098   34.22545     5.10   0.000     107.5291    241.6904
         26  |   159.5728   38.69073     4.12   0.000     83.74033    235.4052
         27  |   279.9647   100.4149     2.79   0.005     83.15515    476.7742
         28  |   239.9741   69.54225     3.45   0.001     103.6738    376.2744
         29  |   259.6584   55.96422     4.64   0.000     149.9705    369.3462
         32  |   170.1922   32.96125     5.16   0.000     105.5894    234.7951
         33  |   198.5622   39.28589     5.05   0.000     121.5632    275.5611
         35  |   194.4388   41.56253     4.68   0.000     112.9777    275.8999
         40  |   140.6356    35.0844     4.01   0.000     71.87147    209.3998
         49  |   112.9439    35.8843     3.15   0.002     42.61199    183.2759
             |
sp_rating_~m |
          0  |  -180.6541   49.67259    -3.64   0.000    -278.0106   -83.29762
          1  |    74.1484   66.18843     1.12   0.263    -55.57854    203.8753
          2  |          0  (empty)
          5  |  -51.64967   66.46126    -0.78   0.437    -181.9113    78.61201
          6  |  -98.82793   121.8065    -0.81   0.417    -337.5643    139.9084
          7  |  -138.0639   61.14373    -2.26   0.024    -257.9034   -18.22437
          8  |  -127.9674   51.58484    -2.48   0.013    -229.0718   -26.86294
          9  |  -177.4065   53.78202    -3.30   0.001    -282.8173   -71.99568
         10  |    -194.27   54.40723    -3.57   0.000    -300.9062   -87.63377
         11  |   -196.775    52.6379    -3.74   0.000    -299.9434   -93.60662
         12  |  -215.1714   50.30504    -4.28   0.000    -313.7675   -116.5754
         13  |  -188.3604   49.61242    -3.80   0.000     -285.599   -91.12187
         14  |  -175.3281   49.81258    -3.52   0.000     -272.959   -77.69724
         15  |  -177.9216   49.59282    -3.59   0.000    -275.1217   -80.72146
         16  |  -179.5377   51.88473    -3.46   0.001    -281.2299   -77.84549
         17  |  -2.694813   112.8075    -0.02   0.981    -223.7935    218.4039
         18  |  -129.0258   47.70688    -2.70   0.007    -222.5296   -35.52204
         19  |          0  (omitted)
             |
       _cons |   247.8232    94.4932     2.62   0.009     62.61989    433.0264
-------------+----------------------------------------------------------------
m2_lnvar     |
       _cons |   9.562426   .0841594   113.62   0.000     9.397477    9.727376
------------------------------------------------------------------------------

. test [m1_mean]excess_interest_scaled = [m2_mean]excess_interest_scaled

 ( 1)  [m1_mean]excess_interest_scaled - [m2_mean]excess_interest_scaled = 0

           chi2(  1) =    1.37
         Prob > chi2 =    0.2411

. test [m1_mean]excess_interest_scaled_post = [m2_mean]excess_interest_scaled_p
> ost

 ( 1)  [m1_mean]excess_interest_scaled_post -
       [m2_mean]excess_interest_scaled_post = 0

           chi2(  1) =    2.18
         Prob > chi2 =    0.1398

. 
. * save the results (esttab) using tabdir
. esttab m1 m2 using "$tabdir/margin_did_both_rule_competition_cts.tex", replac
> e ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant keep( exces
> s_interest_scaled excess_interest_scaled_post)
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_did_both_rule_competition_cts.tex)

. est clear 

. 
. ****************** Demand Side Elasticity ******************
. 
. *** Table 8: HP Financial Constraint (RFS 2015) and Linn Weagley 2024 Extensi
> on 
. 
. local controls "log_at market_to_book ppent_by_at debt_by_at cash_by_at divid
> end_payer ret_vol cash_etr"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dum
> my tranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. local controls_post "log_at_post market_to_book_post ppent_by_at_post debt_by
> _at_post cash_by_at_post dividend_payer_post ret_vol_post cash_etr_post"   

. 
. use "$cleandir/tranche_level_ds_compa_wlabel.dta", clear        

. fvset base 1 ff_48

. merge m:1 gvkey year using "$rawdir/LinnWeagley_Constraint_Data_2025_01.dta"
(variable year was long, now double to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                       263,078
        from master                       530  (_merge==1)
        from using                    262,548  (_merge==2)

    Matched                             2,946  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(263,078 observations deleted)

. 
. bysort ff_48: egen median_lw_debtcon_full = median(lw_debtcon_full)

. bysort ff_48: egen p33_lw_debtcon_full = pctile(lw_debtcon_full), p(33)

. bysort ff_48: egen p67_lw_debtcon_full = pctile(lw_debtcon_full), p(67)

. 
. gen high_debtcon = 1 if lw_debtcon_full >= p67_lw_debtcon_full
(1,980 missing values generated)

. replace high_debtcon = 0 if lw_debtcon_full <= p33_lw_debtcon_full
(956 real changes made)

. 
. reg margin_bps excess_interest_scaled excess_interest_scaled_post `controls' 
> `deal_controls' `controls_post' i.year i.ff_48 ib2.sp_rating_num if high_debt
> con == 0
note: 2b.sp_rating_num identifies no observations in the sample.
note: 19.sp_rating_num omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =       956
-------------+----------------------------------   F(87, 868)      =     19.15
       Model |  16714770.2        87  192123.795   Prob > F        =    0.0000
    Residual |  8709607.12       868  10034.1096   R-squared       =    0.6574
-------------+----------------------------------   Adj R-squared   =    0.6231
       Total |  25424377.3       955  26622.3846   Root MSE        =    100.17

------------------------------------------------------------------------------
  margin_bps | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   157.6897   18.45874     8.54   0.000     121.4607    193.9187
excess_int~t |   -125.156    29.4832    -4.24   0.000    -183.0227    -67.2893
      log_at |  -14.03907    3.89266    -3.61   0.000     -21.6792   -6.398947
market_to_~k |    5.58762   4.346853     1.29   0.199    -2.943952    14.11919
 ppent_by_at |  -27.69832   27.54514    -1.01   0.315    -81.76119    26.36454
  debt_by_at |   110.5498   27.98012     3.95   0.000     55.63324    165.4664
  cash_by_at |   34.05403   43.17979     0.79   0.431    -50.69498     118.803
dividend_p~r |   12.52046   11.40572     1.10   0.273    -9.865548    34.90648
     ret_vol |    212.842   132.6396     1.60   0.109    -47.48983    473.1737
    cash_etr |   46.30981   12.70383     3.65   0.000     21.37599    71.24362
   leveraged |   69.85864   10.79168     6.47   0.000      48.6778    91.03949
    maturity |   6.727346   2.758407     2.44   0.015     1.313418    12.14127
log_deal_a~d |  -13.67076   3.851475    -3.55   0.000    -21.23005   -6.111466
secured_du~y |   45.37024   9.782321     4.64   0.000     26.17047       64.57
tranche_ty~y |   57.93062   7.005571     8.27   0.000     44.18078    71.68046
tranche_o_~y |  -.6333735   8.777437    -0.07   0.942    -17.86086    16.59411
sponsor_du~y |   127.6181   13.13642     9.71   0.000     101.8353     153.401
 log_at_post |   6.106854   4.818751     1.27   0.205    -3.350913    15.56462
market_to_~t |  -11.11924   6.370092    -1.75   0.081    -23.62183    1.383344
ppent_by_~st |   30.82008   36.52903     0.84   0.399    -40.87547    102.5156
debt_by_at~t |  -68.07259   47.10155    -1.45   0.149    -160.5188    24.37366
cash_by_at~t |   45.16978   66.17764     0.68   0.495    -84.71713    175.0567
dividend_p~t |  -12.05231   18.48393    -0.65   0.515    -48.33074    24.22612
ret_vol_post |  -38.10537   217.4372    -0.18   0.861    -464.8694    388.6587
cash_etr_p~t |  -31.98354    33.7013    -0.95   0.343    -98.12912    34.16203
             |
        year |
       2015  |   11.51323   11.65507     0.99   0.324    -11.36218    34.38864
       2016  |     16.366   13.75654     1.19   0.234    -10.63397    43.36596
       2017  |  -3.064245   14.34496    -0.21   0.831     -31.2191    25.09061
       2018  |  -14.25645   52.58915    -0.27   0.786    -117.4732    88.96032
       2019  |   .1141329   53.31266     0.00   0.998    -104.5227    104.7509
       2022  |   8.006258   54.64816     0.15   0.884    -99.25172    115.2642
       2023  |   14.81832   56.42113     0.26   0.793    -95.91947    125.5561
             |
       ff_48 |
          2  |    226.999   77.36439     2.93   0.003     75.15581    378.8421
          3  |   215.6076   85.78038     2.51   0.012      47.2464    383.9688
          4  |   221.9007   91.74272     2.42   0.016     41.83722    401.9642
          5  |   206.3334   106.0068     1.95   0.052    -1.726316     414.393
          6  |   192.4149    88.0785     2.18   0.029      19.5432    365.2867
          7  |   243.1746   78.17028     3.11   0.002     89.74971    396.5994
          8  |   210.6298   86.65294     2.43   0.015     40.55604    380.7036
          9  |   199.1516   76.88305     2.59   0.010     48.25322    350.0501
         10  |   241.6607   85.35204     2.83   0.005     74.14022    409.1813
         11  |   264.3398   77.14263     3.43   0.001     112.9319    415.7477
         12  |   253.7445   77.25151     3.28   0.001     102.1229    405.3661
         13  |   281.8122   78.22125     3.60   0.000     128.2873    435.3371
         14  |   222.2185   76.38403     2.91   0.004     72.29953    372.1375
         15  |    268.883   93.31711     2.88   0.004     85.72948    452.0366
         16  |   244.9088   86.19017     2.84   0.005     75.74325    414.0743
         17  |   347.0731   83.94574     4.13   0.000     182.3127    511.8334
         18  |   213.6438   78.26183     2.73   0.006     60.03929    367.2484
         19  |    202.689    87.9873     2.30   0.021     29.99621    375.3817
         21  |   226.7088   76.99254     2.94   0.003     75.59553    377.8222
         22  |   204.8517   81.29908     2.52   0.012     45.28594    364.4175
         23  |   223.5108   77.10622     2.90   0.004     72.17441    374.8473
         24  |    272.055   78.00911     3.49   0.001     118.9464    425.1635
         26  |   233.5529   132.0706     1.77   0.077    -25.66219    492.7681
         28  |   285.0357    127.706     2.23   0.026     34.38701    535.6845
         29  |   361.7799   87.71999     4.12   0.000     189.6118     533.948
         30  |   263.2921   77.21842     3.41   0.001     111.7355    414.8488
         32  |   233.8434   76.91597     3.04   0.002     82.88038    384.8065
         33  |   218.8655   80.01624     2.74   0.006     61.81756    375.9134
         34  |    213.093   75.11561     2.84   0.005     65.66357    360.5225
         35  |   284.8553   83.80032     3.40   0.001     120.3803    449.3302
         36  |   194.7042   75.81023     2.57   0.010     45.91141     343.497
         37  |   205.9008   76.71758     2.68   0.007     55.32715    356.4745
         38  |   247.5067   78.35493     3.16   0.002     93.71939     401.294
         39  |   195.9511    79.1083     2.48   0.013     40.68514     351.217
         40  |   177.5566   81.67753     2.17   0.030     17.24805    337.8652
         41  |   193.8971   77.22179     2.51   0.012     42.33385    345.4604
         42  |   210.5839   75.97617     2.77   0.006     61.46546    359.7024
         43  |   220.6789   76.53584     2.88   0.004     70.46198    370.8959
         44  |   231.7083   77.82311     2.98   0.003     78.96485    384.4518
         49  |   209.9916   126.3683     1.66   0.097    -38.03156    458.0148
             |
sp_rating_~m |
          0  |  -129.5031   46.00377    -2.82   0.005    -219.7947   -39.21149
          2  |          0  (empty)
          5  |  -145.5522   114.9233    -1.27   0.206    -371.1123     80.0079
          6  |    102.136   65.21144     1.57   0.118     -25.8545    230.1266
          7  |  -108.5629   61.86369    -1.75   0.080    -229.9829    12.85697
          8  |  -48.10646    53.2422    -0.90   0.366     -152.605    56.39205
          9  |  -154.8993   51.45421    -3.01   0.003    -255.8885   -53.91007
         10  |  -164.4971   49.17118    -3.35   0.001    -261.0054   -67.98878
         11  |  -119.0041   47.33452    -2.51   0.012    -211.9076    -26.1006
         12  |  -134.5048   48.65936    -2.76   0.006    -230.0086   -39.00107
         13  |  -120.4456   47.19282    -2.55   0.011    -213.0709   -27.82019
         14  |  -130.0197   47.24643    -2.75   0.006    -222.7503   -37.28912
         15  |   -91.2637   46.86622    -1.95   0.052    -183.2481    .7206724
         16  |  -113.8219   46.50824    -2.45   0.015    -205.1037   -22.54017
         17  |  -132.9828   60.61386    -2.19   0.029    -251.9497   -14.01591
         18  |  -106.3899   60.18192    -1.77   0.077     -224.509     11.7292
         19  |          0  (omitted)
             |
       _cons |   105.9962    97.1154     1.09   0.275     -84.6123    296.6047
------------------------------------------------------------------------------

. estimates store m1

. 
. reg margin_bps excess_interest_scaled excess_interest_scaled_post `controls' 
> `deal_controls' `controls_post' i.year i.ff_48 ib2.sp_rating_num if high_debt
> con == 1
note: 1b.ff_48 identifies no observations in the sample.
note: 44.ff_48 omitted because of collinearity.
note: 2b.sp_rating_num identifies no observations in the sample.
note: 17.sp_rating_num omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =       966
-------------+----------------------------------   F(86, 879)      =     11.43
       Model |  14899206.8        86   173246.59   Prob > F        =    0.0000
    Residual |  13320016.9       879  15153.6028   R-squared       =    0.5280
-------------+----------------------------------   Adj R-squared   =    0.4818
       Total |  28219223.7       965  29242.7188   Root MSE        =     123.1

------------------------------------------------------------------------------
  margin_bps | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |    68.4974   19.62388     3.49   0.001     29.98227    107.0125
excess_int~t |  -8.877126   29.92885    -0.30   0.767    -67.61748    49.86323
      log_at |   -.248643   5.387112    -0.05   0.963    -10.82175    10.32446
market_to_~k |  -24.58543    8.13985    -3.02   0.003    -40.56124   -8.609618
 ppent_by_at |   37.88722   30.97392     1.22   0.222    -22.90426    98.67869
  debt_by_at |    22.1688   32.63837     0.68   0.497    -41.88943    86.22703
  cash_by_at |   -61.8206   65.51566    -0.94   0.346     -190.406    66.76478
dividend_p~r |   4.329456    12.9129     0.34   0.737    -21.01426    29.67318
     ret_vol |   283.9006   128.9816     2.20   0.028     30.75273    537.0486
    cash_etr |   39.09991   16.60854     2.35   0.019     6.502888    71.69692
   leveraged |    67.9315   13.40399     5.07   0.000     41.62395    94.23905
    maturity |   2.670182   3.469331     0.77   0.442    -4.138958    9.479321
log_deal_a~d |  -6.669738    4.98781    -1.34   0.182    -16.45915    3.119669
secured_du~y |   56.47671   10.69404     5.28   0.000     35.48787    77.46555
tranche_ty~y |   95.48568   8.581094    11.13   0.000     78.64385    112.3275
tranche_o_~y |   33.01809   9.719118     3.40   0.001     13.94271    52.09348
sponsor_du~y |   73.86617   13.41151     5.51   0.000     47.54385    100.1885
 log_at_post |  -21.69457   7.717043    -2.81   0.005    -36.84055   -6.548593
market_to_~t |   4.250955   12.17987     0.35   0.727    -19.65406    28.15597
ppent_by_~st |  -15.61839   40.56478    -0.39   0.700    -95.23353    63.99675
debt_by_at~t |   81.51114   48.11714     1.69   0.091    -12.92675     175.949
cash_by_at~t |   76.92805   117.0488     0.66   0.511    -152.7997    306.6558
dividend_p~t |  -8.326506   19.62595    -0.42   0.671    -46.84569    30.19268
ret_vol_post |  -185.2605   225.2373    -0.82   0.411    -627.3262    256.8051
cash_etr_p~t |  -39.92509   31.57167    -1.26   0.206    -101.8897    22.03957
             |
        year |
       2015  |  -32.81274   14.56543    -2.25   0.025    -61.39983   -4.225648
       2016  |   16.27843   16.84813     0.97   0.334    -16.78883     49.3457
       2017  |  -20.74216   16.91173    -1.23   0.220    -53.93425    12.44992
       2018  |   134.3124   73.75636     1.82   0.069    -10.44676    279.0715
       2019  |   137.4099   74.63953     1.84   0.066    -9.082564    283.9024
       2022  |   154.2085   76.48528     2.02   0.044     4.093425    304.3236
       2023  |   161.9007   79.03278     2.05   0.041     6.785745    317.0157
             |
       ff_48 |
          1  |          0  (empty)
          2  |  -55.24327    37.8745    -1.46   0.145    -129.5783    19.09174
          3  |  -65.72056   55.74858    -1.18   0.239    -175.1364     43.6953
          4  |  -15.03308   81.45112    -0.18   0.854    -174.8945    144.8283
          5  |   104.2934   56.48594     1.85   0.065    -6.569672    215.1565
          6  |  -53.84891   59.45434    -0.91   0.365    -170.5379    62.84012
          7  |   101.7048   37.93988     2.68   0.007     27.24151    176.1682
          8  |   111.8021   53.94763     2.07   0.039     5.920944    217.6833
          9  |   10.69172    36.0314     0.30   0.767    -60.02591    81.40935
         10  |   4.171759   50.39054     0.08   0.934    -94.72807    103.0716
         11  |   15.64973   33.73456     0.46   0.643    -50.55997    81.85943
         12  |  -2.652413   36.79281    -0.07   0.943    -74.86443     69.5596
         13  |   17.34949   35.95791     0.48   0.630    -53.22389    87.92288
         14  |  -2.350683   32.58957    -0.07   0.943    -66.31314    61.61177
         15  |  -25.73556   69.97013    -0.37   0.713    -163.0636    111.5925
         16  |  -82.21918   94.47205    -0.87   0.384    -267.6363    103.1979
         17  |   -16.0862   58.56883    -0.27   0.784    -131.0373    98.86487
         18  |   14.35717   40.79551     0.35   0.725    -65.71081    94.42515
         19  |  -45.63481   56.39108    -0.81   0.419    -156.3117    65.04206
         20  |  -32.25679   80.20953    -0.40   0.688    -189.6813    125.1678
         21  |   43.06406   34.00803     1.27   0.206    -23.68235    109.8105
         22  |  -4.148604    49.6195    -0.08   0.933    -101.5351    93.23793
         23  |   19.60244   34.90557     0.56   0.575    -48.90556    88.11044
         24  |  -22.72698   37.88246    -0.60   0.549    -97.07762    51.62366
         25  |    58.8206    131.237     0.45   0.654    -198.7538     316.395
         28  |   182.3827   77.00789     2.37   0.018     31.24186    333.5235
         29  |   106.4879   53.98599     1.97   0.049     .5314387    212.4444
         30  |   17.57567   31.43643     0.56   0.576    -44.12355    79.27489
         32  |   3.076665   32.22189     0.10   0.924    -60.16416    66.31749
         33  |   26.24661   43.23497     0.61   0.544    -58.60921    111.1024
         34  |   -28.3014   29.99986    -0.94   0.346    -87.18111    30.57831
         35  |   -37.9651   52.56088    -0.72   0.470    -141.1246    65.19437
         36  |    24.1234    31.7526     0.76   0.448    -38.19636    86.44316
         37  |   20.73469   32.77104     0.63   0.527    -43.58392    85.05331
         38  |   23.46538   39.44735     0.59   0.552    -53.95661    100.8874
         39  |  -20.69087   36.69529    -0.56   0.573    -92.71149    51.32975
         40  |  -6.840674   53.27165    -0.13   0.898    -111.3952    97.71382
         41  |  -4.691579   32.63594    -0.14   0.886    -68.74504    59.36188
         42  |   4.158743   32.11285     0.13   0.897    -58.86807    67.18555
         43  |   18.41012   31.05811     0.59   0.553    -42.54659    79.36684
         44  |          0  (omitted)
             |
sp_rating_~m |
          0  |   125.7088   127.0547     0.99   0.323    -123.6573    375.0749
          1  |   392.3985   150.7837     2.60   0.009     96.46038    688.3367
          2  |          0  (empty)
          4  |   284.7139   140.1602     2.03   0.043     9.626124    559.8017
          5  |   325.4402   147.4897     2.21   0.028     35.96717    614.9132
          6  |   181.6181    148.012     1.23   0.220      -108.88    472.1163
          7  |   212.9425   129.9857     1.64   0.102    -42.17617    468.0611
          8  |   130.2973   128.5728     1.01   0.311    -122.0482    382.6428
          9  |   123.7855   128.4998     0.96   0.336    -128.4168    375.9878
         10  |   102.0949   128.2723     0.80   0.426    -149.6609    353.8506
         11  |   74.35624    127.898     0.58   0.561    -176.6648    325.3773
         12  |    81.9995   128.2936     0.64   0.523    -169.7981    333.7971
         13  |   95.40525   130.0985     0.73   0.464    -159.9347    350.7452
         14  |   121.8125    128.045     0.95   0.342    -129.4972    373.1222
         15  |    126.163   137.3245     0.92   0.358    -143.3592    395.6852
         16  |   94.65651   128.6181     0.74   0.462    -157.7779     347.091
         17  |          0  (omitted)
             |
       _cons |  -6.874316   141.2709    -0.05   0.961    -284.1421    270.3934
------------------------------------------------------------------------------

. estimates store m2

. 
. suest m1 m2, vce(cluster ff_48)

Simultaneous results for m1, m2                          Number of obs = 1,922

                                 (Std. err. adjusted for 43 clusters in ff_48)
------------------------------------------------------------------------------
             |               Robust
             | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
m1_mean      |
excess_int~d |   157.6897   31.89538     4.94   0.000      95.1759    220.2035
excess_int~t |   -125.156   50.35357    -2.49   0.013    -223.8472   -26.46481
      log_at |  -14.03907   5.270386    -2.66   0.008    -24.36884   -3.709307
market_to_~k |    5.58762   5.793193     0.96   0.335    -5.766828    16.94207
 ppent_by_at |  -27.69832   40.72344    -0.68   0.496    -107.5148    52.11815
  debt_by_at |   110.5498   56.65152     1.95   0.051    -.4850966    221.5848
  cash_by_at |   34.05403   67.32315     0.51   0.613    -97.89692     166.005
dividend_p~r |   12.52046   15.47767     0.81   0.419     -17.8152    42.85613
     ret_vol |    212.842   235.4397     0.90   0.366    -248.6114    674.2953
    cash_etr |   46.30981   14.54199     3.18   0.001     17.80803    74.81158
   leveraged |   69.85864   18.74381     3.73   0.000     33.12145    106.5958
    maturity |   6.727346   3.782745     1.78   0.075    -.6866978    14.14139
log_deal_a~d |  -13.67076   4.078608    -3.35   0.001    -21.66469   -5.676834
secured_du~y |   45.37024   12.40232     3.66   0.000     21.06215    69.67833
tranche_ty~y |   57.93062   7.756069     7.47   0.000       42.729    73.13224
tranche_o_~y |  -.6333735   9.351413    -0.07   0.946    -18.96181    17.69506
sponsor_du~y |   127.6181   17.75004     7.19   0.000     92.82869    162.4076
 log_at_post |   6.106854   6.055683     1.01   0.313    -5.762067    17.97577
market_to_~t |  -11.11924   6.763845    -1.64   0.100    -24.37613    2.137651
ppent_by_~st |   30.82008   33.07902     0.93   0.351     -34.0136    95.65377
debt_by_at~t |  -68.07259   60.03164    -1.13   0.257    -185.7324    49.58726
cash_by_at~t |   45.16978   80.91968     0.56   0.577    -113.4299    203.7694
dividend_p~t |  -12.05231   18.44525    -0.65   0.513    -48.20434    24.09972
ret_vol_post |  -38.10537   266.1057    -0.14   0.886    -559.6629    483.4521
cash_etr_p~t |  -31.98354    25.4391    -1.26   0.209    -81.84327    17.87618
             |
        year |
       2015  |   11.51323   16.15123     0.71   0.476    -20.14261    43.16907
       2016  |     16.366   14.27954     1.15   0.252    -11.62138    44.35337
       2017  |  -3.064245   17.42721    -0.18   0.860    -37.22095    31.09246
       2018  |  -14.25645   65.75283    -0.22   0.828    -143.1296    114.6167
       2019  |   .1141329   65.17246     0.00   0.999    -127.6215    127.8498
       2022  |   8.006258   64.91534     0.12   0.902    -119.2255     135.238
       2023  |   14.81832   72.73017     0.20   0.839    -127.7302    157.3668
             |
       ff_48 |
          2  |    226.999   35.04172     6.48   0.000     158.3184    295.6795
          3  |   215.6076     34.313     6.28   0.000     148.3554    282.8599
          4  |   221.9007   45.72159     4.85   0.000     132.2881    311.5134
          5  |   206.3334   44.70188     4.62   0.000     118.7193    293.9474
          6  |   192.4149   39.38379     4.89   0.000     115.2241    269.6057
          7  |   243.1746   39.03867     6.23   0.000     166.6602     319.689
          8  |   210.6298   44.11198     4.77   0.000      124.172    297.0877
          9  |   199.1516   32.91222     6.05   0.000     134.6449    263.6584
         10  |   241.6607   38.98095     6.20   0.000     165.2595     318.062
         11  |   264.3398   34.11709     7.75   0.000     197.4715    331.2081
         12  |   253.7445   34.71217     7.31   0.000     185.7099    321.7791
         13  |   281.8122   35.28832     7.99   0.000     212.6484     350.976
         14  |   222.2185   36.65452     6.06   0.000      150.377    294.0601
         15  |    268.883    58.6388     4.59   0.000     153.9531     383.813
         16  |   244.9088   35.61617     6.88   0.000     175.1023    314.7152
         17  |   347.0731   32.69723    10.61   0.000     282.9877    411.1585
         18  |   213.6438   34.45794     6.20   0.000     146.1075    281.1802
         19  |    202.689   40.09287     5.06   0.000     124.1084    281.2695
         21  |   226.7088   36.76293     6.17   0.000     154.6548    298.7629
         22  |   204.8517   34.21188     5.99   0.000     137.7976    271.9058
         23  |   223.5108   34.88017     6.41   0.000      155.147    291.8747
         24  |    272.055   34.79406     7.82   0.000     203.8599    340.2501
         26  |   233.5529   35.29605     6.62   0.000      164.374    302.7319
         28  |   285.0357   43.38526     6.57   0.000     200.0022    370.0693
         29  |   361.7799   54.15756     6.68   0.000     255.6331    467.9268
         30  |   263.2921   40.13873     6.56   0.000     184.6217    341.9626
         32  |   233.8434    40.2549     5.81   0.000     154.9453    312.7416
         33  |   218.8655   29.58522     7.40   0.000     160.8795    276.8515
         34  |    213.093   32.27024     6.60   0.000     149.8445    276.3416
         35  |   284.8553   34.34681     8.29   0.000     217.5368    352.1738
         36  |   194.7042   32.59413     5.97   0.000     130.8209    258.5875
         37  |   205.9008   32.36359     6.36   0.000     142.4693    269.3323
         38  |   247.5067   35.85954     6.90   0.000     177.2233    317.7901
         39  |   195.9511    35.7234     5.49   0.000     125.9345    265.9676
         40  |   177.5566   36.33466     4.89   0.000      106.342    248.7712
         41  |   193.8971   40.92453     4.74   0.000     113.6865    274.1077
         42  |   210.5839   38.75595     5.43   0.000     134.6237    286.5442
         43  |   220.6789   36.49495     6.05   0.000     149.1501    292.2077
         44  |   231.7083   41.97287     5.52   0.000      149.443    313.9736
         49  |   209.9916   45.33985     4.63   0.000     121.1271    298.8561
             |
sp_rating_~m |
          0  |  -129.5031   46.48426    -2.79   0.005    -220.6106   -38.39563
          2  |          0  (empty)
          5  |  -145.5522   49.34519    -2.95   0.003     -242.267   -48.83739
          6  |    102.136   47.92712     2.13   0.033      8.20061    196.0715
          7  |  -108.5629   77.19142    -1.41   0.160    -259.8553    42.72946
          8  |  -48.10646   55.09022    -0.87   0.383    -156.0813    59.86839
          9  |  -154.8993   60.01762    -2.58   0.010    -272.5317   -37.26692
         10  |  -164.4971   40.99958    -4.01   0.000    -244.8548    -84.1394
         11  |  -119.0041    48.2081    -2.47   0.014    -213.4902   -24.51795
         12  |  -134.5048   45.53147    -2.95   0.003    -223.7449    -45.2648
         13  |  -120.4456   45.63607    -2.64   0.008    -209.8906    -31.0005
         14  |  -130.0197   47.75084    -2.72   0.006    -223.6097    -36.4298
         15  |   -91.2637   42.37592    -2.15   0.031     -174.319   -8.208423
         16  |  -113.8219   48.17695    -2.36   0.018     -208.247   -19.39684
         17  |  -132.9828   47.86275    -2.78   0.005     -226.792   -39.17352
         18  |  -106.3899    42.9113    -2.48   0.013    -190.4945    -22.2853
         19  |          0  (omitted)
             |
       _cons |   105.9962   119.3847     0.89   0.375    -127.9935    339.9858
-------------+----------------------------------------------------------------
m1_lnvar     |
       _cons |   9.213746   .1070774    86.05   0.000     9.003878    9.423613
-------------+----------------------------------------------------------------
m2_mean      |
excess_int~d |    68.4974   25.83251     2.65   0.008     17.86661    119.1282
excess_int~t |  -8.877126    40.6109    -0.22   0.827    -88.47304    70.71878
      log_at |   -.248643   8.539766    -0.03   0.977    -16.98628    16.48899
market_to_~k |  -24.58543    7.35059    -3.34   0.001    -38.99232   -10.17854
 ppent_by_at |   37.88722   36.12772     1.05   0.294    -32.92182    108.6963
  debt_by_at |    22.1688   28.09272     0.79   0.430    -32.89192    77.22952
  cash_by_at |   -61.8206    76.3447    -0.81   0.418    -211.4535    87.81226
dividend_p~r |   4.329456   15.91257     0.27   0.786    -26.85861    35.51752
     ret_vol |   283.9006   146.1978     1.94   0.052    -2.641726     570.443
    cash_etr |   39.09991   29.29873     1.33   0.182    -18.32455    96.52436
   leveraged |    67.9315   13.70086     4.96   0.000     41.07832    94.78468
    maturity |   2.670182   4.031221     0.66   0.508    -5.230866    10.57123
log_deal_a~d |  -6.669738   7.098249    -0.94   0.347    -20.58205    7.242574
secured_du~y |   56.47671   11.24048     5.02   0.000     34.44578    78.50765
tranche_ty~y |   95.48568   11.09817     8.60   0.000     73.73367    117.2377
tranche_o_~y |   33.01809    11.3528     2.91   0.004     10.76701    55.26917
sponsor_du~y |   73.86617   19.24532     3.84   0.000     36.14603    111.5863
 log_at_post |  -21.69457   8.720014    -2.49   0.013    -38.78549    -4.60366
market_to_~t |   4.250955   10.02724     0.42   0.672    -15.40207    23.90398
ppent_by_~st |  -15.61839   41.43164    -0.38   0.706    -96.82291    65.58613
debt_by_at~t |   81.51114   41.40754     1.97   0.049     .3538577    162.6684
cash_by_at~t |   76.92805   88.90429     0.87   0.387    -97.32116    251.1773
dividend_p~t |  -8.326506    16.9455    -0.49   0.623    -41.53908    24.88607
ret_vol_post |  -185.2605   216.1873    -0.86   0.391    -608.9798    238.4587
cash_etr_p~t |  -39.92509   48.01338    -0.83   0.406    -134.0296    54.17941
             |
        year |
       2015  |  -32.81274   19.83107    -1.65   0.098    -71.68091    6.055436
       2016  |   16.27843   25.66921     0.63   0.526     -34.0323    66.58917
       2017  |  -20.74216   28.54174    -0.73   0.467    -76.68294    35.19861
       2018  |   134.3124   86.65584     1.55   0.121    -35.52993    304.1547
       2019  |   137.4099   84.84808     1.62   0.105    -28.88925    303.7091
       2022  |   154.2085   87.07277     1.77   0.077    -16.45097     324.868
       2023  |   161.9007   90.68724     1.79   0.074    -15.84299    339.6444
             |
       ff_48 |
          2  |  -55.24327   15.00825    -3.68   0.000     -84.6589   -25.82764
          3  |  -65.72056   23.21238    -2.83   0.005     -111.216   -20.22513
          4  |  -15.03308   16.38673    -0.92   0.359    -47.15047    17.08431
          5  |   104.2934   28.81505     3.62   0.000     47.81694    160.7698
          6  |  -53.84891   25.21608    -2.14   0.033    -103.2715   -4.426306
          7  |   101.7048    16.5275     6.15   0.000     69.31154    134.0981
          8  |   111.8021   24.02281     4.65   0.000      64.7183     158.886
          9  |   10.69172   16.00704     0.67   0.504    -20.68151    42.06495
         10  |   4.171759   16.40336     0.25   0.799    -27.97824    36.32176
         11  |   15.64973   14.59453     1.07   0.284    -12.95501    44.25448
         12  |  -2.652413   15.90855    -0.17   0.868    -33.83261    28.52778
         13  |   17.34949   16.38259     1.06   0.290    -14.75979    49.45878
         14  |  -2.350683   14.26145    -0.16   0.869    -30.30262    25.60125
         15  |  -25.73556   24.47851    -1.05   0.293    -73.71255    22.24143
         16  |  -82.21918   22.10431    -3.72   0.000    -125.5428   -38.89552
         17  |   -16.0862   24.92588    -0.65   0.519    -64.94002    32.76762
         18  |   14.35717   16.50761     0.87   0.384    -17.99715    46.71149
         19  |  -45.63481   28.29756    -1.61   0.107     -101.097    9.827378
         20  |  -32.25679   32.24505    -1.00   0.317    -95.45593    30.94234
         21  |   43.06406   15.13361     2.85   0.004     13.40274    72.72539
         22  |  -4.148604   19.54558    -0.21   0.832    -42.45724    34.16003
         23  |   19.60244   15.14181     1.29   0.195    -10.07497    49.27985
         24  |  -22.72698   14.22161    -1.60   0.110    -50.60082    5.146862
         25  |    58.8206   31.56993     1.86   0.062    -3.055331    120.6965
         28  |   182.3827   21.29464     8.56   0.000     140.6459    224.1194
         29  |   106.4879   14.64536     7.27   0.000     77.78355    135.1923
         30  |   17.57567   17.31145     1.02   0.310    -16.35414    51.50548
         32  |   3.076665   11.68543     0.26   0.792    -19.82636    25.97969
         33  |   26.24661   20.92255     1.25   0.210    -14.76083    67.25405
         34  |   -28.3014   14.52815    -1.95   0.051    -56.77604    .1732464
         35  |   -37.9651   17.76228    -2.14   0.033    -72.77854   -3.151674
         36  |    24.1234   15.52617     1.55   0.120     -6.30733    54.55412
         37  |   20.73469   15.24721     1.36   0.174     -9.14928    50.61867
         38  |   23.46538   14.63369     1.60   0.109    -5.216137    52.14689
         39  |  -20.69087   13.56576    -1.53   0.127    -47.27926    5.897526
         40  |  -6.840674   17.58701    -0.39   0.697    -41.31059    27.62924
         41  |  -4.691579   15.02596    -0.31   0.755    -34.14192    24.75876
         42  |   4.158743   13.26986     0.31   0.754     -21.8497    30.16719
         43  |   18.41012   11.77383     1.56   0.118    -4.666153     41.4864
         44  |          0  (omitted)
             |
sp_rating_~m |
          0  |   125.7088    32.2567     3.90   0.000     62.48683    188.9308
          1  |   392.3985   42.35339     9.26   0.000     309.3874    475.4096
          2  |          0  (empty)
          4  |   284.7139    63.5554     4.48   0.000     160.1476    409.2802
          5  |   325.4402   120.3104     2.71   0.007     89.63621    561.2442
          6  |   181.6181   124.1049     1.46   0.143    -61.62295    424.8592
          7  |   212.9425   40.18015     5.30   0.000     134.1908    291.6941
          8  |   130.2973   32.97467     3.95   0.000     65.66813    194.9265
          9  |   123.7855   32.75821     3.78   0.000     59.58058    187.9904
         10  |   102.0949   33.12187     3.08   0.002     37.17719    167.0125
         11  |   74.35624   31.19258     2.38   0.017     13.21991    135.4926
         12  |    81.9995   30.75018     2.67   0.008     21.73025    142.2687
         13  |   95.40525   37.41817     2.55   0.011     22.06698    168.7435
         14  |   121.8125   34.76504     3.50   0.000     53.67427    189.9507
         15  |    126.163   38.50202     3.28   0.001      50.7004    201.6256
         16  |   94.65651   30.53531     3.10   0.002     34.80841    154.5046
         17  |          0  (omitted)
             |
       _cons |  -6.874316   69.29616    -0.10   0.921    -142.6923    128.9437
-------------+----------------------------------------------------------------
m2_lnvar     |
       _cons |   9.625994   .0766319   125.61   0.000     9.475798    9.776189
------------------------------------------------------------------------------

. test [m1_mean]excess_interest_scaled_post = [m2_mean]excess_interest_scaled_p
> ost

 ( 1)  [m1_mean]excess_interest_scaled_post -
       [m2_mean]excess_interest_scaled_post = 0

           chi2(  1) =    2.31
         Prob > chi2 =    0.1283

.         
. * save the results (esttab) using tabdir
. esttab m1 m2 using "$tabdir/hp_finconstr_cross.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant keep( exces
> s_interest_scaled excess_interest_scaled_post)
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/hp_finconstr_cross.tex)

.         
. 
end of do-file
