
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: 60-user network, expiring 14 Aug 2026
Serial number: 401909327398
  Licensed to: Zirui Song
               MIT Sloan

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do AN_6_FalsificationTests.do 

. /***********
>         Globals for Paths
>         ***********/
. 
. *** Change repodir and overleafdir paths for different users
. global repodir "/Users/zrsong/MIT Dropbox/Zirui Song/Research Projects/MPS_In
> terest Deductibility and Debt Contracting"

. global overleafdir "/Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax In
> cidence and Loan Contract Terms"

. 
. global datadir "$repodir/3. Data"

. global rawdir "$datadir/Raw"

. global cleandir "$datadir/Processed"

. 
. global tabdir "$overleafdir/Tables"

. global figdir "$overleafdir/Figures"

. 
. global codedir "$repodir/4. Code/Replication"

. 
. /***********
>         Falsification Tests
>         ***********/
. 
. import delimited "$cleandir/tranche_level_ds_compa_all.csv", clear
(encoding automatically selected: ISO-8859-1)
(140 vars, 4,371 obs)

. 
. keep if year <= 2017
(2,459 observations deleted)

. 
. drop post

. gen post = 1 if year >= 2014

. replace post = 0 if post == .
(0 real changes made)

. rename excess_interest_30 treated

. rename excess_interest_loss treated_loss

. gen treated_post = treated * post

. gen treated_loss_post = treated_loss * post

. 
. do "$codedir/AN_StataFunctions.do"

. *** Functions to Clean and Label Data ***
. 
. *** clean ratings
. capture program drop clean_rating

. program define clean_rating
  1.         rename currentratingsymbol sp_rating
  2.         replace sp_rating = subinstr(sp_rating, " prelim", "", .) 
  3. 
.         gen sp_rating_num = .
  4.         replace sp_rating_num = 21 if sp_rating == "AAA"
  5.         * replace sp_rating_num = 21 if sp_rating == "AA+" (only 1 obs)
.         replace sp_rating_num = 20 if sp_rating == "AA" | sp_rating == "ilAA"
>  | sp_rating == "AA+"
  6.         replace sp_rating_num = 19 if sp_rating == "AA-"
  7.         replace sp_rating_num = 18 if sp_rating == "A+"
  8.         replace sp_rating_num = 17 if sp_rating == "A"
  9.         replace sp_rating_num = 16 if sp_rating == "A-" | sp_rating == "A-
> 1+" | sp_rating == "A-2" | sp_rating == "A-3"
 10.         replace sp_rating_num = 15 if sp_rating == "BBB+"
 11.         replace sp_rating_num = 14 if sp_rating == "BBB"
 12.         replace sp_rating_num = 13 if sp_rating == "BBB-"
 13.         replace sp_rating_num = 12 if sp_rating == "BB+"
 14.         replace sp_rating_num = 11 if sp_rating == "BB"
 15.         replace sp_rating_num = 10 if sp_rating == "BB-"
 16.         replace sp_rating_num = 9  if sp_rating == "B+"
 17.         replace sp_rating_num = 8  if sp_rating == "B"
 18.         replace sp_rating_num = 7  if sp_rating == "B-"
 19.         replace sp_rating_num = 6  if sp_rating == "CCC+"
 20.         replace sp_rating_num = 5  if sp_rating == "CCC"
 21.         replace sp_rating_num = 4  if sp_rating == "CCC-"
 22.         replace sp_rating_num = 3  if sp_rating == "CC"
 23.         replace sp_rating_num = 2  if sp_rating == "C"
 24.         replace sp_rating_num = 1  if sp_rating == "D"
 25.         replace sp_rating_num = 0 if sp_rating_num == .
 26.         
.         gen not_rated = 1 if sp_rating_num == 0
 27.         replace not_rated = 0 if not_rated == .
 28. 
.         label var sp_rating_num "S\&P Rating"
 29.         label var not_rated "Not Rated"
 30. end

. 
. *** clean variables
. capture program drop clean_variables 

. program define clean_variables
  1.         * gen logged bps
.         gen log_margin_bps = log(margin_bps)
  2.         gen log_at = log(at)
  3.         gen log_deal_amount_converted = log(deal_amount_converted)
  4. 
.         local controls "log_at market_to_book ppent_by_at debt_by_at cash_by_
> at dividend_payer ret_vol cash_etr"
  5.         local deal_controls "leveraged maturity log_deal_amount_converted 
> secured_dummy tranche_type_dummy tranche_o_a_dummy sponsor_dummy"
  6. 
.         * generate interaction between controls and post
.         foreach var in `controls' {
  7.                 gen `var'_post = `var' * post
  8.                 gen `var'_treated = `var' * treated
  9.                 gen `var'_treated_loss = `var' * treated_loss
 10.         }
 11.         foreach var in `deal_controls' {
 12.                 gen `var'_post = `var' * post
 13.         }
 14. 
.         local controls_post "log_at_post market_to_book_post ppent_by_at_post
>  debt_by_at_post cash_by_at_post  dividend_payer_post ret_vol_post cash_etr_p
> ost"
 15.         local deal_controls_post "leveraged_post maturity_post log_deal_am
> ount_converted_post secured_dummy_post tranche_type_dummy_post tranche_o_a_du
> mmy_post sponsor_dummy_post"
 16. 
.         local controls_treated "log_at_treated market_to_book_treated ppent_b
> y_at_treated debt_by_at_treated cash_by_at_treated dividend_payer_treated ret
> _vol_treated cash_etr_treated"
 17.         local controls_treated_loss "log_at_treated_loss market_to_book_tr
> eated_loss ppent_by_at_treated_loss debt_by_at_treated_loss cash_by_at_treate
> d_loss dividend_payer_treated_loss ret_vol_treated_loss cash_etr_treated_loss
> "
 18. 
.         * winsorize at 1% and 99%
.         foreach var in margin_bps log_margin_bps `controls' `deal_controls' `
> controls_post' `controls_treated' `controls_treated_loss' {
 19.                 winsor2 `var', cuts(1 99) replace
 20.         }
 21.         * for each _sweep variable, replace missing to zero
.         foreach var of varlist *_sweep {
 22.                 replace `var' = 0 if `var' == .
 23.         }
 24. 
.         * label controls and treated, post, and treated_post
.         label variable log_at "Ln(Total Assets)"
 25.         label variable cash_flows_by_at "Cash Flows / Assets"
 26.         label variable market_to_book "Market to Book Ratio"
 27.         label variable ppent_by_at "PP\&E / Assets"
 28.         label variable debt_by_at "Debt / Assets"
 29.         label variable cash_by_at "Cash / Assets"
 30.         label variable sales_growth "Sales Growth"
 31.         label variable dividend_payer "Dividend Payer"
 32.         label variable z_score "Z-Score"
 33.         label variable nol "Net Operating Loss"
 34.         label variable ret_buy_and_hold "Buy and Hold Return"
 35.         label variable ret_vol "Return Volatility"
 36.         label variable cash_etr "Cash ETR"
 37.         label variable roa "Return on Assets"
 38.         label variable cashflow_byat "Cash Flow / Assets"
 39. 
.         label variable leveraged "Leveraged"
 40.         label variable maturity "Maturity (Years)"
 41.         label variable deal_amount_converted "Loan Amount ($Million)"
 42.         label variable log_deal_amount_converted "Ln(Loan Amount)"
 43.         label variable margin_bps "Interest Spread (Basis Points)"
 44.         label variable number_of_lead_arrangers "Number of Lead Arrangers"
 45.         label variable secured_dummy "Secured"
 46.         label variable tranche_type_dummy "Term Loan"
 47.         label variable tranche_o_a_dummy "Origination"
 48.         label variable sponsor_dummy "Sponsored"
 49.         label variable total_asset "Assets ($Billion)"
 50. 
.         label variable treated "Excess Interest (30\% Rule)"
 51.         label variable post "Post"
 52.         label variable treated_post "Excess Interest (30\% Rule) x Post"
 53.         label variable treated_loss "Excess Interest (Loss)"
 54.         label variable treated_loss_post "Excess Interest (Loss) x Post"
 55. end

. 
. capture program drop generate_treat_vars

. program define generate_treat_vars
  1.         
.         gen treated_all = 1 if treated == 1 | treated_loss == 1
  2.         replace treated_all = 0 if treated_all == .
  3.         
.         * generate continuous measures
.         gen excess_interest_scaled_post = excess_interest_scaled * post
  4. 
.         *** quartile splits
.         gen ie_excess_q4 = 1 if excess_interest_scaled > 0.89999
  5.         gen ie_excess_q3 = 1 if inrange(excess_interest_scaled, 0.6, 0.899
> 99)
  6.         gen ie_excess_q2 = 1 if inrange(excess_interest_scaled, 0.300001, 
> 0.59999)
  7.         gen ie_excess_q1 = 1 if inrange(excess_interest_scaled, 0.00001, 0
> .3)
  8. 
.         forv i = 1/4 {
  9.                 replace ie_excess_q`i' = 0 if excess_interest_scaled == 0
 10.                 replace ie_excess_q`i' = 0 if ie_excess_q`i' == .
 11.         }
 12. 
.         forv i = 1/4 {
 13.                 gen ie_excess_q`i'_post = ie_excess_q`i' * post
 14.         }
 15. 
.         label var excess_interest_scaled "Excess Interest Expense (Scaled)"
 16.         label var excess_interest_scaled_post "Excess Interest Expense (Sc
> aled) x Post"
 17.         label var ie_excess_q1 "Excess Interest Expense Q1"
 18.         label var ie_excess_q2 "Excess Interest Expense Q2"
 19.         label var ie_excess_q3 "Excess Interest Expense Q3"
 20.         label var ie_excess_q4 "Excess Interest Expense Q4"
 21.         label var ie_excess_q1_post "Excess Interest Expense Q1 x Post"
 22.         label var ie_excess_q2_post "Excess Interest Expense Q2 x Post"
 23.         label var ie_excess_q3_post "Excess Interest Expense Q3 x Post"
 24.         label var ie_excess_q4_post "Excess Interest Expense Q4 x Post"
 25. 
.         local treat_cts "excess_interest_scaled excess_interest_scaled_post"
 26.         local treat_quartiles "ie_excess_q1 ie_excess_q1_post ie_excess_q2
>  ie_excess_q2_post ie_excess_q3 ie_excess_q3_post ie_excess_q4 ie_excess_q4_p
> ost"
 27.         local treat_vars "treated treated_post treated_loss treated_loss_p
> ost"  
 28. end

. 
end of do-file

. clean_rating
(9 real changes made)
(1,912 missing values generated)
(0 real changes made)
(0 real changes made)
(6 real changes made)
(9 real changes made)
(18 real changes made)
(95 real changes made)
(58 real changes made)
(66 real changes made)
(58 real changes made)
(85 real changes made)
(146 real changes made)
(131 real changes made)
(106 real changes made)
(175 real changes made)
(51 real changes made)
(15 real changes made)
(1 real change made)
(4 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(885 real changes made)
(1,027 missing values generated)
(1,027 real changes made)

. clean_variables
(1,722 real changes made)
(1,600 real changes made)
(1,634 real changes made)
(1,838 real changes made)
(1,677 real changes made)

. generate_treat_vars
(1,378 missing values generated)
(1,378 real changes made)
(1,653 missing values generated)
(1,877 missing values generated)
(1,824 missing values generated)
(1,760 missing values generated)
(1,378 real changes made)
(382 real changes made)
(1,378 real changes made)
(446 real changes made)
(1,378 real changes made)
(499 real changes made)
(1,378 real changes made)
(275 real changes made)

. 
. *** relabel variables 
. 
. label variable post "Post2014"

. label variable treated_post "Excess Interest (30\% Rule) x Post2014"

. label variable treated_loss_post "Excess Interest (Loss) x Post2014"

. label variable excess_interest_scaled_post "Excess Interest Expense (Scaled) 
> x Post2014"

. label var ie_excess_q1_post "Excess Interest Expense Q1 x Post2014"

. label var ie_excess_q2_post "Excess Interest Expense Q2 x Post2014"

. label var ie_excess_q3_post "Excess Interest Expense Q3 x Post2014"

. label var ie_excess_q4_post "Excess Interest Expense Q4 x Post2014"

.                 
. local controls "log_at market_to_book ppent_by_at debt_by_at cash_by_at divid
> end_payer ret_vol cash_etr"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dum
> my tranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. local controls_post "log_at_post market_to_book_post ppent_by_at_post debt_by
> _at_post cash_by_at_post  dividend_payer_post ret_vol_post cash_etr_post"

. local deal_controls_post "leveraged_post maturity_post log_deal_amount_conver
> ted_post secured_dummy_post tranche_type_dummy_post tranche_o_a_dummy_post sp
> onsor_dummy_post"

.         
. reghdfe margin_bps treated treated_post treated_loss treated_loss_post `deal_
> controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(dropped 1 singleton observations)
(MWFE estimator converged in 7 iterations)
note: treated_post omitted because of collinearity
note: treated_loss_post omitted because of collinearity

HDFE Linear regression                            Number of obs   =      1,911
Absorbing 3 HDFE groups                           F(   9,    817) =      78.32
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5272
                                                  Adj R-squared   =     0.5092
                                                  Within R-sq.    =     0.3978
Number of clusters (gvkey)   =        818         Root MSE        =   132.0353

                                (Std. err. adjusted for 818 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     treated |   28.99026   13.87972     2.09   0.037     1.746153    56.23436
treated_post |          0  (omitted)
treated_loss |   52.39831   13.67967     3.83   0.000     25.54686    79.24976
treated_lo~t |          0  (omitted)
   leveraged |   77.43439   11.83927     6.54   0.000     54.19542    100.6734
    maturity |   11.85048   3.662974     3.24   0.001     4.660533    19.04043
log_deal_a~d |  -29.00127   3.544782    -8.18   0.000    -35.95922   -22.04332
secured_du~y |   64.24241    9.33925     6.88   0.000     45.91066    82.57416
tranche_ty~y |   94.88861    7.34081    12.93   0.000     80.47954    109.2977
tranche_o_~y |   12.08702   7.561744     1.60   0.110    -2.755712    26.92976
sponsor_du~y |   87.92793   11.57581     7.60   0.000      65.2061    110.6498
       _cons |   222.6829   31.24138     7.13   0.000     161.3601    284.0058
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         4           0           4     |
         ff_48 |        43           1          42     |
 sp_rating_num |        17           1          16    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m1

. reghdfe margin_bps treated treated_post treated_loss treated_loss_post `contr
> ols' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(dropped 1 singleton observations)
(MWFE estimator converged in 7 iterations)
note: treated_post omitted because of collinearity
note: treated_loss_post omitted because of collinearity

HDFE Linear regression                            Number of obs   =      1,911
Absorbing 3 HDFE groups                           F(  17,    817) =      44.38
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5350
                                                  Adj R-squared   =     0.5152
                                                  Within R-sq.    =     0.4078
Number of clusters (gvkey)   =        818         Root MSE        =   131.2177

                                (Std. err. adjusted for 818 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     treated |   12.90021   15.40002     0.84   0.402    -17.32805    43.12847
treated_post |          0  (omitted)
treated_loss |   63.28188   15.85937     3.99   0.000     32.15198    94.41179
treated_lo~t |          0  (omitted)
      log_at |  -4.703905    4.16404    -1.13   0.259    -12.87738    3.469571
market_to_~k |  -2.966155    5.61186    -0.53   0.597    -13.98152    8.049207
 ppent_by_at |  -9.801925   23.20855    -0.42   0.673    -55.35734    35.75349
  debt_by_at |   52.64313    26.5994     1.98   0.048     .4319033    104.8543
  cash_by_at |   18.42012   40.36118     0.46   0.648    -60.80371    97.64395
dividend_p~r |   11.93333   8.869412     1.35   0.179    -5.476189    29.34285
     ret_vol |    273.715   110.2489     2.48   0.013     57.31056    490.1194
    cash_etr |   21.75281   11.23909     1.94   0.053    -.3080778    43.81371
   leveraged |   73.60915   12.28735     5.99   0.000     49.49065    97.72765
    maturity |    12.1727   3.729399     3.26   0.001     4.852366    19.49303
log_deal_a~d |  -26.56714   4.138386    -6.42   0.000    -34.69026   -18.44402
secured_du~y |   61.29374   9.314089     6.58   0.000     43.01138    79.57611
tranche_ty~y |   93.97227   7.259715    12.94   0.000     79.72238    108.2222
tranche_o_~y |   12.22172   7.684086     1.59   0.112    -2.861154     27.3046
sponsor_du~y |   89.61661   11.74192     7.63   0.000     66.56873    112.6645
       _cons |   199.7987   44.77935     4.46   0.000     111.9026    287.6948
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         4           0           4     |
         ff_48 |        43           1          42     |
 sp_rating_num |        17           1          16    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m2

. reghdfe margin_bps treated treated_post treated_loss treated_loss_post `contr
> ols' `controls_post' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cl
> uster gvkey)
(dropped 1 singleton observations)
(MWFE estimator converged in 7 iterations)
note: treated_post omitted because of collinearity
note: treated_loss_post omitted because of collinearity
note: log_at_post omitted because of collinearity
note: market_to_book_post omitted because of collinearity
note: ppent_by_at_post omitted because of collinearity
note: debt_by_at_post omitted because of collinearity
note: cash_by_at_post omitted because of collinearity
note: dividend_payer_post omitted because of collinearity
note: ret_vol_post omitted because of collinearity
note: cash_etr_post omitted because of collinearity

HDFE Linear regression                            Number of obs   =      1,911
Absorbing 3 HDFE groups                           F(  17,    817) =      44.38
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5350
                                                  Adj R-squared   =     0.5152
                                                  Within R-sq.    =     0.4078
Number of clusters (gvkey)   =        818         Root MSE        =   131.2177

                                (Std. err. adjusted for 818 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     treated |   12.90021   15.40002     0.84   0.402    -17.32805    43.12847
treated_post |          0  (omitted)
treated_loss |   63.28188   15.85937     3.99   0.000     32.15198    94.41179
treated_lo~t |          0  (omitted)
      log_at |  -4.703905    4.16404    -1.13   0.259    -12.87738    3.469571
market_to_~k |  -2.966155    5.61186    -0.53   0.597    -13.98152    8.049207
 ppent_by_at |  -9.801925   23.20855    -0.42   0.673    -55.35734    35.75349
  debt_by_at |   52.64313    26.5994     1.98   0.048     .4319033    104.8543
  cash_by_at |   18.42012   40.36118     0.46   0.648    -60.80371    97.64395
dividend_p~r |   11.93333   8.869412     1.35   0.179    -5.476189    29.34285
     ret_vol |    273.715   110.2489     2.48   0.013     57.31056    490.1194
    cash_etr |   21.75281   11.23909     1.94   0.053    -.3080778    43.81371
 log_at_post |          0  (omitted)
market_to_~t |          0  (omitted)
ppent_by_~st |          0  (omitted)
debt_by_at~t |          0  (omitted)
cash_by_at~t |          0  (omitted)
dividend_p~t |          0  (omitted)
ret_vol_post |          0  (omitted)
cash_etr_p~t |          0  (omitted)
   leveraged |   73.60915   12.28735     5.99   0.000     49.49065    97.72765
    maturity |    12.1727   3.729399     3.26   0.001     4.852366    19.49303
log_deal_a~d |  -26.56714   4.138386    -6.42   0.000    -34.69026   -18.44402
secured_du~y |   61.29374   9.314089     6.58   0.000     43.01138    79.57611
tranche_ty~y |   93.97227   7.259715    12.94   0.000     79.72238    108.2222
tranche_o_~y |   12.22172   7.684086     1.59   0.112    -2.861154     27.3046
sponsor_du~y |   89.61661   11.74192     7.63   0.000     66.56873    112.6645
       _cons |   199.7987   44.77935     4.46   0.000     111.9026    287.6948
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         4           0           4     |
         ff_48 |        43           1          42     |
 sp_rating_num |        17           1          16    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m3

. 
. * save the results (esttab) using tabdir
. esttab m1 m2 m3 using "$tabdir/margin_did_both_rule_falsification.tex", repla
> ce ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant drop(_cons 
> `controls_post')
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_did_both_rule_falsification.tex)

. est clear

. 
. *** Table 9: Continuous Measure
. 
. reghdfe margin_bps excess_interest_scaled excess_interest_scaled_post `contro
> ls' `controls_post' `deal_controls', absorb(year ff_48 sp_rating_num) vce(clu
> ster gvkey)
(dropped 1 singleton observations)
(MWFE estimator converged in 7 iterations)
note: excess_interest_scaled_post omitted because of collinearity
note: log_at_post omitted because of collinearity
note: market_to_book_post omitted because of collinearity
note: ppent_by_at_post omitted because of collinearity
note: debt_by_at_post omitted because of collinearity
note: cash_by_at_post omitted because of collinearity
note: dividend_payer_post omitted because of collinearity
note: ret_vol_post omitted because of collinearity
note: cash_etr_post omitted because of collinearity

HDFE Linear regression                            Number of obs   =      1,911
Absorbing 3 HDFE groups                           F(  16,    817) =      48.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5376
                                                  Adj R-squared   =     0.5182
                                                  Within R-sq.    =     0.4111
Number of clusters (gvkey)   =        818         Root MSE        =   130.8183

                                (Std. err. adjusted for 818 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
excess_int~d |   84.51162   17.20018     4.91   0.000     50.74988    118.2734
excess_int~t |          0  (omitted)
      log_at |  -4.296456   4.165832    -1.03   0.303    -12.47345    3.880538
market_to_~k |  -3.153228   5.609456    -0.56   0.574    -14.16387    7.857415
 ppent_by_at |   -5.51901   23.01521    -0.24   0.811    -50.69492    39.65689
  debt_by_at |   57.33478   24.76375     2.32   0.021      8.72671    105.9429
  cash_by_at |   16.10229    40.3035     0.40   0.690    -63.00832    95.21291
dividend_p~r |   12.03464   8.878935     1.36   0.176    -5.393576    29.46285
     ret_vol |   235.9005   109.9134     2.15   0.032     20.15455    451.6464
    cash_etr |   17.30739   10.32274     1.68   0.094    -2.954826     37.5696
 log_at_post |          0  (omitted)
market_to_~t |          0  (omitted)
ppent_by_~st |          0  (omitted)
debt_by_at~t |          0  (omitted)
cash_by_at~t |          0  (omitted)
dividend_p~t |          0  (omitted)
ret_vol_post |          0  (omitted)
cash_etr_p~t |          0  (omitted)
   leveraged |   74.94569   12.11797     6.18   0.000     51.15967    98.73171
    maturity |   12.52902   3.702448     3.38   0.001     5.261591    19.79645
log_deal_a~d |   -26.3317   4.212475    -6.25   0.000    -34.60025   -18.06316
secured_du~y |   60.27107    9.25598     6.51   0.000     42.10276    78.43937
tranche_ty~y |   93.98319    7.21966    13.02   0.000     79.81192    108.1545
tranche_o_~y |   11.67237   7.615915     1.53   0.126    -3.276697    26.62143
sponsor_du~y |   89.87325   11.64251     7.72   0.000     67.02049     112.726
       _cons |   195.2121   43.54901     4.48   0.000      109.731    280.6932
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         4           0           4     |
         ff_48 |        43           1          42     |
 sp_rating_num |        17           1          16    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m1

. 
. * save the results (esttab) using tabdir
. esttab m1 using "$tabdir/margin_did_both_rule_falsification_cts.tex", replace
>  ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant drop(_cons 
> `controls_post')
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_did_both_rule_falsification_cts.te
> x)

. 
. * save the results (esttab) using tabdir
. esttab m1 using "$tabdir/margin_did_both_rule_falsification_cts_noctrl.tex", 
> replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant drop(_cons 
> `controls_post' `controls' `deal_controls')
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_did_both_rule_falsification_cts_no
> ctrl.tex)

. est clear

. 
. *** Table C5: Quartile Exposure 
. 
. local treat_quartiles "ie_excess_q1 ie_excess_q1_post ie_excess_q2 ie_excess_
> q2_post ie_excess_q3 ie_excess_q3_post ie_excess_q4 ie_excess_q4_post"

. 
. reghdfe margin_bps `treat_quartiles' `controls' `controls_post' `deal_control
> s', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(dropped 1 singleton observations)
(MWFE estimator converged in 7 iterations)
note: ie_excess_q1_post omitted because of collinearity
note: ie_excess_q2_post omitted because of collinearity
note: ie_excess_q3_post omitted because of collinearity
note: ie_excess_q4_post omitted because of collinearity
note: log_at_post omitted because of collinearity
note: market_to_book_post omitted because of collinearity
note: ppent_by_at_post omitted because of collinearity
note: debt_by_at_post omitted because of collinearity
note: cash_by_at_post omitted because of collinearity
note: dividend_payer_post omitted because of collinearity
note: ret_vol_post omitted because of collinearity
note: cash_etr_post omitted because of collinearity

HDFE Linear regression                            Number of obs   =      1,911
Absorbing 3 HDFE groups                           F(  19,    817) =      41.44
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5388
                                                  Adj R-squared   =     0.5186
                                                  Within R-sq.    =     0.4126
Number of clusters (gvkey)   =        818         Root MSE        =   130.7565

                                (Std. err. adjusted for 818 clusters in gvkey)
------------------------------------------------------------------------------
             |               Robust
  margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
ie_excess_q1 |  -13.67716   18.04506    -0.76   0.449     -49.0973    21.74298
ie_ex~1_post |          0  (omitted)
ie_excess_q2 |  -2.462684   23.10781    -0.11   0.915    -47.82036    42.89499
ie_ex~2_post |          0  (omitted)
ie_excess_q3 |   75.79253   30.13489     2.52   0.012     16.64161    134.9435
ie_ex~3_post |          0  (omitted)
ie_excess_q4 |   78.92085   17.62726     4.48   0.000     44.32081    113.5209
ie_ex~4_post |          0  (omitted)
      log_at |   -4.03559   4.240196    -0.95   0.342    -12.35855    4.287373
market_to_~k |   -4.00289   5.691119    -0.70   0.482    -15.17383    7.168047
 ppent_by_at |   -6.27551   23.19962    -0.27   0.787    -51.81339    39.26237
  debt_by_at |   72.43302   25.95432     2.79   0.005     21.48801     123.378
  cash_by_at |   16.69868   40.06051     0.42   0.677    -61.93496    95.33232
dividend_p~r |   9.762905   8.958823     1.09   0.276    -7.822117    27.34793
     ret_vol |   239.7078   109.4176     2.19   0.029     24.93514    454.4804
    cash_etr |   15.05283   11.05619     1.36   0.174    -6.649062    36.75471
 log_at_post |          0  (omitted)
market_to_~t |          0  (omitted)
ppent_by_~st |          0  (omitted)
debt_by_at~t |          0  (omitted)
cash_by_at~t |          0  (omitted)
dividend_p~t |          0  (omitted)
ret_vol_post |          0  (omitted)
cash_etr_p~t |          0  (omitted)
   leveraged |   76.00015   12.11635     6.27   0.000     52.21731    99.78299
    maturity |   12.82718   3.709701     3.46   0.001     5.545516    20.10885
log_deal_a~d |  -27.39408   4.216687    -6.50   0.000     -35.6709   -19.11726
secured_du~y |   60.05796   9.299278     6.46   0.000     41.80467    78.31125
tranche_ty~y |   93.85984   7.188681    13.06   0.000     79.74938    107.9703
tranche_o_~y |   11.77708   7.571091     1.56   0.120    -3.084001    26.63816
sponsor_du~y |   90.11448   11.74679     7.67   0.000     67.05703    113.1719
       _cons |   200.1355   44.18287     4.53   0.000     113.4102    286.8608
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         4           0           4     |
         ff_48 |        43           1          42     |
 sp_rating_num |        17           1          16    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m1

. 
. * save the results (esttab) using tabdir
. esttab m1 using "$tabdir/margin_did_both_rule_falsification_all.tex", replace
>  ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant drop(_cons 
> `controls_post')
(output written to /Users/zrsong/MIT Dropbox/Zirui Song/Apps/Overleaf/Tax Incid
> ence and Loan Contract Terms/Tables/margin_did_both_rule_falsification_all.te
> x)

. 
end of do-file
