-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/zrsong/Dropbox (MIT)/Research Projects/MPS_Interest Deductibili
> ty and Debt Contracting/4. Code/Dealscan_Analysis.log
  log type:  text
 opened on:  26 Dec 2024, 15:25:23

. 
. use "../3. Data/Processed/tranche_level_ds_compa.dta", clear

. 
. if "`c(hostname)'" == "mphill-surface4" {
. global overleaf_dir "C:\Users\mphill\Dropbox\Apps\Overleaf\M&A Debt\Tables"
. global fig_dir "C:\Users\mphill\Dropbox\Apps\Overleaf\M&A Debt\Figures"
.         
. }

. 
. global overleaf_dir "/Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables"

. global fig_dir "/Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Figures"

. 
. keep if year >= 2014
(0 observations deleted)

. 
. * Check if the directory exists, if not create it
. cap mkdir "$overleaf_dir"

. 
. * gen logged bps
. gen log_margin_bps = log(margin_bps)

. 
. * list of controls in regression 
. gen log_at = log(at)

. gen log_deal_amount_converted = log(deal_amount_converted)

. 
. local controls "log_at cash_flows_by_at market_to_book ppent_by_at debt_by_at cas
> h_by_at sales_growth dividend_payer nol ret_vol"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dummy t
> ranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. 
. * generate interaction between controls and post
. foreach var in `controls' {
  2.     gen `var'_post = `var' * post
  3.         gen `var'_treated = `var' * treated
  4.         gen `var'_treated_loss = `var' * treated_loss
  5. }

. 
. local controls_post "log_at_post cash_flows_by_at_post market_to_book_post ppent_
> by_at_post debt_by_at_post cash_by_at_post sales_growth_post dividend_payer_post 
> nol_post ret_vol_post"

. local controls_treated "log_at_treated cash_flows_by_at_treated market_to_book_tr
> eated ppent_by_at_treated debt_by_at_treated cash_by_at_treated sales_growth_trea
> ted dividend_payer_treated nol_treated ret_vol_treated"

. local controls_treated_loss "log_at_treated_loss cash_flows_by_at_treated_loss ma
> rket_to_book_treated_loss ppent_by_at_treated_loss debt_by_at_treated_loss cash_b
> y_at_treated_loss sales_growth_treated_loss dividend_payer_treated_loss nol_treat
> ed_loss ret_vol_treated_loss"

. 
. * winsorize at 1% and 99%
. foreach var in margin_bps log_margin_bps `controls' `deal_controls' `controls_pos
> t' `controls_treated' `controls_treated_loss' {
  2.     winsor2 `var', cuts(1 99) replace
  3. }

. 
. * label controls and treated, post, and treated_post
. label variable log_at "Log Total Assets"

. label variable cash_flows_by_at "Cash Flows / Assets"

. label variable market_to_book "Market to Book Ratio"

. label variable ppent_by_at "PP\&E / Assets"

. label variable debt_by_at "Debt / Assets"

. label variable cash_by_at "Cash / Assets"

. label variable sales_growth "Sales Growth"

. label variable dividend_payer "Dividend Payer"

. label variable z_score "Z-Score"

. label variable nol "Net Operating Loss"

. label variable ret_buy_and_hold "Buy and Hold Return"

. label variable ret_vol "Return Volatility"

. 
. label variable leveraged "Leveraged"

. label variable maturity "Maturity"

. label variable log_deal_amount_converted "Log Loan Amount"

. label variable secured_dummy "Secured"

. label variable tranche_type_dummy "Tranche Type"

. label variable tranche_o_a_dummy "Origination"

. label variable sponsor_dummy "Sponsored"

. 
. label variable treated "Treated (30\% rule)"

. label variable post "Post"

. label variable treated_post "Treated (30\% rule) x Post"

. label variable treated_loss "Treated (Loss rule)"

. label variable treated_loss_post "Treated (Loss rule) x Post"

. 
. label variable treated_prev_3yr "Treated (30\% rule, Previous 3 Years)"

. label variable treated_prev_3yr_post "Treated (30\% rule, Previous 3 Years) x Pos
> t"

. label variable treated_loss_prev_3yr "Treated (Loss rule, Previous 3 Years)"

. label variable treated_loss_prev_3yr_post "Treated (Loss rule, Previous 3 Years) 
> x Post"

. label variable treated_prev_5yr "Treated (30\% rule, Previous 5 Years)"

. label variable treated_prev_5yr_post "Treated (30\% rule, Previous 5 Years) x Pos
> t"

. label variable treated_loss_prev_5yr "Treated (Loss rule, Previous 5 Years)"

. label variable treated_loss_prev_5yr_post "Treated (Loss rule, Previous 5 Years) 
> x Post"

. 
. save "../3. Data/Processed/tranche_level_ds_compa_wlabel.dta", replace
file ../3. Data/Processed/tranche_level_ds_compa_wlabel.dta saved

. 
. /***********
>         Bring in SP Ratings
>         ***********/
.         
.         use "../3. Data/Processed/tranche_level_ds_compa_wlabel.dta", clear

. 
. rename currentratingsymbol sp_rating

. replace sp_rating = subinstr(sp_rating, " prelim", "", .) 
(19 real changes made)

. 
. gen sp_rating_num = .
(4,712 missing values generated)

. replace sp_rating_num = 21 if sp_rating == "AAA"
(0 real changes made)

. * replace sp_rating_num = 21 if sp_rating == "AA+" (only 1 obs)
. replace sp_rating_num = 20 if sp_rating == "AA" | sp_rating == "ilAA" | sp_rating
>  == "AA+"
(5 real changes made)

. replace sp_rating_num = 19 if sp_rating == "AA-"
(11 real changes made)

. replace sp_rating_num = 18 if sp_rating == "A+"
(25 real changes made)

. replace sp_rating_num = 17 if sp_rating == "A"
(36 real changes made)

. replace sp_rating_num = 16 if sp_rating == "A-" | sp_rating == "A-1+" | sp_rating
>  == "A-2" | sp_rating == "A-3"
(353 real changes made)

. replace sp_rating_num = 15 if sp_rating == "BBB+"
(209 real changes made)

. replace sp_rating_num = 14 if sp_rating == "BBB"
(282 real changes made)

. replace sp_rating_num = 13 if sp_rating == "BBB-"
(226 real changes made)

. replace sp_rating_num = 12 if sp_rating == "BB+"
(209 real changes made)

. replace sp_rating_num = 11 if sp_rating == "BB"
(365 real changes made)

. replace sp_rating_num = 10 if sp_rating == "BB-"
(296 real changes made)

. replace sp_rating_num = 9  if sp_rating == "B+"
(268 real changes made)

. replace sp_rating_num = 8  if sp_rating == "B"
(345 real changes made)

. replace sp_rating_num = 7  if sp_rating == "B-"
(114 real changes made)

. replace sp_rating_num = 6  if sp_rating == "CCC+"
(26 real changes made)

. replace sp_rating_num = 5  if sp_rating == "CCC"
(5 real changes made)

. replace sp_rating_num = 4  if sp_rating == "CCC-"
(5 real changes made)

. replace sp_rating_num = 3  if sp_rating == "CC"
(0 real changes made)

. replace sp_rating_num = 2  if sp_rating == "C"
(0 real changes made)

. replace sp_rating_num = 1  if sp_rating == "D"
(11 real changes made)

. replace sp_rating_num = 0 if sp_rating_num == .
(1,921 real changes made)

. 
. local controls "log_at cash_flows_by_at market_to_book ppent_by_at debt_by_at cas
> h_by_at sales_growth dividend_payer nol ret_vol"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dummy t
> ranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. local treat_vars "treated treated_post treated_loss treated_loss_post"  

. 
. gen not_rated = 1 if sp_rating_num == 0
(2,791 missing values generated)

. replace not_rated = 0 if not_rated == .
(2,791 real changes made)

. 
. label var sp_rating_num "S\&P Rating"

. label var not_rated "Not Rated"

. 
. * LHS Sample Composition Tests
. reghdfe not_rated `treat_vars' `controls' `deal_controls', absorb(year ff_48) vce
> (cluster gvkey)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 2 HDFE groups                           F(  21,   1518) =      24.65
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2509
                                                  Adj R-squared   =     0.2383
                                                  Within R-sq.    =     0.1995
Number of clusters (gvkey)   =      1,519         Root MSE        =     0.4289

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
       not_rated | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |  -.0043097   .0544008    -0.08   0.937    -.1110183    .1023989
    treated_post |   .0641923   .0625507     1.03   0.305    -.0585026    .1868872
    treated_loss |    .012831   .0501505     0.26   0.798    -.0855406    .1112025
treated_l~s_post |   .0189655   .0576464     0.33   0.742    -.0941095    .1320405
          log_at |  -.0975185   .0098233    -9.93   0.000    -.1167872   -.0782497
cash_flows_by_at |  -.5664944   .1594373    -3.55   0.000     -.879235   -.2537537
  market_to_book |   .0253763   .0121129     2.09   0.036     .0016165     .049136
     ppent_by_at |    .039707   .0666262     0.60   0.551    -.0909822    .1703962
      debt_by_at |  -.2189071   .0684199    -3.20   0.001    -.3531147   -.0846996
      cash_by_at |   .0435309    .106268     0.41   0.682    -.1649168    .2519787
    sales_growth |  -.0152793   .0397043    -0.38   0.700    -.0931603    .0626017
  dividend_payer |   .0355735   .0278822     1.28   0.202    -.0191183    .0902653
             nol |  -.0750509   .0285611    -2.63   0.009    -.1310742   -.0190275
         ret_vol |  -.0909827   .1993696    -0.46   0.648    -.4820518    .3000864
       leveraged |  -.0050329   .0280469    -0.18   0.858    -.0600477     .049982
        maturity |  -.0163369   .0062267    -2.62   0.009    -.0285507    -.004123
log_deal_amoun~d |  -.0397842   .0113572    -3.50   0.000    -.0620617   -.0175067
   secured_dummy |  -.0378382   .0253174    -1.49   0.135    -.0874991    .0118227
tranche_type_d~y |  -.0336715   .0131467    -2.56   0.011    -.0594592   -.0078839
tranche_o_a_du~y |  -.0105081   .0202737    -0.52   0.604    -.0502755    .0292594
   sponsor_dummy |   .0233556   .0319628     0.73   0.465    -.0393403    .0860515
           _cons |    1.69701   .0907573    18.70   0.000     1.518987    1.875033
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        10           0          10     |
       ff_48 |        49           1          48     |
-----------------------------------------------------+

. estimates store m2

. preserve 

.         drop if sp_rating_num == 0
(1,921 observations deleted)

.         reghdfe sp_rating_num `treat_vars' `controls' `deal_controls', absorb(yea
> r ff_48) vce(cluster gvkey)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =      2,791
Absorbing 2 HDFE groups                           F(  21,    836) =     118.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.7555
                                                  Adj R-squared   =     0.7486
                                                  Within R-sq.    =     0.7121
Number of clusters (gvkey)   =        837         Root MSE        =     1.5449

                                    (Std. err. adjusted for 837 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
   sp_rating_num | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |  -.9388545   .2473527    -3.80   0.000     -1.42436   -.4533491
    treated_post |   .3011527   .2978018     1.01   0.312    -.2833744    .8856798
    treated_loss |   -.642087   .2521851    -2.55   0.011    -1.137077   -.1470967
treated_l~s_post |   .3977811   .3541426     1.12   0.262    -.2973321    1.092894
          log_at |   .8917084   .0697707    12.78   0.000     .7547621    1.028655
cash_flows_by_at |   2.440349   1.184349     2.06   0.040     .1157021    4.764997
  market_to_book |   .4385714   .0801644     5.47   0.000     .2812242    .5959186
     ppent_by_at |  -.8801983   .3255809    -2.70   0.007     -1.51925   -.2411463
      debt_by_at |  -1.767626   .3342704    -5.29   0.000    -2.423733   -1.111518
      cash_by_at |  -1.008354   .6439231    -1.57   0.118     -2.27225    .2555418
    sales_growth |    -.44952   .1879457    -2.39   0.017    -.8184209   -.0806192
  dividend_payer |   .8962489   .1505512     5.95   0.000     .6007461    1.191752
             nol |   -.439464   .1502123    -2.93   0.004    -.7343016   -.1446265
         ret_vol |  -5.571164   1.106033    -5.04   0.000    -7.742091   -3.400237
       leveraged |  -1.538136   .1611122    -9.55   0.000    -1.854368   -1.221904
        maturity |   .0745257   .0346927     2.15   0.032     .0064308    .1426207
log_deal_amoun~d |  -.2908792   .0606078    -4.80   0.000    -.4098405   -.1719178
   secured_dummy |  -.6840772   .1253412    -5.46   0.000    -.9300977   -.4380567
tranche_type_d~y |   .0192219   .0582195     0.33   0.741    -.0950517    .1334955
tranche_o_a_du~y |  -.0660185   .0865303    -0.76   0.446    -.2358607    .1038237
   sponsor_dummy |  -.0279182   .1607683    -0.17   0.862    -.3434751    .2876387
           _cons |   7.463001   .6468148    11.54   0.000     6.193429    8.732572
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        10           0          10     |
       ff_48 |        48           1          47     |
-----------------------------------------------------+

.         estimates store m1

. restore

. * save the results (esttab) using overleaf_dir
. esttab m1 m2 using "$overleaf_dir/sp_rating_robustness.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant keep(`treat_var
> s')
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/sp_rat
> ing_robustness.tex)

. est clear

. 
. save "../3. Data/Processed/tranche_level_ds_compa_wlabel.dta", replace
file ../3. Data/Processed/tranche_level_ds_compa_wlabel.dta saved

. 
. *** DID regressions (30% and Loss Rule: MAIN RESULT TABLE 1) ***
. 
. use "../3. Data/Processed/tranche_level_ds_compa_wlabel.dta", clear

. 
. *drop if year == 2020 | year == 2021
. *keep if leveraged == 1
. 
. gen treated_both = treated * treated_loss

. gen treated_both_post = treated_both * post

. 
. gen treated_eo = 1 if treated == 1 | treated_next_1yr == 1
(3,256 missing values generated)

. replace treated_eo = 0 if treated_eo == .
(3,256 real changes made)

. gen treated_loss_eo = 1 if treated_loss == 1 | treated_loss_next_1yr == 1
(3,194 missing values generated)

. replace treated_loss_eo = 0 if treated_loss_eo == .
(3,194 real changes made)

. 
. gen treated_eo_post = treated_eo * post

. gen treated_loss_eo_post = treated_loss_eo * post

. 
. local controls "log_at cash_flows_by_at market_to_book ppent_by_at debt_by_at cas
> h_by_at sales_growth dividend_payer nol ret_vol"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dummy t
> ranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. local controls_post "log_at_post cash_flows_by_at_post market_to_book_post ppent_
> by_at_post debt_by_at_post cash_by_at_post sales_growth_post dividend_payer_post 
> nol_post ret_vol_post"

. 
. local treated_next_1yr "treated_next_1yr treated_next_1yr_post treated_loss_next_
> 1yr treated_loss_next_1yr_post"

. local treated_next_3yr "treated_next_3yr treated_next_3yr_post treated_loss_next_
> 3yr treated_loss_next_3yr_post"

. local treated_next_5yr "treated_next_5yr treated_next_5yr_post treated_loss_next_
> 5yr treated_loss_next_5yr_post"

. local treated_eo_all "treated_eo treated_eo_post treated_loss_eo treated_loss_eo_
> post"

. 
. reghdfe margin_bps `treated_next_1yr' `controls' `deal_controls' sp_rating_num no
> t_rated, absorb(year ff_48) vce(cluster gvkey) 
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 2 HDFE groups                           F(  23,   1518) =      92.96
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5305
                                                  Adj R-squared   =     0.5224
                                                  Within R-sq.    =     0.4730
Number of clusters (gvkey)   =      1,519         Root MSE        =   123.0773

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
treated_next_1yr |    46.1138   12.92927     3.57   0.000     20.75269    71.47492
treated_next_1~t |  -18.04226    15.2045    -1.19   0.236     -47.8663    11.78179
treated_loss~1yr |   25.60097   11.49085     2.23   0.026     3.061345     48.1406
~s_next_1yr_post |  -34.92017   14.56421    -2.40   0.017    -63.48827   -6.352063
          log_at |   -3.02779   2.500668    -1.21   0.226    -7.932919     1.87734
cash_flows_by_at |  -189.5263    52.9651    -3.58   0.000    -293.4188   -85.63374
  market_to_book |  -.4235584   3.694836    -0.11   0.909    -7.671083    6.823966
     ppent_by_at |   19.77119   15.18106     1.30   0.193    -10.00688    49.54925
      debt_by_at |   35.83208   17.65419     2.03   0.043     1.202894    70.46126
      cash_by_at |   45.46184   24.63376     1.85   0.065    -2.857965    93.78165
    sales_growth |   -8.94893   11.19942    -0.80   0.424    -30.91691    13.01905
  dividend_payer |   6.414059   6.127784     1.05   0.295     -5.60576    18.43388
             nol |  -6.461333   5.820167    -1.11   0.267    -17.87775    4.955087
         ret_vol |   254.0187   55.58029     4.57   0.000     144.9964     363.041
       leveraged |   67.81746   8.035662     8.44   0.000     52.05529    83.57964
        maturity |   6.098918   1.869252     3.26   0.001     2.432328    9.765508
log_deal_amoun~d |  -18.21393   2.767387    -6.58   0.000    -23.64223   -12.78562
   secured_dummy |    65.0158   6.880542     9.45   0.000     51.51942    78.51217
tranche_type_d~y |   73.96772   4.236528    17.46   0.000     65.65766    82.27779
tranche_o_a_du~y |   12.23393   5.888821     2.08   0.038     .6828468    23.78502
   sponsor_dummy |    99.1237   9.117394    10.87   0.000     81.23967    117.0077
   sp_rating_num |  -1.865914   1.646931    -1.13   0.257    -5.096415    1.364587
       not_rated |  -13.59112   20.58281    -0.66   0.509    -53.96488    26.78265
           _cons |   210.9245   34.00348     6.20   0.000     144.2258    277.6233
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        10           0          10     |
       ff_48 |        49           1          48     |
-----------------------------------------------------+

. reghdfe margin_bps `treated_next_1yr' `controls' `controls_post' `deal_controls' 
> sp_rating_num not_rated, absorb(year ff_48) vce(cluster gvkey)  
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 2 HDFE groups                           F(  33,   1518) =      68.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5338
                                                  Adj R-squared   =     0.5248
                                                  Within R-sq.    =     0.4767
Number of clusters (gvkey)   =      1,519         Root MSE        =   122.7743

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
treated_next_1yr |   39.68853   14.18556     2.80   0.005     11.86316     67.5139
treated_next_1~t |  -8.136391   17.42826    -0.47   0.641     -42.3224    26.04962
treated_loss~1yr |    23.0621   11.80223     1.95   0.051    -.0883135    46.21251
~s_next_1yr_post |  -30.24476   15.19429    -1.99   0.047    -60.04879   -.4407288
          log_at |  -1.250211   3.159701    -0.40   0.692    -7.448053     4.94763
cash_flows_by_at |  -313.9088   86.77926    -3.62   0.000    -484.1287   -143.6888
  market_to_book |    6.74352   7.818626     0.86   0.389    -8.592934    22.07997
     ppent_by_at |   18.08612   19.91826     0.91   0.364    -20.98411    57.15635
      debt_by_at |   51.33058   26.54706     1.93   0.053    -.7422326    103.4034
      cash_by_at |   65.74407   38.25014     1.72   0.086    -9.284648    140.7728
    sales_growth |  -8.482047   16.60201    -0.51   0.609    -41.04735    24.08326
  dividend_payer |   13.62651   8.909237     1.53   0.126    -3.849207    31.10223
             nol |  -16.06351   8.391308    -1.91   0.056    -32.52329    .3962778
         ret_vol |   362.0308    95.0259     3.81   0.000     175.6348    548.4268
     log_at_post |  -2.893965   3.248751    -0.89   0.373     -9.26648     3.47855
cash_flows_by~st |   218.7493   111.9327     1.95   0.051    -.8097962    438.3083
market_to_book~t |   -11.9596   8.322783    -1.44   0.151    -28.28497    4.365769
ppent_by_at_post |  -.8932533   21.62989    -0.04   0.967    -43.32088    41.53438
 debt_by_at_post |  -23.91194   30.92142    -0.77   0.439    -84.56517    36.74129
 cash_by_at_post |  -31.30996   49.45201    -0.63   0.527    -128.3115    65.69154
sales_growth_p~t |  -4.430299   22.80523    -0.19   0.846     -49.1634     40.3028
dividend_payer~t |  -13.42843   10.98858    -1.22   0.222    -34.98283    8.125972
        nol_post |   16.82046   9.671241     1.74   0.082    -2.149954    35.79087
    ret_vol_post |  -171.9397   112.2875    -1.53   0.126    -392.1947    48.31536
       leveraged |   68.50425   7.715073     8.88   0.000     53.37092    83.63758
        maturity |   6.013477   1.879061     3.20   0.001     2.327646    9.699308
log_deal_amoun~d |  -17.75118   2.814157    -6.31   0.000    -23.27123   -12.23114
   secured_dummy |    64.7072   6.724768     9.62   0.000     51.51637    77.89802
tranche_type_d~y |   73.91801   4.262444    17.34   0.000     65.55711    82.27891
tranche_o_a_du~y |    12.0219   5.776639     2.08   0.038      .690863    23.35294
   sponsor_dummy |     98.915   9.105575    10.86   0.000     81.05416    116.7758
   sp_rating_num |  -1.805624   1.636946    -1.10   0.270     -5.01654    1.405291
       not_rated |  -12.49408   20.40735    -0.61   0.540    -52.52368    27.53551
           _cons |   206.1433   33.70437     6.12   0.000     140.0312    272.2553
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        10           0          10     |
       ff_48 |        49           1          48     |
-----------------------------------------------------+

. 
. reghdfe margin_bps treated treated_post treated_loss treated_loss_post `controls'
>  `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  21,   1518) =      72.29
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5454
                                                  Adj R-squared   =     0.5359
                                                  Within R-sq.    =     0.3871
Number of clusters (gvkey)   =      1,519         Root MSE        =   121.3228

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   10.25475   12.75522     0.80   0.422    -14.76498    35.27448
    treated_post |   7.264098   15.85953     0.46   0.647    -23.84482    38.37302
    treated_loss |   43.01848   12.27935     3.50   0.000      18.9322    67.10476
treated_l~s_post |  -45.48211   15.87455    -2.87   0.004    -76.62048   -14.34374
          log_at |  -5.239352   2.509111    -2.09   0.037    -10.16104   -.3176598
cash_flows_by_at |  -172.7848   55.57297    -3.11   0.002    -281.7927   -63.77687
  market_to_book |   -1.58417   3.591835    -0.44   0.659    -8.629655    5.461315
     ppent_by_at |   22.03368   14.90374     1.48   0.140    -7.200422    51.26778
      debt_by_at |   42.99232   17.27709     2.49   0.013     9.102822    76.88181
      cash_by_at |   47.89352   24.56337     1.95   0.051    -.2882079    96.07525
    sales_growth |  -4.326255   11.23199    -0.39   0.700    -26.35811     17.7056
  dividend_payer |   6.608519    5.86542     1.13   0.260    -4.896666     18.1137
             nol |  -5.891345   5.740148    -1.03   0.305    -17.15081    5.368115
         ret_vol |   195.5756   54.06827     3.62   0.000     89.51916     301.632
       leveraged |    79.7596   8.240698     9.68   0.000     63.59525    95.92396
        maturity |   8.390079   1.828005     4.59   0.000     4.804395    11.97576
log_deal_amoun~d |  -15.99383    2.70904    -5.90   0.000    -21.30768   -10.67997
   secured_dummy |   64.49048   6.762792     9.54   0.000     51.22507    77.75588
tranche_type_d~y |   74.88968   4.235391    17.68   0.000     66.58185    83.19752
tranche_o_a_du~y |   10.47932   5.751617     1.82   0.069    -.8026357    21.76128
   sponsor_dummy |   85.86738   8.828331     9.73   0.000     68.55036    103.1844
           _cons |    186.869   26.98868     6.92   0.000     133.9299     239.808
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m1

. reghdfe margin_bps treated treated_post treated_loss treated_loss_post `controls'
>  `controls_post' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gv
> key)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  31,   1518) =      51.90
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5488
                                                  Adj R-squared   =     0.5384
                                                  Within R-sq.    =     0.3917
Number of clusters (gvkey)   =      1,519         Root MSE        =   121.0018

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |  -1.341297   13.93723    -0.10   0.923    -28.67957    25.99698
    treated_post |   27.27637   17.67753     1.54   0.123    -7.398605    61.95134
    treated_loss |   37.96139   12.62155     3.01   0.003     13.20388    62.71891
treated_l~s_post |  -36.24564   16.33857    -2.22   0.027     -68.2942   -4.197087
          log_at |  -3.969259   3.155267    -1.26   0.209     -10.1584    2.219886
cash_flows_by_at |  -328.7883   94.07713    -3.49   0.000    -513.3232   -144.2533
  market_to_book |   6.154644   7.664941     0.80   0.422    -8.880351    21.18964
     ppent_by_at |   25.79242   19.36187     1.33   0.183    -12.18643    63.77126
      debt_by_at |   64.02695   26.40467     2.42   0.015     12.23345    115.8205
      cash_by_at |   67.92616    38.4916     1.76   0.078    -7.576178    143.4285
    sales_growth |  -1.507185   16.93326    -0.09   0.929    -34.72225    31.70788
  dividend_payer |   13.45613    8.61834     1.56   0.119    -3.448985    30.36124
             nol |   -10.5802   8.220299    -1.29   0.198    -26.70455    5.544146
         ret_vol |    282.182   95.45367     2.96   0.003     94.94697    469.4171
     log_at_post |   -1.70434   3.219454    -0.53   0.597    -8.019389    4.610709
cash_flows_by~st |   278.7788   119.7744     2.33   0.020     43.83801    513.7197
market_to_book~t |  -12.83426   8.303134    -1.55   0.122    -29.12109    3.452573
ppent_by_at_post |  -8.847532   21.00717    -0.42   0.674    -50.05368    32.35862
 debt_by_at_post |  -34.59666   29.98051    -1.15   0.249    -93.40426    24.21095
 cash_by_at_post |  -32.97505   49.05811    -0.67   0.502    -129.2039    63.25381
sales_growth_p~t |  -9.826635   22.85326    -0.43   0.667    -54.65394    35.00067
dividend_payer~t |  -12.86945   10.65938    -1.21   0.227    -33.77813    8.039227
        nol_post |   7.237742   9.650776     0.75   0.453    -11.69252    26.16801
    ret_vol_post |  -145.1398   114.5594    -1.27   0.205    -369.8512    79.57157
       leveraged |   80.62346   7.877516    10.23   0.000     65.17149    96.07543
        maturity |   8.485809   1.828866     4.64   0.000     4.898438    12.07318
log_deal_amoun~d |  -15.80891   2.739386    -5.77   0.000     -21.1823   -10.43553
   secured_dummy |   63.96366   6.589889     9.71   0.000     51.03741    76.88991
tranche_type_d~y |   75.18409   4.259181    17.65   0.000     66.82958    83.53859
tranche_o_a_du~y |   10.49973   5.625449     1.87   0.062    -.5347488     21.5342
   sponsor_dummy |   86.03095   8.819983     9.75   0.000      68.7303    103.3316
           _cons |   182.5755   26.43764     6.91   0.000     130.7173    234.4337
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m2

. 
. * save the results (esttab) using overleaf_dir
. esttab m1 m2 using "$overleaf_dir/margin_did_both_rule.tex", replace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant drop(_cons `con
> trols_post')
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/margin
> _did_both_rule.tex)

. est clear

. 
. /********* 
>         DID regressions (30% and Loss Rule: ROBUSTNESS RESULT TABLE 2 and Appendi
> x)
>         *********/
. * Firm FE 
. reghdfe margin_bps treated treated_post treated_loss treated_loss_post `controls'
>  `deal_controls', absorb(year gvkey) vce(cluster gvkey)
(dropped 461 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =      4,251
Absorbing 2 HDFE groups                           F(  21,   1057) =      32.31
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.7691
                                                  Adj R-squared   =     0.6897
                                                  Within R-sq.    =     0.2845
Number of clusters (gvkey)   =      1,058         Root MSE        =    98.1087

                                  (Std. err. adjusted for 1,058 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |  -19.50259   16.24432    -1.20   0.230    -51.37737    12.37218
    treated_post |   27.93666   16.96738     1.65   0.100    -5.356909    61.23023
    treated_loss |   45.08471   14.23673     3.17   0.002     17.14924    73.02018
treated_l~s_post |  -43.50761   17.94664    -2.42   0.016     -78.7227   -8.292531
          log_at |  -14.72263   9.126595    -1.61   0.107    -32.63093    3.185675
cash_flows_by_at |  -45.97058   75.28623    -0.61   0.542     -193.698    101.7569
  market_to_book |  -11.99468   6.299165    -1.90   0.057    -24.35497    .3656079
     ppent_by_at |  -32.76913   58.32333    -0.56   0.574    -147.2118    81.67355
      debt_by_at |   128.2622    34.3079     3.74   0.000     60.94283    195.5815
      cash_by_at |  -68.73757   51.09278    -1.35   0.179    -168.9924    31.51724
    sales_growth |  -25.52245   14.95491    -1.71   0.088    -54.86714    3.822241
  dividend_payer |   12.69005   11.77758     1.08   0.282    -10.42005    35.80016
             nol |   2.044123   12.84136     0.16   0.874    -23.15333    27.24158
         ret_vol |   115.5544   85.10914     1.36   0.175     -51.4477    282.5564
       leveraged |   76.66495   9.499366     8.07   0.000     58.02519    95.30471
        maturity |   9.837545   1.898627     5.18   0.000     6.112038    13.56305
log_deal_amoun~d |  -6.034993   3.503185    -1.72   0.085    -12.90898    .8389955
   secured_dummy |   45.52507   7.799657     5.84   0.000      30.2205    60.82964
tranche_type_d~y |   58.81141   4.163833    14.12   0.000     50.64109    66.98173
tranche_o_a_du~y |   8.792849   5.448609     1.61   0.107    -1.898471    19.48417
   sponsor_dummy |   100.4748   12.79121     7.85   0.000     75.37578    125.5739
           _cons |   216.8941   87.13374     2.49   0.013     45.91928    387.8688
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        10           1           9     |
       gvkey |      1058        1058           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. estimates store m1

. reghdfe margin_bps treated treated_post treated_loss treated_loss_post `controls'
>  `controls_post' `deal_controls', absorb(year gvkey) vce(cluster gvkey)
(dropped 461 singleton observations)
(MWFE estimator converged in 9 iterations)

HDFE Linear regression                            Number of obs   =      4,251
Absorbing 2 HDFE groups                           F(  31,   1057) =      23.36
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.7698
                                                  Adj R-squared   =     0.6897
                                                  Within R-sq.    =     0.2869
Number of clusters (gvkey)   =      1,058         Root MSE        =    98.1024

                                  (Std. err. adjusted for 1,058 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   -21.2972   17.28242    -1.23   0.218    -55.20895    12.61455
    treated_post |   30.65783   19.71678     1.55   0.120    -8.030656    69.34631
    treated_loss |    48.2906   15.12006     3.19   0.001     18.62185    77.95934
treated_l~s_post |  -48.88285   19.22934    -2.54   0.011    -86.61487   -11.15082
          log_at |  -11.43359   9.887522    -1.16   0.248      -30.835    7.967808
cash_flows_by_at |  -97.07036   109.3625    -0.89   0.375    -311.6627    117.5219
  market_to_book |  -6.339475   8.099091    -0.78   0.434     -22.2316    9.552649
     ppent_by_at |  -45.35053   58.54503    -0.77   0.439    -160.2282    69.52715
      debt_by_at |   129.2396   38.96656     3.32   0.001       52.779    205.7002
      cash_by_at |  -80.84604   64.48586    -1.25   0.210    -207.3809    45.68882
    sales_growth |  -31.49857    21.5558    -1.46   0.144     -73.7956    10.79847
  dividend_payer |   18.05903   12.92706     1.40   0.163    -7.306589    43.42464
             nol |   1.317818   13.82281     0.10   0.924    -25.80545    28.44109
         ret_vol |   179.0321   146.6681     1.22   0.222    -108.7616    466.8258
     log_at_post |  -7.538615   3.739385    -2.02   0.044    -14.87608   -.2011529
cash_flows_by~st |   76.15512   132.0399     0.58   0.564     -182.935    335.2453
market_to_book~t |  -9.606923   8.296202    -1.16   0.247    -25.88582    6.671975
ppent_by_at_post |  -4.103915   25.84922    -0.16   0.874    -54.82554    46.61771
 debt_by_at_post |  -7.175634   35.08491    -0.20   0.838    -76.01963    61.66836
 cash_by_at_post |   16.62852   71.31473     0.23   0.816     -123.306    156.5631
sales_growth_p~t |    6.01148    29.6217     0.20   0.839    -52.11255    64.13551
dividend_payer~t |  -12.63168   14.15972    -0.89   0.373    -40.41604    15.15267
        nol_post |  -1.057356   11.19942    -0.09   0.925    -23.03298    20.91827
    ret_vol_post |  -102.3119   157.6883    -0.65   0.517    -411.7297    207.1059
       leveraged |   76.14183   9.402523     8.10   0.000     57.69209    94.59156
        maturity |   9.532795   1.900641     5.02   0.000     5.803336    13.26225
log_deal_amoun~d |  -6.007901   3.569825    -1.68   0.093    -13.01265    .9968497
   secured_dummy |   45.43868   7.776088     5.84   0.000     30.18035      60.697
tranche_type_d~y |   58.72039   4.173944    14.07   0.000     50.53023    66.91054
tranche_o_a_du~y |   8.467113   5.378684     1.57   0.116    -2.086999    19.02123
   sponsor_dummy |    99.2981    12.7744     7.77   0.000     74.23202    124.3642
           _cons |   235.9536   89.43179     2.64   0.008     60.46955    411.4376
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        year |        10           1           9     |
       gvkey |      1058        1058           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. estimates store m2

. * 3-year and 5-year look backs
. preserve  

.         /*drop treated treated_post treated_loss treated_loss_post
>         rename (treated_prev_3yr treated_prev_3yr_post treated_loss_prev_3yr trea
> ted_loss_prev_3yr_post) (treated treated_post treated_loss treated_loss_post)
>         reghdfe margin_bps treated treated_post treated_loss treated_loss_post `c
> ontrols' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
>         estimates store m3
>         reghdfe margin_bps treated treated_post treated_loss treated_loss_post `c
> ontrols' `controls_post' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cl
> uster gvkey)
>         estimates store m4*/
.         
.         drop treated treated_post treated_loss treated_loss_post

.         rename (treated_prev_5yr treated_prev_5yr_post treated_loss_prev_5yr trea
> ted_loss_prev_5yr_post) (treated treated_post treated_loss treated_loss_post)

.         reghdfe margin_bps treated treated_post treated_loss treated_loss_post `c
> ontrols' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  21,   1518) =      72.55
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5457
                                                  Adj R-squared   =     0.5363
                                                  Within R-sq.    =     0.3876
Number of clusters (gvkey)   =      1,519         Root MSE        =   121.2774

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   16.94875   13.89951     1.22   0.223    -10.31552    44.21302
    treated_post |   7.487169   18.02789     0.42   0.678    -27.87503    42.84937
    treated_loss |   42.92212   14.29769     3.00   0.003     14.87679    70.96745
treated_l~s_post |  -43.55376    18.6404    -2.34   0.020    -80.11742   -6.990099
          log_at |  -5.086929    2.50437    -2.03   0.042     -9.99932   -.1745375
cash_flows_by_at |  -175.1266   52.20841    -3.35   0.001    -277.5348   -72.71829
  market_to_book |  -1.520006   3.558919    -0.43   0.669    -8.500926    5.460914
     ppent_by_at |   21.43373   14.85374     1.44   0.149    -7.702301    50.56976
      debt_by_at |   37.77811   17.13001     2.21   0.028     4.177109    71.37912
      cash_by_at |   48.27967   24.02516     2.01   0.045     1.153652    95.40569
    sales_growth |  -6.299068   11.11334    -0.57   0.571     -28.0982    15.50006
  dividend_payer |   8.082859   5.914268     1.37   0.172    -3.518143    19.68386
             nol |  -6.421753   5.754843    -1.12   0.265    -17.71004    4.866532
         ret_vol |    197.047   53.16577     3.71   0.000     92.76084    301.3331
       leveraged |   80.40661   8.295713     9.69   0.000     64.13434    96.67889
        maturity |   8.479322    1.82427     4.65   0.000     4.900966    12.05768
log_deal_amoun~d |  -16.09433   2.704097    -5.95   0.000     -21.3985   -10.79017
   secured_dummy |   63.61293   6.746703     9.43   0.000     50.37908    76.84678
tranche_type_d~y |   74.55916   4.238442    17.59   0.000     66.24534    82.87299
tranche_o_a_du~y |   10.57746   5.760498     1.84   0.067    -.7219203    21.87683
   sponsor_dummy |   85.93186    8.83726     9.72   0.000     68.59733    103.2664
           _cons |   187.6221   26.95869     6.96   0.000     134.7419    240.5023
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

.         estimates store m5

.         reghdfe margin_bps treated treated_post treated_loss treated_loss_post `c
> ontrols' `controls_post' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cl
> uster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  31,   1518) =      52.23
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5490
                                                  Adj R-squared   =     0.5386
                                                  Within R-sq.    =     0.3920
Number of clusters (gvkey)   =      1,519         Root MSE        =   120.9741

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   6.260345   15.10269     0.41   0.679    -23.36399    35.88469
    treated_post |   24.37892   19.76514     1.23   0.218    -14.39095    63.14879
    treated_loss |   36.02559   14.53724     2.48   0.013     7.510378    64.54079
treated_l~s_post |  -32.58287   18.96723    -1.72   0.086    -69.78763    4.621881
          log_at |  -4.079447   3.156868    -1.29   0.196    -10.27173    2.112838
cash_flows_by_at |  -329.8861   89.45577    -3.69   0.000    -505.3561   -154.4161
  market_to_book |   6.025052   7.665676     0.79   0.432    -9.011385    21.06149
     ppent_by_at |   26.06374   19.34137     1.35   0.178    -11.87489    64.00236
      debt_by_at |   56.08198   26.68704     2.10   0.036     3.734592    108.4294
      cash_by_at |   67.66044   38.07709     1.78   0.076    -7.028825    142.3497
    sales_growth |  -2.721112     16.831    -0.16   0.872     -35.7356    30.29338
  dividend_payer |   14.45153   8.682045     1.66   0.096    -2.578546     31.4816
             nol |  -10.41277   8.259524    -1.26   0.208    -26.61406    5.788514
         ret_vol |   287.0107   95.67658     3.00   0.003     99.33841     474.683
     log_at_post |  -1.314133   3.211174    -0.41   0.682    -7.612942    4.984675
cash_flows_by~st |   270.2583   113.5079     2.38   0.017      47.6093    492.9072
market_to_book~t |  -12.47969   8.307322    -1.50   0.133    -28.77473    3.815354
ppent_by_at_post |  -10.57462   20.90853    -0.51   0.613    -51.58729    30.43804
 debt_by_at_post |  -28.90581   29.92867    -0.97   0.334    -87.61173    29.80011
 cash_by_at_post |  -27.94842   48.19691    -0.58   0.562     -122.488    66.59117
sales_growth_p~t |  -11.48204   22.71673    -0.51   0.613    -56.04155    33.07747
dividend_payer~t |  -11.63625   10.82261    -1.08   0.282     -32.8651    9.592592
        nol_post |   5.978397   9.709275     0.62   0.538    -13.06662    25.02341
    ret_vol_post |   -143.482   113.5185    -1.26   0.206    -366.1518    79.18778
       leveraged |   81.69615   7.873369    10.38   0.000     66.25231    97.13998
        maturity |   8.520438   1.828343     4.66   0.000     4.934092    12.10678
log_deal_amoun~d |   -15.7526   2.743477    -5.74   0.000    -21.13401   -10.37119
   secured_dummy |   62.91137   6.571883     9.57   0.000     50.02044     75.8023
tranche_type_d~y |   74.88488   4.259563    17.58   0.000     66.52963    83.24013
tranche_o_a_du~y |   10.37883   5.625235     1.85   0.065    -.6552223    21.41289
   sponsor_dummy |   86.29077   8.812011     9.79   0.000     69.00577    103.5758
           _cons |   182.5585   26.42456     6.91   0.000      130.726    234.3911
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

.         estimates store m6

. restore 

. 
. * save the results (esttab) using overleaf_dir
. esttab m1 m2 m5 m6 using "$overleaf_dir/margin_did_both_rule_robustness.tex", rep
> lace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant keep(treated tr
> eated_post treated_loss treated_loss_post)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/margin
> _did_both_rule_robustness.tex)

. est clear

. 
. ****** Appendix Tabld D2
. 
. *** DID regressions (30% and Loss Rule: Treat X Covariates) ***
. reghdfe margin_bps treated treated_post treated_loss treated_loss_post `controls'
>  `controls_post' `controls_treated' `controls_treated_loss' `deal_controls', abso
> rb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  51,   1518) =      34.29
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5578
                                                  Adj R-squared   =     0.5457
                                                  Within R-sq.    =     0.4039
Number of clusters (gvkey)   =      1,519         Root MSE        =   120.0462

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   117.1371   63.26601     1.85   0.064     -6.96091    241.2352
    treated_post |   30.25121   17.61209     1.72   0.086    -4.295392    64.79781
    treated_loss |  -39.29432   58.60054    -0.67   0.503    -154.2409    75.65229
treated_l~s_post |   -35.7082   17.13409    -2.08   0.037     -69.3172   -2.099205
          log_at |  -1.816266   3.109052    -0.58   0.559    -7.914759    4.282227
cash_flows_by_at |  -222.5123   83.93997    -2.65   0.008    -387.1629   -57.86173
  market_to_book |   2.211733   7.138216     0.31   0.757    -11.79008    16.21354
     ppent_by_at |   9.503411   19.63655     0.48   0.628    -29.01422    48.02105
      debt_by_at |   44.93568   25.37544     1.77   0.077    -4.838965    94.71032
      cash_by_at |   60.41544   36.05698     1.68   0.094    -10.31133    131.1422
    sales_growth |   3.040965   16.84481     0.18   0.857     -30.0006    36.08253
  dividend_payer |   17.81197   8.569006     2.08   0.038     1.003621    34.62031
             nol |  -8.249694   8.073995    -1.02   0.307    -24.08706    7.587674
         ret_vol |   182.3709   100.7795     1.81   0.071    -15.31094    380.0527
     log_at_post |  -.2296076   3.252259    -0.07   0.944    -6.609004    6.149789
cash_flows_by~st |   333.0707   109.2193     3.05   0.002      118.834    547.3074
market_to_book~t |  -12.61659   7.704131    -1.64   0.102    -27.72846    2.495274
ppent_by_at_post |  -10.77123   20.52026    -0.52   0.600    -51.02228    29.47983
 debt_by_at_post |  -32.44743   29.74921    -1.09   0.276    -90.80134    25.90648
 cash_by_at_post |  -37.90388   47.66154    -0.80   0.427    -131.3933    55.58558
sales_growth_p~t |  -6.310099   22.05326    -0.29   0.775    -49.56819    36.94799
dividend_payer~t |  -12.77537   10.64858    -1.20   0.230    -33.66285    8.112114
        nol_post |   7.227255   9.735997     0.74   0.458    -11.87018    26.32469
    ret_vol_post |  -157.8478   113.4768    -1.39   0.164    -380.4357    64.74014
  log_at_treated |  -14.11711   6.188069    -2.28   0.023    -26.25518   -1.979038
cash_flows_by_~d |  -204.8804   173.2288    -1.18   0.237    -544.6735    134.9126
market_to_book~d |  -38.30908   14.22358    -2.69   0.007    -66.20904   -10.40913
ppent_by_at_tr~d |   23.21006   31.79585     0.73   0.466    -39.15838     85.5785
debt_by_at_tre~d |   79.14916   40.63579     1.95   0.052    -.5590865    158.8574
cash_by_at_tre~d |   38.57541   88.82852     0.43   0.664    -135.6642     212.815
sales_growth_t~d |   48.89951   25.74812     1.90   0.058     -1.60614    99.40517
dividend_payer~d |  -7.982399    17.0006    -0.47   0.639    -41.32955    25.36475
     nol_treated |  -3.526423   19.00325    -0.19   0.853    -40.80183    33.74898
 ret_vol_treated |   36.56627   110.1477     0.33   0.740    -179.4915     252.624
log_at_treated~s |   6.741698   5.537152     1.22   0.224    -4.119581    17.60298
cash_flows_by_~s |    -148.19   173.2763    -0.86   0.393    -488.0764    191.6964
market_to_book~s |   37.90297   14.00794     2.71   0.007       10.426    65.37994
ppent_by_at_tr~s |   21.40561   34.91516     0.61   0.540    -47.08146    89.89268
debt_by_at_tre~s |  -23.12383    44.0315    -0.53   0.600    -109.4929     63.2452
cash_by_at_tre~s |   -54.7947   82.09227    -0.67   0.505     -215.821    106.2316
sales_growth_t~s |  -62.12492   26.64046    -2.33   0.020    -114.3809   -9.868907
dividend_payer~s |  -16.04213   17.12487    -0.94   0.349    -49.63305    17.54878
nol_treated_loss |  -11.09546    19.2106    -0.58   0.564    -48.77759    26.58667
ret_vol_treate~s |    90.6171   110.0326     0.82   0.410    -125.2149    306.4491
       leveraged |   83.76811   7.745271    10.82   0.000     68.57555    98.96068
        maturity |   9.452869    1.80878     5.23   0.000     5.904897    13.00084
log_deal_amoun~d |  -16.55892   2.680302    -6.18   0.000    -21.81641   -11.30143
   secured_dummy |   61.43668   6.466447     9.50   0.000     48.75256    74.12079
tranche_type_d~y |   73.99233    4.21613    17.55   0.000     65.72227    82.26239
tranche_o_a_du~y |   9.268972   5.554977     1.67   0.095    -1.627271    20.16522
   sponsor_dummy |   87.89638   8.717706    10.08   0.000     70.79636    104.9964
           _cons |   168.2057   26.09532     6.45   0.000      117.019    219.3924
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m1

. *reghdfe log_margin_bps treated treated_post treated_loss treated_loss_post `cont
> rols' `controls_post' `controls_treated' `controls_treated_loss' `deal_controls',
>  absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
. *estimates store m2
. 
. *** DID regressions (30% and Loss Rule: ROBUSTNESS E-balancing) ***
. 
. use "../3. Data/Processed/tranche_level_ds_compa_wlabel.dta", clear

. 
. gen treated_all = 1 if treated == 1 | treated_loss == 1
(3,219 missing values generated)

. replace treated_all = 0 if treated_all == .
(3,219 real changes made)

. 
. local controls "log_at cash_flows_by_at market_to_book ppent_by_at debt_by_at cas
> h_by_at sales_growth dividend_payer nol ret_vol"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dummy t
> ranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. 
. ebalance treated_all `controls'


Data Setup
Treatment variable:   treated_all
Covariate adjustment: log_at cash_flows_by_at market_to_book ppent_by_at debt_by_at
>  cash_by_at sales_growth dividend_payer nol ret_vol 

Optimizing...
Iteration 1: Max Difference = 27317.3546
Iteration 2: Max Difference = 10047.4273
Iteration 3: Max Difference = 3694.18036
Iteration 4: Max Difference = 1356.9632
Iteration 5: Max Difference = 497.180789
Iteration 6: Max Difference = 180.969343
Iteration 7: Max Difference = 64.8616148
Iteration 8: Max Difference = 22.6673592
Iteration 9: Max Difference = 7.98029869
Iteration 10: Max Difference = 2.77231337
Iteration 11: Max Difference = .828466358
Iteration 12: Max Difference = .120745049
Iteration 13: Max Difference = .002658243
maximum difference smaller than the tolerance level; convergence achieved


Treated units: 1493    total of weights: 1493
Control units: 3219    total of weights: 1493


Before: without weighting

             |              Treat              |             Control             
             |      mean   variance   skewness |      mean   variance   skewness 
-------------+---------------------------------+--------------------------------
      log_at |     7.828      3.125      .2074 |     8.489      2.722     .04661 
cash_flow~at |    .03601    .006438     -1.467 |     .1028    .003718      .3812 
market_to_~k |     1.364      1.408      3.353 |     1.729      1.414      2.411 
 ppent_by_at |     .3319     .08527      .6104 |     .2687     .05844      1.077 
  debt_by_at |     .4544      .0563      .2455 |     .3202     .03026      .5719 
  cash_by_at |     .1129     .01938      2.204 |     .1038     .01273      2.011 
sales_growth |    .09632      .1379       .694 |     .1076     .04426      1.859 
dividend_p~r |     .3362      .2233      .6933 |     .6434      .2295     -.5986 
         nol |     .7428      .1912     -1.111 |     .6645       .223     -.6968 
     ret_vol |     .1532    .008228      1.217 |    .08794    .002262      2.558 


After:  _webal as the weighting variable

             |              Treat              |             Control             
             |      mean   variance   skewness |      mean   variance   skewness 
-------------+---------------------------------+--------------------------------
      log_at |     7.828      3.125      .2074 |     7.828      2.333      -.136 
cash_flow~at |    .03601    .006438     -1.467 |    .03602     .01117     -1.202 
market_to_~k |     1.364      1.408      3.353 |     1.365      .9615      2.861 
 ppent_by_at |     .3319     .08527      .6104 |     .3319     .07973      .6643 
  debt_by_at |     .4544      .0563      .2455 |     .4544     .05091        .41 
  cash_by_at |     .1129     .01938      2.204 |     .1129     .01474      1.746 
sales_growth |    .09632      .1379       .694 |    .09632     .04796      1.808 
dividend_p~r |     .3362      .2233      .6933 |     .3363      .2233       .693 
         nol |     .7428      .1912     -1.111 |     .7428      .1911     -1.111 
     ret_vol |     .1532    .008228      1.217 |     .1532     .01093      1.221 

. 
. reghdfe margin_bps treated treated_post treated_loss treated_loss_post `controls'
>  `deal_controls' [pweight=_webal], absorb(year ff_48 sp_rating_num) vce(cluster g
> vkey)
(MWFE estimator converged in 8 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  21,   1518) =      33.61
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4990
                                                  Adj R-squared   =     0.4885
                                                  Within R-sq.    =     0.3103
Number of clusters (gvkey)   =      1,519         Root MSE        =   136.5413

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   1.488767   14.35359     0.10   0.917    -26.66619    29.64373
    treated_post |   26.05094   17.75974     1.47   0.143    -8.785276    60.88716
    treated_loss |   51.71784   13.56718     3.81   0.000     25.10545    78.33024
treated_l~s_post |  -34.34317   17.15437    -2.00   0.045    -67.99195   -.6943943
          log_at |  -12.50878   4.259344    -2.94   0.003     -20.8636   -4.153959
cash_flows_by_at |  -159.0352   67.27751    -2.36   0.018    -291.0019   -27.06849
  market_to_book |  -12.43997   6.064338    -2.05   0.040    -24.33534    -.544602
     ppent_by_at |   28.79234   22.69348     1.27   0.205    -15.72156    73.30623
      debt_by_at |   87.63819   24.23591     3.62   0.000     40.09878    135.1776
      cash_by_at |   42.24857   37.56544     1.12   0.261    -31.43709    115.9342
    sales_growth |   2.396178     14.126     0.17   0.865    -25.31236    30.10472
  dividend_payer |  -8.470209   9.445558    -0.90   0.370    -26.99793    10.05752
             nol |  -1.548764   10.49244    -0.15   0.883    -22.12998    19.03245
         ret_vol |   92.43055   66.20061     1.40   0.163    -37.42381    222.2849
       leveraged |   52.60774   15.12123     3.48   0.001     22.94703    82.26845
        maturity |    2.01025   4.109118     0.49   0.625      -6.0499     10.0704
log_deal_amoun~d |  -8.611235   5.084693    -1.69   0.091      -18.585    1.362533
   secured_dummy |   66.16486   11.29124     5.86   0.000     44.01679    88.31294
tranche_type_d~y |   116.3199    8.46977    13.73   0.000     99.70619    132.9336
tranche_o_a_du~y |    32.2864   11.50924     2.81   0.005     9.710711    54.86209
   sponsor_dummy |   61.44887   11.99749     5.12   0.000     37.91546    84.98227
           _cons |   216.0918   47.04758     4.59   0.000     123.8066    308.3769
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m3

. *reghdfe log_margin_bps treated treated_post treated_loss treated_loss_post `cont
> rols' `deal_controls' [pweight=_webal], absorb(year ff_48 sp_rating_num) vce(clus
> ter gvkey)
. *estimates store m4
. 
. * save the results (esttab) using overleaf_dir
. esttab m1 m3 using "$overleaf_dir/margin_did_both_rule_robustness_2.tex", replace
>  ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant keep(treated tr
> eated_post treated_loss treated_loss_post)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/margin
> _did_both_rule_robustness_2.tex)

. est clear

. 
. *** Appendix Table: Log Margin results with prev_3yr and prev_5yr definitions
. * Appendix Table D1: Logged Margin
. reghdfe log_margin_bps treated treated_post treated_loss treated_loss_post `contr
> ols' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  21,   1518) =     118.42
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6830
                                                  Adj R-squared   =     0.6764
                                                  Within R-sq.    =     0.5143
Number of clusters (gvkey)   =      1,519         Root MSE        =     0.3524

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
  log_margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   .0220142   .0372572     0.59   0.555    -.0510668    .0950953
    treated_post |   .0579717   .0449167     1.29   0.197    -.0301336    .1460771
    treated_loss |   .1101575   .0333404     3.30   0.001     .0447594    .1755557
treated_l~s_post |  -.1084434   .0436686    -2.48   0.013    -.1941007   -.0227862
          log_at |  -.0282896   .0077736    -3.64   0.000    -.0435378   -.0130415
cash_flows_by_at |  -.4443466   .1571295    -2.83   0.005    -.7525606   -.1361327
  market_to_book |  -.0254281   .0113672    -2.24   0.025    -.0477252    -.003131
     ppent_by_at |   .0604925   .0439707     1.38   0.169    -.0257572    .1467422
      debt_by_at |   .1407406   .0489879     2.87   0.004     .0446495    .2368318
      cash_by_at |   .1902467   .0730963     2.60   0.009     .0468663    .3336271
    sales_growth |   .0107644   .0315156     0.34   0.733    -.0510542    .0725831
  dividend_payer |   .0194398   .0176189     1.10   0.270    -.0151202    .0539998
             nol |  -.0089866   .0175184    -0.51   0.608    -.0433494    .0253761
         ret_vol |   .5602969   .1548746     3.62   0.000      .256506    .8640878
       leveraged |   .4681928   .0262416    17.84   0.000     .4167192    .5196665
        maturity |   .0394053   .0053514     7.36   0.000     .0289084    .0499022
log_deal_amoun~d |  -.0448818   .0084527    -5.31   0.000     -.061462   -.0283016
   secured_dummy |   .1849132   .0203501     9.09   0.000     .1449959    .2248305
tranche_type_d~y |   .2097207   .0126312    16.60   0.000     .1849443    .2344971
tranche_o_a_du~y |   .0205374   .0170724     1.20   0.229    -.0129505    .0540253
   sponsor_dummy |   .2691435   .0256679    10.49   0.000     .2187952    .3194918
           _cons |   5.047354   .0823775    61.27   0.000     4.885768     5.20894
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m1

. reghdfe log_margin_bps treated treated_post treated_loss treated_loss_post `contr
> ols' `controls_post' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluste
> r gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  31,   1518) =      86.46
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6857
                                                  Adj R-squared   =     0.6785
                                                  Within R-sq.    =     0.5184
Number of clusters (gvkey)   =      1,519         Root MSE        =     0.3513

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
  log_margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |  -.0092301   .0410332    -0.22   0.822    -.0897177    .0712576
    treated_post |   .1112019   .0510286     2.18   0.029      .011108    .2112959
    treated_loss |   .1032463   .0343043     3.01   0.003     .0359576    .1705351
treated_l~s_post |  -.0941978    .045598    -2.07   0.039    -.1836396    -.004756
          log_at |   -.019338   .0098266    -1.97   0.049    -.0386132   -.0000628
cash_flows_by_at |  -.8740509   .2605594    -3.35   0.001    -1.385145   -.3629564
  market_to_book |  -.0044746   .0245076    -0.18   0.855    -.0525469    .0435978
     ppent_by_at |   .0547796   .0569361     0.96   0.336    -.0569022    .1664613
      debt_by_at |   .2118887   .0729432     2.90   0.004     .0688086    .3549688
      cash_by_at |   .2559508   .1103129     2.32   0.020      .039569    .4723325
    sales_growth |   .0352177   .0475677     0.74   0.459    -.0580877    .1285231
  dividend_payer |   .0408859   .0249909     1.64   0.102    -.0081345    .0899063
             nol |  -.0287097   .0240596    -1.19   0.233    -.0759033    .0184839
         ret_vol |   .7576707    .263372     2.88   0.004     .2410592    1.274282
     log_at_post |  -.0146018   .0101511    -1.44   0.151    -.0345134    .0053099
cash_flows_by~st |   .7797425   .3234083     2.41   0.016      .145368    1.414117
market_to_book~t |  -.0340779   .0261452    -1.30   0.193    -.0853625    .0172067
ppent_by_at_post |   .0014481   .0620108     0.02   0.981    -.1201878     .123084
 debt_by_at_post |  -.1184364   .0846573    -1.40   0.162    -.2844941    .0476212
 cash_by_at_post |  -.1138575   .1434789    -0.79   0.428    -.3952953    .1675803
sales_growth_p~t |  -.0603789   .0647069    -0.93   0.351    -.1873032    .0665454
dividend_payer~t |  -.0390052   .0318469    -1.22   0.221    -.1014739    .0234634
        nol_post |   .0305574   .0292046     1.05   0.296    -.0267283     .087843
    ret_vol_post |  -.3327278   .3135809    -1.06   0.289    -.9478255    .2823699
       leveraged |   .4688451   .0254817    18.40   0.000     .4188621    .5188282
        maturity |   .0391935   .0053267     7.36   0.000     .0287449     .049642
log_deal_amoun~d |  -.0444527   .0085128    -5.22   0.000    -.0611508   -.0277545
   secured_dummy |   .1855282   .0198641     9.34   0.000     .1465641    .2244922
tranche_type_d~y |   .2105503   .0126451    16.65   0.000     .1857466    .2353539
tranche_o_a_du~y |   .0211569   .0166741     1.27   0.205    -.0115498    .0538636
   sponsor_dummy |   .2688776   .0256996    10.46   0.000     .2184671    .3192882
           _cons |   5.039729   .0819568    61.49   0.000     4.878968    5.200489
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m2

. preserve

.         /*drop treated treated_post treated_loss treated_loss_post
>         rename (treated_prev_3yr treated_prev_3yr_post treated_loss_prev_3yr trea
> ted_loss_prev_3yr_post) (treated treated_post treated_loss treated_loss_post)
>         reghdfe log_margin_bps treated treated_post treated_loss treated_loss_pos
> t `controls' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
>         estimates store m3
>         reghdfe log_margin_bps treated treated_post treated_loss treated_loss_pos
> t `controls' `controls_post' `deal_controls', absorb(year ff_48 sp_rating_num) vc
> e(cluster gvkey)
>         estimates store m4 */
.         
.         drop treated treated_post treated_loss treated_loss_post

.         rename (treated_prev_5yr treated_prev_5yr_post treated_loss_prev_5yr trea
> ted_loss_prev_5yr_post) (treated treated_post treated_loss treated_loss_post)

.         reghdfe log_margin_bps treated treated_post treated_loss treated_loss_pos
> t `controls' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  21,   1518) =     118.07
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6827
                                                  Adj R-squared   =     0.6761
                                                  Within R-sq.    =     0.5138
Number of clusters (gvkey)   =      1,519         Root MSE        =     0.3526

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
  log_margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   .0359134   .0403697     0.89   0.374    -.0432729    .1150997
    treated_post |    .045868    .050157     0.91   0.361    -.0525163    .1442523
    treated_loss |   .1005485   .0384062     2.62   0.009     .0252136    .1758834
treated_l~s_post |  -.1004158   .0511358    -1.96   0.050    -.2007201   -.0001115
          log_at |  -.0277598   .0077576    -3.58   0.000    -.0429764   -.0125431
cash_flows_by_at |  -.4865206   .1485576    -3.27   0.001    -.7779205   -.1951206
  market_to_book |  -.0251249   .0113504    -2.21   0.027    -.0473891   -.0028607
     ppent_by_at |   .0601948   .0438414     1.37   0.170    -.0258014     .146191
      debt_by_at |   .1345948   .0483826     2.78   0.005     .0396909    .2294986
      cash_by_at |   .2010857   .0717257     2.80   0.005     .0603938    .3417776
    sales_growth |   .0043037   .0312893     0.14   0.891    -.0570711    .0656785
  dividend_payer |   .0228944   .0178074     1.29   0.199    -.0120354    .0578241
             nol |  -.0102271   .0175391    -0.58   0.560    -.0446306    .0241764
         ret_vol |   .5928923   .1547552     3.83   0.000     .2893357     .896449
       leveraged |   .4717247   .0263756    17.88   0.000     .4199883    .5234612
        maturity |   .0394352   .0053552     7.36   0.000     .0289308    .0499397
log_deal_amoun~d |  -.0453116   .0084358    -5.37   0.000    -.0618587   -.0287646
   secured_dummy |   .1822493   .0203137     8.97   0.000     .1424034    .2220953
tranche_type_d~y |   .2085244   .0126531    16.48   0.000      .183705    .2333438
tranche_o_a_du~y |   .0200497   .0171213     1.17   0.242    -.0135343    .0536337
   sponsor_dummy |   .2697348   .0256953    10.50   0.000     .2193328    .3201368
           _cons |    5.05033   .0822473    61.40   0.000        4.889     5.21166
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

.         estimates store m5

.         reghdfe log_margin_bps treated treated_post treated_loss treated_loss_pos
> t `controls' `controls_post' `deal_controls', absorb(year ff_48 sp_rating_num) vc
> e(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  31,   1518) =      86.04
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6850
                                                  Adj R-squared   =     0.6778
                                                  Within R-sq.    =     0.5173
Number of clusters (gvkey)   =      1,519         Root MSE        =     0.3517

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
  log_margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   .0079318   .0440645     0.18   0.857    -.0785019    .0943656
    treated_post |    .086086   .0554874     1.55   0.121    -.0227541    .1949261
    treated_loss |   .0922307   .0389821     2.37   0.018     .0157662    .1686952
treated_l~s_post |  -.0874065   .0526699    -1.66   0.097    -.1907199     .015907
          log_at |  -.0193264   .0098423    -1.96   0.050    -.0386324   -.0000204
cash_flows_by_at |  -.8854652   .2482706    -3.57   0.000    -1.372455   -.3984755
  market_to_book |  -.0044264   .0245037    -0.18   0.857    -.0524912    .0436384
     ppent_by_at |   .0557355   .0566868     0.98   0.326    -.0554573    .1669283
      debt_by_at |   .1924971   .0732801     2.63   0.009     .0487562    .3362379
      cash_by_at |   .2563187   .1094237     2.34   0.019      .041681    .4709563
    sales_growth |   .0321602   .0476054     0.68   0.499    -.0612191    .1255394
  dividend_payer |   .0431721   .0251121     1.72   0.086     -.006086    .0924302
             nol |  -.0280924   .0241339    -1.16   0.245    -.0754317     .019247
         ret_vol |   .7760889   .2667401     2.91   0.004     .2528707    1.299307
     log_at_post |  -.0139509   .0101559    -1.37   0.170     -.033872    .0059702
cash_flows_by~st |   .7054226   .3069531     2.30   0.022     .1033254     1.30752
market_to_book~t |  -.0335188     .02615    -1.28   0.200    -.0848127    .0177752
ppent_by_at_post |  -.0006302   .0619098    -0.01   0.992    -.1220679    .1208076
 debt_by_at_post |  -.0903364   .0835848    -1.08   0.280    -.2542903    .0736176
 cash_by_at_post |  -.0875889   .1414294    -0.62   0.536    -.3650067    .1898289
sales_growth_p~t |   -.065599   .0647006    -1.01   0.311     -.192511     .061313
dividend_payer~t |  -.0368485   .0322188    -1.14   0.253    -.1000467    .0263496
        nol_post |   .0277034   .0292772     0.95   0.344    -.0297246    .0851315
    ret_vol_post |  -.2947193      .3176    -0.93   0.354    -.9177005    .3282619
       leveraged |   .4729964   .0254597    18.58   0.000     .4230564    .5229363
        maturity |   .0390698   .0053446     7.31   0.000     .0285863    .0495533
log_deal_amoun~d |  -.0446638   .0085135    -5.25   0.000    -.0613633   -.0279644
   secured_dummy |   .1826266   .0198517     9.20   0.000     .1436869    .2215663
tranche_type_d~y |   .2093012   .0126689    16.52   0.000     .1844508    .2341515
tranche_o_a_du~y |    .020212   .0166773     1.21   0.226     -.012501     .052925
   sponsor_dummy |   .2697053    .025648    10.52   0.000     .2193961    .3200145
           _cons |   5.042709   .0819407    61.54   0.000      4.88198    5.203438
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

.         estimates store m6

. restore

. * save the results (esttab) using overleaf_dir
. esttab m1 m2 m5 m6 using "$overleaf_dir/log_margin_did_both_rule.tex", replace //
> /
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant keep(treated tr
> eated_post treated_loss treated_loss_post)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/log_ma
> rgin_did_both_rule.tex)

. est clear

. 
. /*********** 
>         Regressions with Other Loan Terms 
>         ***********/
. 
. *** DID regressions (30% and Loss Rule: Perf Pricing and Num Fin Cov) ***
. 
. reghdfe perf_pricing_dummy treated treated_post treated_loss treated_loss_post `c
> ontrols' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  21,   1518) =      13.94
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2183
                                                  Adj R-squared   =     0.2021
                                                  Within R-sq.    =     0.0841
Number of clusters (gvkey)   =      1,519         Root MSE        =     0.3927

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
perf_pricing_d~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   .0145816   .0331089     0.44   0.660    -.0503624    .0795256
    treated_post |  -.0287135   .0379333    -0.76   0.449    -.1031207    .0456938
    treated_loss |  -.0137453   .0315845    -0.44   0.663    -.0756993    .0482086
treated_l~s_post |   .0120873    .038252     0.32   0.752     -.062945    .0871196
          log_at |  -.0181139   .0069009    -2.62   0.009    -.0316502   -.0045776
cash_flows_by_at |   .2562392   .1129052     2.27   0.023     .0347724     .477706
  market_to_book |   .0104399   .0081753     1.28   0.202    -.0055962     .026476
     ppent_by_at |  -.0595446   .0370869    -1.61   0.109    -.1322915    .0132023
      debt_by_at |  -.1256414   .0413111    -3.04   0.002    -.2066743   -.0446084
      cash_by_at |  -.1745401   .0711849    -2.45   0.014    -.3141713   -.0349088
    sales_growth |  -.0152653   .0269788    -0.57   0.572     -.068185    .0376544
  dividend_payer |  -.0087368   .0180651    -0.48   0.629     -.044172    .0266985
             nol |   .0193414   .0183855     1.05   0.293    -.0167223    .0554051
         ret_vol |    .087131   .1354825     0.64   0.520    -.1786217    .3528836
       leveraged |  -.1615402   .0243339    -6.64   0.000    -.2092719   -.1138085
        maturity |  -.0017857   .0049849    -0.36   0.720    -.0115637    .0079922
log_deal_amoun~d |   .0584491   .0075488     7.74   0.000      .043642    .0732563
   secured_dummy |    .074515   .0210759     3.54   0.000      .033174    .1158561
tranche_type_d~y |  -.0779223   .0125336    -6.22   0.000    -.1025072   -.0533373
tranche_o_a_du~y |    .086674   .0176499     4.91   0.000     .0520532    .1212948
   sponsor_dummy |   -.098792   .0217303    -4.55   0.000    -.1414166   -.0561674
           _cons |   .1174961   .0717694     1.64   0.102    -.0232817    .2582739
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m1

. reghdfe num_fin_cov treated treated_post treated_loss treated_loss_post `controls
> ' `deal_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  21,   1518) =      13.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1737
                                                  Adj R-squared   =     0.1566
                                                  Within R-sq.    =     0.0927
Number of clusters (gvkey)   =      1,519         Root MSE        =     0.7598

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
     num_fin_cov | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   .0119777   .0779137     0.15   0.878    -.1408522    .1648076
    treated_post |  -.0675585   .0910969    -0.74   0.458    -.2462477    .1111306
    treated_loss |  -.0844201   .0777779    -1.09   0.278    -.2369835    .0681434
treated_l~s_post |    .030468   .0917675     0.33   0.740    -.1495365    .2104725
          log_at |  -.1072152    .015905    -6.74   0.000    -.1384133   -.0760171
cash_flows_by_at |   .6207134   .2489189     2.49   0.013     .1324521    1.108975
  market_to_book |  -.0051733   .0178559    -0.29   0.772    -.0401981    .0298515
     ppent_by_at |  -.0282476   .0913924    -0.31   0.757    -.2075164    .1510213
      debt_by_at |  -.0436339   .1019242    -0.43   0.669     -.243561    .1562932
      cash_by_at |  -.4293243   .1644408    -2.61   0.009    -.7518795   -.1067691
    sales_growth |  -.0196606   .0587993    -0.33   0.738    -.1349971     .095676
  dividend_payer |   .0092855   .0435037     0.21   0.831    -.0760482    .0946193
             nol |     .05351   .0394549     1.36   0.175     -.023882     .130902
         ret_vol |   .1150618   .3309642     0.35   0.728    -.5341336    .7642573
       leveraged |  -.2375898   .0558217    -4.26   0.000    -.3470857   -.1280939
        maturity |   -.034149   .0102896    -3.32   0.001    -.0543323   -.0139656
log_deal_amoun~d |   .0910337   .0153688     5.92   0.000     .0608873    .1211801
   secured_dummy |    .119612   .0471358     2.54   0.011     .0271539    .2120702
tranche_type_d~y |  -.0585599   .0215107    -2.72   0.007    -.1007538    -.016366
tranche_o_a_du~y |  -.0268883   .0382688    -0.70   0.482    -.1019537    .0481771
   sponsor_dummy |  -.4089599   .0444593    -9.20   0.000    -.4961682   -.3217517
           _cons |   1.205004   .1683063     7.16   0.000     .8748665    1.535141
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m2

. *** DID regressions (covenant tightness)
. reghdfe pviol treated treated_post treated_loss treated_loss_post `controls' `dea
> l_controls', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(dropped 2 singleton observations)
(MWFE estimator converged in 8 iterations)

HDFE Linear regression                            Number of obs   =      1,329
Absorbing 3 HDFE groups                           F(  21,    437) =       1.54
Statistics robust to heteroskedasticity           Prob > F        =     0.0600
                                                  R-squared       =     0.1563
                                                  Adj R-squared   =     0.0979
                                                  Within R-sq.    =     0.0482
Number of clusters (gvkey)   =        438         Root MSE        =     0.2111

                                    (Std. err. adjusted for 438 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
           pviol | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   .0864765   .0407888     2.12   0.035       .00631     .166643
    treated_post |  -.0991298   .0514342    -1.93   0.055    -.2002191    .0019594
    treated_loss |  -.0137897   .0355258    -0.39   0.698    -.0836125     .056033
treated_l~s_post |   .0114423   .0477195     0.24   0.811    -.0823459    .1052306
          log_at |   -.016075    .009673    -1.66   0.097    -.0350864    .0029364
cash_flows_by_at |   .0193564     .10257     0.19   0.850    -.1822355    .2209483
  market_to_book |  -.0063929   .0104306    -0.61   0.540    -.0268932    .0141074
     ppent_by_at |   .0191019   .0438551     0.44   0.663    -.0670913     .105295
      debt_by_at |   .0586981   .0542562     1.08   0.280    -.0479375    .1653337
      cash_by_at |   .1294288   .0910909     1.42   0.156    -.0496019    .3084595
    sales_growth |   .0345229   .0332749     1.04   0.300    -.0308758    .0999216
  dividend_payer |  -.0080934   .0190426    -0.43   0.671    -.0455199    .0293331
             nol |  -.0233905   .0225286    -1.04   0.300    -.0676685    .0208874
         ret_vol |   .1355093   .1961285     0.69   0.490    -.2499631    .5209816
       leveraged |   .0029879   .0213238     0.14   0.889    -.0389221     .044898
        maturity |   -.003472   .0047311    -0.73   0.463    -.0127705    .0058264
log_deal_amoun~d |   .0029146   .0072286     0.40   0.687    -.0112926    .0171217
   secured_dummy |    .052885     .02065     2.56   0.011     .0122993    .0934707
tranche_type_d~y |   .0080231     .01003     0.80   0.424    -.0116899     .027736
tranche_o_a_du~y |   .0172533   .0155015     1.11   0.266    -.0132135      .04772
   sponsor_dummy |  -.0440315   .0281477    -1.56   0.118    -.0993532    .0112902
           _cons |   .1041373   .0969333     1.07   0.283     -.086376    .2946507
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        41           1          40     |
 sp_rating_num |        17           1          16    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m3

. 
. *** DID regressions (30% and Loss Rule: Loan Size and Maturity) ***
. 
. local deal_controls_2 "leveraged secured_dummy tranche_type_dummy tranche_o_a_dum
> my sponsor_dummy"

. 
. reghdfe deal_amount_converted treated treated_post treated_loss treated_loss_post
>  `controls' `deal_controls_2', absorb(year ff_48 sp_rating_num) vce(cluster gvkey
> )
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  19,   1518) =       9.23
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2956
                                                  Adj R-squared   =     0.2812
                                                  Within R-sq.    =     0.1864
Number of clusters (gvkey)   =      1,519         Root MSE        =  2239.7904

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
deal_amount_co~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |  -590.6488   239.0273    -2.47   0.014    -1059.508     -121.79
    treated_post |   54.41072   266.5079     0.20   0.838    -468.3519    577.1734
    treated_loss |   13.27195   179.9568     0.07   0.941    -339.7183    366.2622
treated_l~s_post |   319.6899   229.2631     1.39   0.163    -130.0161    769.3959
          log_at |    754.493   76.31067     9.89   0.000     604.8075    904.1785
cash_flows_by_at |   23.51482    791.379     0.03   0.976    -1528.797    1575.827
  market_to_book |   32.25469   57.05354     0.57   0.572    -79.65743    144.1668
     ppent_by_at |  -408.4375    277.141    -1.47   0.141    -952.0574    135.1823
      debt_by_at |   871.0806    398.972     2.18   0.029     88.48592    1653.675
      cash_by_at |   260.0985   638.5849     0.41   0.684    -992.5036    1512.701
    sales_growth |   117.2643   171.2316     0.68   0.494    -218.6112    453.1398
  dividend_payer |  -34.07468   133.8025    -0.25   0.799     -296.532    228.3827
             nol |  -40.18729   144.6207    -0.28   0.781    -323.8649    243.4903
         ret_vol |   422.9759   947.2704     0.45   0.655    -1435.122    2281.073
       leveraged |  -221.6091   129.3972    -1.71   0.087    -475.4253    32.20708
   secured_dummy |   193.4704   117.6398     1.64   0.100    -37.28344    424.2243
tranche_type_d~y |  -21.08943    86.5845    -0.24   0.808    -190.9273    148.7485
tranche_o_a_du~y |  -619.0971   135.5073    -4.57   0.000    -884.8984   -353.2958
   sponsor_dummy |   74.26612    160.452     0.46   0.644    -240.4651    388.9973
           _cons |  -4287.263   620.9817    -6.90   0.000    -5505.336    -3069.19
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m4

. 
. reghdfe log_deal_amount_converted treated treated_post treated_loss treated_loss_
> post `controls' `deal_controls_2', absorb(year ff_48 sp_rating_num) vce(cluster g
> vkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  19,   1518) =      44.90
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4731
                                                  Adj R-squared   =     0.4623
                                                  Within R-sq.    =     0.3397
Number of clusters (gvkey)   =      1,519         Root MSE        =     0.9419

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
log_deal_amoun~d | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |  -.3942616   .1053301    -3.74   0.000    -.6008695   -.1876537
    treated_post |   .1162908   .1259063     0.92   0.356    -.1306779    .3632596
    treated_loss |  -.1365216   .0992084    -1.38   0.169    -.3311217    .0580784
treated_l~s_post |   .1820681   .1200775     1.52   0.130    -.0534672    .4176034
          log_at |   .4516409   .0208086    21.70   0.000     .4108242    .4924577
cash_flows_by_at |   .4524142    .391967     1.15   0.249    -.3164401    1.221269
  market_to_book |   .0772009   .0228492     3.38   0.001     .0323815    .1220202
     ppent_by_at |  -.2247402   .1327051    -1.69   0.091     -.485045    .0355646
      debt_by_at |   .4766995   .1263251     3.77   0.000     .2289093    .7244896
      cash_by_at |  -.2624422   .2590171    -1.01   0.311    -.7705116    .2456272
    sales_growth |   .0405518   .0854863     0.47   0.635     -.127132    .2082355
  dividend_payer |   .0040459   .0530756     0.08   0.939    -.1000633    .1081551
             nol |  -.0005175   .0544436    -0.01   0.992    -.1073101    .1062751
         ret_vol |    .352372   .4080892     0.86   0.388    -.4481064     1.15285
       leveraged |  -.2569198   .0656806    -3.91   0.000     -.385754   -.1280855
   secured_dummy |   .2438684   .0568043     4.29   0.000     .1324453    .3552916
tranche_type_d~y |   .0090003   .0295791     0.30   0.761      -.04902    .0670206
tranche_o_a_du~y |  -.4390858   .0435128   -10.09   0.000    -.5244373   -.3537342
   sponsor_dummy |   .1241759   .0737116     1.68   0.092    -.0204114    .2687632
           _cons |   3.058635   .2041458    14.98   0.000     2.658197    3.459073
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m5

. 
. reghdfe maturity treated treated_post treated_loss treated_loss_post `controls' `
> deal_controls_2', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  19,   1518) =      20.70
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2943
                                                  Adj R-squared   =     0.2799
                                                  Within R-sq.    =     0.0981
Number of clusters (gvkey)   =      1,519         Root MSE        =     1.3624

                                  (Std. err. adjusted for 1,519 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
        maturity | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |  -.1219986   .1210356    -1.01   0.314    -.3594134    .1154162
    treated_post |   .0229699   .1484127     0.15   0.877    -.2681458    .3140856
    treated_loss |  -.0137845   .1125933    -0.12   0.903    -.2346393    .2070704
treated_l~s_post |  -.1535047   .1455014    -1.06   0.292    -.4389098    .1319004
          log_at |  -.0340326   .0209603    -1.62   0.105    -.0751468    .0070815
cash_flows_by_at |   .8410928   .4160464     2.02   0.043     .0250062    1.657179
  market_to_book |   .0166526   .0230371     0.72   0.470    -.0285354    .0618406
     ppent_by_at |  -.2001893   .1361177    -1.47   0.142     -.467188    .0668095
      debt_by_at |  -.3003003    .167538    -1.79   0.073    -.6289308    .0283302
      cash_by_at |   .1666294    .212608     0.78   0.433    -.2504071    .5836659
    sales_growth |   .0408761   .0930977     0.44   0.661    -.1417377    .2234898
  dividend_payer |  -.0837358   .0613209    -1.37   0.172    -.2040185    .0365468
             nol |   .1109325   .0635484     1.75   0.081    -.0137195    .2355844
         ret_vol |  -.8291876   .4916585    -1.69   0.092    -1.793589    .1352143
       leveraged |   .1393196   .0702903     1.98   0.048     .0014432    .2771959
   secured_dummy |   .6742118   .0604265    11.16   0.000     .5556836      .79274
tranche_type_d~y |   .0287044   .0562571     0.51   0.610    -.0816456    .1390543
tranche_o_a_du~y |   .3154094   .0550154     5.73   0.000     .2074952    .4233237
   sponsor_dummy |   .5731956   .0656386     8.73   0.000     .4444437    .7019475
           _cons |   4.355834    .217949    19.99   0.000     3.928321    4.783347
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m6

. 
. * save the results (esttab) using overleaf_dir
. esttab m1 m2 m3 m4 m5 m6 using "$overleaf_dir/other_terms_did_both_rule.tex", rep
> lace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant keep(treated tr
> eated_post treated_loss treated_loss_post)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/other_
> terms_did_both_rule.tex)

. est clear

. 
. *********** Dynamic Regressions ***********
. local dynamic_treated "treated_year_2014 treated_year_2015 treated_year_2016 trea
> ted_year_2018 treated_year_2019 treated_year_2020 treated_year_2021 treated_year_
> 2022 treated_year_2023"

. local dynamic_treated_loss "treated_loss_year_2014 treated_loss_year_2015 treated
> _loss_year_2016 treated_loss_year_2018 treated_loss_year_2019 treated_loss_year_2
> 020 treated_loss_year_2021 treated_loss_year_2022 treated_loss_year_2023"

. 
. *** Loss Rule ***
. reghdfe margin_bps treated_loss `dynamic_treated_loss' `controls' `deal_controls'
> , absorb(year ff_48 sp_rating_num) vce(cluster ff_48)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,712
Absorbing 3 HDFE groups                           F(  27,     48) =     180.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5481
                                                  Adj R-squared   =     0.5381
                                                  Within R-sq.    =     0.3907
Number of clusters (ff_48)   =         49         Root MSE        =   121.0449

                                     (Std. err. adjusted for 49 clusters in ff_48)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
    treated_loss |   17.65156   20.90865     0.84   0.403     -24.3881    59.69123
treated_loss_y~4 |   61.05299   31.11035     1.96   0.056    -1.498552    123.6045
treated_loss_y~5 |   10.02236   41.03127     0.24   0.808    -72.47653    92.52125
treated_loss_y~6 |   44.07433    26.8554     1.64   0.107    -9.922081    98.07074
treated_loss_y~8 |  -24.68505   31.11523    -0.79   0.431     -87.2464    37.87631
treated_loss_y~9 |  -46.83142   36.04995    -1.30   0.200    -119.3147    25.65186
treated_loss_y~0 |   29.73568    33.4259     0.89   0.378    -37.47161    96.94296
treated_loss_y~1 |  -29.76286   27.88515    -1.07   0.291    -85.82973      26.304
treated_loss_y~2 |   2.242917   33.39491     0.07   0.947    -64.90205    69.38788
treated_loss_y~3 |   12.59999   29.10358     0.43   0.667    -45.91667    71.11666
          log_at |  -5.255675   2.609838    -2.01   0.050    -10.50311   -.0082435
cash_flows_by_at |  -187.5826   84.19058    -2.23   0.031    -356.8591   -18.30609
  market_to_book |  -1.631653   4.600123    -0.35   0.724    -10.88082    7.617514
     ppent_by_at |    20.5786   16.87004     1.22   0.228    -13.34089    54.49809
      debt_by_at |    49.7839   14.38344     3.46   0.001     20.86405    78.70375
      cash_by_at |   53.74797    28.8078     1.87   0.068    -4.173998    111.6699
    sales_growth |  -3.931058   11.53578    -0.34   0.735    -27.12529    19.26318
  dividend_payer |   7.867859   6.763601     1.16   0.250    -5.731272    21.46699
             nol |  -4.581066   5.281256    -0.87   0.390    -15.19974     6.03761
         ret_vol |   200.6899   49.56166     4.05   0.000     101.0395    300.3403
       leveraged |   80.97798   12.24632     6.61   0.000      56.3551    105.6009
        maturity |   8.526879   2.615739     3.26   0.002     3.267584    13.78617
log_deal_amoun~d |  -16.06939    3.29489    -4.88   0.000    -22.69421   -9.444567
   secured_dummy |   64.55093   6.250205    10.33   0.000     51.98405    77.11781
tranche_type_d~y |   74.77005   10.24748     7.30   0.000     54.16611    95.37399
tranche_o_a_du~y |   10.08448   6.309078     1.60   0.117    -2.600774    22.76973
   sponsor_dummy |   86.33824   9.285471     9.30   0.000     67.66855    105.0079
           _cons |   184.9016   31.83964     5.81   0.000     120.8837    248.9195
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           1           9     |
         ff_48 |        49          49           0    *|
 sp_rating_num |        19           1          18     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$overleaf_dir/margin_did_dynamic_loss_ff48.csv", replace m
> lab(none)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/margin
> _did_dynamic_loss_ff48.csv)

. 
. * drop 2020 and re run the regression
. drop if year == 2020
(292 observations deleted)

. reghdfe margin_bps treated_loss `dynamic_treated_loss' `controls' `deal_controls'
> , absorb(year ff_48 sp_rating_num) vce(cluster ff_48)
(MWFE estimator converged in 7 iterations)
note: treated_loss_year_2020 omitted because of collinearity

HDFE Linear regression                            Number of obs   =      4,420
Absorbing 3 HDFE groups                           F(  26,     48) =     188.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5523
                                                  Adj R-squared   =     0.5419
                                                  Within R-sq.    =     0.3937
Number of clusters (ff_48)   =         49         Root MSE        =   118.7457

                                     (Std. err. adjusted for 49 clusters in ff_48)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
    treated_loss |   20.14029   20.92147     0.96   0.341    -21.92515    62.20573
treated_loss_y~4 |   59.43137   31.51733     1.89   0.065    -3.938471    122.8012
treated_loss_y~5 |   4.921907    39.5984     0.12   0.902    -74.69601    84.53983
treated_loss_y~6 |   43.46583   26.48056     1.64   0.107    -9.776899    96.70857
treated_loss_y~8 |  -23.72083   30.71004    -0.77   0.444    -85.46752    38.02585
treated_loss_y~9 |  -53.01962   34.66463    -1.53   0.133    -122.7175     16.6783
treated_loss_y~0 |          0  (omitted)
treated_loss_y~1 |  -28.84329   27.51713    -1.05   0.300    -84.17017     26.4836
treated_loss_y~2 |   2.181468   33.62117     0.06   0.949    -65.41843    69.78136
treated_loss_y~3 |   12.07287   29.16231     0.41   0.681    -46.56188    70.70762
          log_at |  -6.740724   2.639833    -2.55   0.014    -12.04846   -1.432984
cash_flows_by_at |  -194.6568   85.71903    -2.27   0.028    -367.0064   -22.30709
  market_to_book |  -1.449195   4.376086    -0.33   0.742    -10.24791    7.349516
     ppent_by_at |   17.52038   17.17456     1.02   0.313    -17.01138    52.05215
      debt_by_at |   50.22517   14.82657     3.39   0.001     20.41436    80.03599
      cash_by_at |   39.02277   30.07457     1.30   0.201    -21.44621    99.49174
    sales_growth |  -1.554443   11.23686    -0.14   0.891    -24.14767    21.03878
  dividend_payer |   7.502538   7.010268     1.07   0.290     -6.59255    21.59763
             nol |  -4.006564   4.962739    -0.81   0.423    -13.98482    5.971692
         ret_vol |   176.6143   49.77679     3.55   0.001     76.53134    276.6972
       leveraged |   77.05224   11.17888     6.89   0.000      54.5756    99.52887
        maturity |    9.79251    2.38288     4.11   0.000     5.001409    14.58361
log_deal_amoun~d |  -16.64329   3.073198    -5.42   0.000    -22.82237   -10.46421
   secured_dummy |   62.12922   6.282653     9.89   0.000      49.4971    74.76134
tranche_type_d~y |   72.07947   9.977323     7.22   0.000     52.01871    92.14022
tranche_o_a_du~y |   7.767188   6.119794     1.27   0.210    -4.537483    20.07186
   sponsor_dummy |   86.12299   9.176762     9.38   0.000     67.67187    104.5741
           _cons |   204.4529   31.38325     6.51   0.000     141.3526    267.5531
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           1           8     |
         ff_48 |        49          49           0    *|
 sp_rating_num |        19           1          18     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$overleaf_dir/margin_did_dynamic_loss_ff48_no2020.csv", re
> place mlab(none)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/margin
> _did_dynamic_loss_ff48_no2020.csv)

. 
. *** 30% Rule ***
. 
. reghdfe margin_bps treated `dynamic_treated' `controls' `deal_controls', absorb(y
> ear ff_48 sp_rating_num) vce(cluster ff_48)
(MWFE estimator converged in 7 iterations)
note: treated_year_2020 omitted because of collinearity

HDFE Linear regression                            Number of obs   =      4,420
Absorbing 3 HDFE groups                           F(  26,     48) =     193.36
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5479
                                                  Adj R-squared   =     0.5374
                                                  Within R-sq.    =     0.3877
Number of clusters (ff_48)   =         49         Root MSE        =   119.3322

                                     (Std. err. adjusted for 49 clusters in ff_48)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   30.93472   20.37343     1.52   0.135     -10.0288    71.89824
treated_yea~2014 |  -2.757162    27.1597    -0.10   0.920     -57.3654    51.85108
treated_yea~2015 |  -10.08459   34.63274    -0.29   0.772    -79.71839     59.5492
treated_yea~2016 |   18.55994    31.8577     0.58   0.563    -45.49426    82.61415
treated_yea~2018 |  -24.54966     24.371    -1.01   0.319    -73.55085    24.45152
treated_yea~2019 |  -1.246906   45.94521    -0.03   0.978    -93.62595    91.13213
treated_yea~2020 |          0  (omitted)
treated_yea~2021 |  -19.89885   32.18578    -0.62   0.539     -84.6127      44.815
treated_yea~2022 |  -1.668322   23.93028    -0.07   0.945    -49.78338    46.44674
treated_yea~2023 |  -2.500059   25.11761    -0.10   0.921    -53.00239    48.00227
          log_at |  -6.885181   2.790776    -2.47   0.017    -12.49641   -1.273949
cash_flows_by_at |  -190.8587    92.9721    -2.05   0.046    -377.7916   -3.925735
  market_to_book |  -1.254546   4.408384    -0.28   0.777     -10.1182    7.609105
     ppent_by_at |    20.1677   16.83462     1.20   0.237    -13.68057    54.01597
      debt_by_at |   37.59264     17.012     2.21   0.032     3.387721    71.79755
      cash_by_at |   32.33912   31.76339     1.02   0.314    -31.52546    96.20369
    sales_growth |   -.329633   11.33751    -0.03   0.977    -23.12523    22.46596
  dividend_payer |    6.18575   7.127124     0.87   0.390    -8.144293    20.51579
             nol |  -6.124192   4.863835    -1.26   0.214    -15.90359    3.655205
         ret_vol |   171.8121   50.68359     3.39   0.001      69.9059    273.7183
       leveraged |   75.20616   11.19778     6.72   0.000     52.69152     97.7208
        maturity |    9.87209   2.409377     4.10   0.000     5.027713    14.71647
log_deal_amoun~d |  -16.82622   3.041853    -5.53   0.000    -22.94227   -10.71016
   secured_dummy |   62.83641   6.561061     9.58   0.000     49.64452    76.02831
tranche_type_d~y |   72.29141   10.11361     7.15   0.000     51.95663    92.62618
tranche_o_a_du~y |   8.132499   6.161904     1.32   0.193     -4.25684    20.52184
   sponsor_dummy |    85.1799   9.745088     8.74   0.000     65.58609    104.7737
           _cons |   212.0567   31.51366     6.73   0.000     148.6942    275.4191
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           1           8     |
         ff_48 |        49          49           0    *|
 sp_rating_num |        19           1          18     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$overleaf_dir/margin_did_dynamic_ff48.csv", replace mlab(n
> one)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/margin
> _did_dynamic_ff48.csv)

. 
. reghdfe margin_bps treated `dynamic_treated' `controls' `deal_controls', absorb(y
> ear gvkey sp_rating_num) vce(cluster gvkey)
(dropped 472 singleton observations)
(MWFE estimator converged in 20 iterations)
note: treated_year_2020 omitted because of collinearity

HDFE Linear regression                            Number of obs   =      3,948
Absorbing 3 HDFE groups                           F(  26,   1009) =      24.00
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.7807
                                                  Adj R-squared   =     0.7002
                                                  Within R-sq.    =     0.2799
Number of clusters (gvkey)   =      1,010         Root MSE        =    94.8765

                                  (Std. err. adjusted for 1,010 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   17.69052   24.49999     0.72   0.470    -30.38624    65.76729
treated_yea~2014 |  -66.72685   30.19694    -2.21   0.027    -125.9829   -7.470852
treated_yea~2015 |  -22.86511   25.57994    -0.89   0.372    -73.06109    27.33087
treated_yea~2016 |   43.67145    42.7672     1.02   0.307     -40.2514    127.5943
treated_yea~2018 |  -21.25619   35.68727    -0.60   0.552    -91.28595    48.77358
treated_yea~2019 |   38.29282   41.63016     0.92   0.358    -43.39879    119.9844
treated_yea~2020 |          0  (omitted)
treated_yea~2021 |  -53.86523   27.03548    -1.99   0.047    -106.9174   -.8130262
treated_yea~2022 |   15.86575   27.17554     0.58   0.559     -37.4613    69.19281
treated_yea~2023 |  -5.499184   30.32568    -0.18   0.856     -65.0078    54.00944
          log_at |  -17.30005   9.590966    -1.80   0.072    -36.12057    1.520473
cash_flows_by_at |  -28.08267   68.48479    -0.41   0.682    -162.4716    106.3063
  market_to_book |  -9.478229   6.203357    -1.53   0.127    -21.65119     2.69473
     ppent_by_at |  -11.85322   63.57338    -0.19   0.852    -136.6044     112.898
      debt_by_at |   101.3251   36.66067     2.76   0.006     29.38524     173.265
      cash_by_at |  -86.25475   51.40301    -1.68   0.094    -187.1238     14.6143
    sales_growth |  -16.72032   16.14328    -1.04   0.301    -48.39856    14.95792
  dividend_payer |   23.94891    11.8507     2.02   0.044     .6940747    47.20375
             nol |    9.70414   12.91176     0.75   0.452    -15.63284    35.04112
         ret_vol |   139.9996   87.44332     1.60   0.110    -31.59201    311.5912
       leveraged |   80.99262   10.28303     7.88   0.000     60.81405    101.1712
        maturity |   12.78214   1.842533     6.94   0.000     9.166502    16.39777
log_deal_amoun~d |  -7.510318   3.623785    -2.07   0.038    -14.62134      -.3993
   secured_dummy |    36.6547   8.128443     4.51   0.000     20.70411    52.60529
tranche_type_d~y |   55.69332   4.114859    13.53   0.000     47.61866    63.76798
tranche_o_a_du~y |   4.687761   5.468701     0.86   0.392    -6.043567    15.41909
   sponsor_dummy |   100.1374   13.59778     7.36   0.000      73.4542    126.8205
           _cons |   225.7817    92.2301     2.45   0.015     44.79693    406.7665
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           1           8     |
         gvkey |      1010        1010           0    *|
 sp_rating_num |        18           1          17     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$overleaf_dir/margin_did_dynamic_gvkey.csv", replace mlab(
> none)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/margin
> _did_dynamic_gvkey.csv)

. 
. *********** Dynamic Regressions (num of financial covenants) ***********
. reghdfe num_fin_cov treated `dynamic_treated' `controls' `deal_controls', absorb(
> year ff_48 sp_rating_num) vce(cluster ff_48)
(MWFE estimator converged in 7 iterations)
note: treated_year_2020 omitted because of collinearity

HDFE Linear regression                            Number of obs   =      4,420
Absorbing 3 HDFE groups                           F(  26,     48) =      33.17
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1814
                                                  Adj R-squared   =     0.1624
                                                  Within R-sq.    =     0.0980
Number of clusters (ff_48)   =         49         Root MSE        =     0.7601

                                     (Std. err. adjusted for 49 clusters in ff_48)
----------------------------------------------------------------------------------
                 |               Robust
     num_fin_cov | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |  -.0191893   .1265401    -0.15   0.880    -.2736152    .2352365
treated_yea~2014 |   .1685996   .1606624     1.05   0.299    -.1544338    .4916331
treated_yea~2015 |  -.2427483   .1594989    -1.52   0.135    -.5634424    .0779457
treated_yea~2016 |  -.0591515   .1392437    -0.42   0.673    -.3391198    .2208168
treated_yea~2018 |  -.1074237   .1532048    -0.70   0.487    -.4154626    .2006151
treated_yea~2019 |  -.3844275   .1521163    -2.53   0.015    -.6902778   -.0785772
treated_yea~2020 |          0  (omitted)
treated_yea~2021 |   .0540021    .173486     0.31   0.757    -.2948149    .4028192
treated_yea~2022 |  -.1100174   .1745056    -0.63   0.531    -.4608845    .2408497
treated_yea~2023 |  -.0014098   .1557477    -0.01   0.993    -.3145616     .311742
          log_at |  -.1094879   .0158309    -6.92   0.000    -.1413181   -.0776577
cash_flows_by_at |   .6013373   .2803136     2.15   0.037      .037729    1.164945
  market_to_book |  -.0024278    .016992    -0.14   0.887    -.0365925    .0317368
     ppent_by_at |  -.0110314    .091761    -0.12   0.905    -.1955292    .1734663
      debt_by_at |  -.0211972   .0951707    -0.22   0.825    -.2125507    .1701563
      cash_by_at |  -.4475677   .1343573    -3.33   0.002    -.7177112   -.1774243
    sales_growth |  -.0019573   .0546345    -0.04   0.972    -.1118075    .1078928
  dividend_payer |   .0008593   .0463872     0.02   0.985    -.0924085    .0941271
             nol |   .0617435   .0367116     1.68   0.099    -.0120702    .1355572
         ret_vol |  -.0736382    .304214    -0.24   0.810    -.6853014     .538025
       leveraged |  -.2154411   .0560097    -3.85   0.000    -.3280561   -.1028261
        maturity |  -.0409558   .0086994    -4.71   0.000    -.0584472   -.0234644
log_deal_amoun~d |   .0914357   .0158288     5.78   0.000     .0596097    .1232616
   secured_dummy |   .1456429   .0390312     3.73   0.001     .0671655    .2241203
tranche_type_d~y |  -.0489114   .0199749    -2.45   0.018    -.0890736   -.0087492
tranche_o_a_du~y |  -.0284445   .0363182    -0.78   0.437    -.1014672    .0445782
   sponsor_dummy |  -.4282294    .037368   -11.46   0.000    -.5033627    -.353096
           _cons |   1.228425   .1486232     8.27   0.000     .9295975    1.527252
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           1           8     |
         ff_48 |        49          49           0    *|
 sp_rating_num |        19           1          18     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$overleaf_dir/num_fin_cov_did_dynamic_ff48.csv", replace m
> lab(none)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/num_fi
> n_cov_did_dynamic_ff48.csv)

. 
. reghdfe num_fin_cov treated `dynamic_treated' `controls' `deal_controls', absorb(
> year gvkey sp_rating_num) vce(cluster gvkey)
(dropped 472 singleton observations)
(MWFE estimator converged in 20 iterations)
note: treated_year_2020 omitted because of collinearity

HDFE Linear regression                            Number of obs   =      3,948
Absorbing 3 HDFE groups                           F(  26,   1009) =       3.61
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.7152
                                                  Adj R-squared   =     0.6106
                                                  Within R-sq.    =     0.0684
Number of clusters (gvkey)   =      1,010         Root MSE        =     0.5186

                                  (Std. err. adjusted for 1,010 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
     num_fin_cov | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |  -.0705096   .1460029    -0.48   0.629    -.3570137    .2159946
treated_yea~2014 |   .1951575    .199592     0.98   0.328    -.1965055    .5868204
treated_yea~2015 |  -.0063482   .2067627    -0.03   0.976    -.4120823    .3993859
treated_yea~2016 |   .0524902   .1745811     0.30   0.764    -.2900935    .3950739
treated_yea~2018 |   .1928709   .1855739     1.04   0.299     -.171284    .5570258
treated_yea~2019 |  -.1050208   .1668756    -0.63   0.529    -.4324837    .2224422
treated_yea~2020 |          0  (omitted)
treated_yea~2021 |   .1883651   .2018775     0.93   0.351    -.2077826    .5845129
treated_yea~2022 |  -.0523359   .1832748    -0.29   0.775    -.4119792    .3073075
treated_yea~2023 |   .3657001   .1784136     2.05   0.041     .0155958    .7158043
          log_at |  -.0143369   .0729757    -0.20   0.844    -.1575385    .1288647
cash_flows_by_at |  -.0705168   .5162388    -0.14   0.891    -1.083541    .9425079
  market_to_book |   .0455328   .0413623     1.10   0.271    -.0356331    .1266987
     ppent_by_at |   .0730401   .5263341     0.14   0.890    -.9597947    1.105875
      debt_by_at |  -.1347218   .2379237    -0.57   0.571    -.6016038    .3321602
      cash_by_at |   .1065983   .4259947     0.25   0.802    -.7293387    .9425352
    sales_growth |  -.0553564   .0947321    -0.58   0.559    -.2412509     .130538
  dividend_payer |  -.0623392   .0935976    -0.67   0.506    -.2460074    .1213291
             nol |  -.0882748   .1045437    -0.84   0.399    -.2934228    .1168732
         ret_vol |   .0866538    .604838     0.14   0.886    -1.100231    1.273538
       leveraged |  -.2009214   .0693027    -2.90   0.004    -.3369154   -.0649274
        maturity |  -.0074753   .0089359    -0.84   0.403    -.0250104    .0100598
log_deal_amoun~d |   .1172782   .0237299     4.94   0.000     .0707126    .1638439
   secured_dummy |   .1997356   .0555702     3.59   0.000     .0906892     .308782
tranche_type_d~y |   -.052274   .0159383    -3.28   0.001    -.0835501   -.0209979
tranche_o_a_du~y |  -.0083256   .0324937    -0.26   0.798    -.0720885    .0554373
   sponsor_dummy |  -.2689478   .0689089    -3.90   0.000    -.4041689   -.1337267
           _cons |   .0704215   .7025195     0.10   0.920    -1.308145    1.448988
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           1           8     |
         gvkey |      1010        1010           0    *|
 sp_rating_num |        18           1          17     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$overleaf_dir/num_fin_cov_did_dynamic_gvkey.csv", replace 
> mlab(none)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/num_fi
> n_cov_did_dynamic_gvkey.csv)

. 
. *********** Dynamic Regressions (perf_pricing_dummy) ***********
. reghdfe perf_pricing_dummy treated `dynamic_treated' `controls' `deal_controls', 
> absorb(year ff_48 sp_rating_num) vce(cluster ff_48)
(MWFE estimator converged in 7 iterations)
note: treated_year_2020 omitted because of collinearity

HDFE Linear regression                            Number of obs   =      4,420
Absorbing 3 HDFE groups                           F(  26,     48) =      27.32
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2204
                                                  Adj R-squared   =     0.2023
                                                  Within R-sq.    =     0.0841
Number of clusters (ff_48)   =         49         Root MSE        =     0.3938

                                     (Std. err. adjusted for 49 clusters in ff_48)
----------------------------------------------------------------------------------
                 |               Robust
perf_pricing_d~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   .1075887   .0377283     2.85   0.006     .0317309    .1834464
treated_yea~2014 |  -.1418082   .0550009    -2.58   0.013    -.2523948   -.0312216
treated_yea~2015 |  -.1504442   .0633251    -2.38   0.022    -.2777678   -.0231206
treated_yea~2016 |  -.0822205   .0680458    -1.21   0.233    -.2190358    .0545948
treated_yea~2018 |  -.1254387   .0593674    -2.11   0.040    -.2448048   -.0060725
treated_yea~2019 |  -.1014618   .0612407    -1.66   0.104    -.2245945     .021671
treated_yea~2020 |          0  (omitted)
treated_yea~2021 |  -.1252061   .0619428    -2.02   0.049    -.2497504   -.0006617
treated_yea~2022 |  -.1315711   .0482502    -2.73   0.009    -.2285846   -.0345576
treated_yea~2023 |  -.1080827   .0604343    -1.79   0.080     -.229594    .0134286
          log_at |  -.0197016   .0079072    -2.49   0.016       -.0356   -.0038032
cash_flows_by_at |   .2434605   .1293423     1.88   0.066    -.0165996    .5035206
  market_to_book |   .0153255    .007147     2.14   0.037     .0009555    .0296956
     ppent_by_at |  -.0570302   .0386704    -1.47   0.147    -.1347822    .0207218
      debt_by_at |  -.1341728   .0359834    -3.73   0.001    -.2065222   -.0618234
      cash_by_at |  -.1845453   .0767883    -2.40   0.020    -.3389385    -.030152
    sales_growth |   -.006956   .0258842    -0.27   0.789    -.0589997    .0450878
  dividend_payer |  -.0090182    .016576    -0.54   0.589    -.0423465    .0243102
             nol |   .0196965   .0162014     1.22   0.230    -.0128786    .0522716
         ret_vol |   .0342589   .1565059     0.22   0.828    -.2804174    .3489351
       leveraged |  -.1517122   .0263341    -5.76   0.000    -.2046604   -.0987639
        maturity |  -.0033879   .0064037    -0.53   0.599    -.0162633    .0094875
log_deal_amoun~d |   .0598647   .0075401     7.94   0.000     .0447043    .0750252
   secured_dummy |   .0756237    .021685     3.49   0.001      .032023    .1192244
tranche_type_d~y |  -.0754231   .0154729    -4.87   0.000    -.1065335   -.0443128
tranche_o_a_du~y |   .0891946   .0166542     5.36   0.000      .055709    .1226802
   sponsor_dummy |  -.0998478   .0201679    -4.95   0.000    -.1403981   -.0592975
           _cons |   .1201882   .0718978     1.67   0.101     -.024372    .2647485
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           1           8     |
         ff_48 |        49          49           0    *|
 sp_rating_num |        19           1          18     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$overleaf_dir/perf_pricing_dummy_did_dynamic_ff48.csv", re
> place mlab(none)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/perf_p
> ricing_dummy_did_dynamic_ff48.csv)

. 
. reghdfe perf_pricing_dummy treated `dynamic_treated' `controls' `deal_controls', 
> absorb(year gvkey sp_rating_num) vce(cluster gvkey)
(dropped 472 singleton observations)
(MWFE estimator converged in 20 iterations)
note: treated_year_2020 omitted because of collinearity

HDFE Linear regression                            Number of obs   =      3,948
Absorbing 3 HDFE groups                           F(  26,   1009) =       4.92
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5803
                                                  Adj R-squared   =     0.4262
                                                  Within R-sq.    =     0.0657
Number of clusters (gvkey)   =      1,010         Root MSE        =     0.3339

                                  (Std. err. adjusted for 1,010 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
perf_pricing_d~y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   .2036477   .0683611     2.98   0.003     .0695015    .3377938
treated_yea~2014 |  -.1589451   .0903833    -1.76   0.079    -.3363059    .0184156
treated_yea~2015 |  -.1610268   .1012648    -1.59   0.112    -.3597405    .0376869
treated_yea~2016 |  -.1367708   .0913619    -1.50   0.135    -.3160519    .0425103
treated_yea~2018 |   -.157636   .0847606    -1.86   0.063    -.3239632    .0086913
treated_yea~2019 |  -.1168454    .086238    -1.35   0.176    -.2860717    .0523809
treated_yea~2020 |          0  (omitted)
treated_yea~2021 |  -.1405276   .0954577    -1.47   0.141    -.3278461    .0467908
treated_yea~2022 |  -.1134192   .0887485    -1.28   0.202     -.287572    .0607335
treated_yea~2023 |  -.1184909   .1130845    -1.05   0.295    -.3403986    .1034168
          log_at |    .045231   .0348947     1.30   0.195    -.0232434    .1137054
cash_flows_by_at |   .1903195   .2808552     0.68   0.498    -.3608077    .7414468
  market_to_book |   .0265472    .023032     1.15   0.249    -.0186488    .0717433
     ppent_by_at |   .1872308   .2545345     0.74   0.462    -.3122467    .6867083
      debt_by_at |  -.1666655   .1078729    -1.55   0.123    -.3783464    .0450154
      cash_by_at |   .2945287   .1800848     1.64   0.102    -.0588549    .6479122
    sales_growth |  -.0132099   .0581985    -0.23   0.820    -.1274138     .100994
  dividend_payer |   .0242422   .0572173     0.42   0.672    -.0880364    .1365208
             nol |   .0030504   .0561789     0.05   0.957    -.1071904    .1132913
         ret_vol |   .4254373   .2775611     1.53   0.126    -.1192257    .9701003
       leveraged |  -.1302345   .0376598    -3.46   0.001     -.204135    -.056334
        maturity |   .0129463   .0064197     2.02   0.044     .0003488    .0255438
log_deal_amoun~d |    .059958   .0128655     4.66   0.000     .0347119    .0852042
   secured_dummy |   .0810219   .0313484     2.58   0.010     .0195064    .1425374
tranche_type_d~y |  -.0751332   .0132664    -5.66   0.000    -.1011661   -.0491003
tranche_o_a_du~y |   .0838386   .0218296     3.84   0.000     .0410019    .1266752
   sponsor_dummy |  -.0971251   .0368778    -2.63   0.009    -.1694911   -.0247592
           _cons |   -.697472   .3141555    -2.22   0.027    -1.313945    -.080999
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           1           8     |
         gvkey |      1010        1010           0    *|
 sp_rating_num |        18           1          17     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$overleaf_dir/perf_pricing_dummy_did_dynamic_gvkey.csv", r
> eplace mlab(none)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/perf_p
> ricing_dummy_did_dynamic_gvkey.csv)

. 
. *********** Dynamic Regressions (sweep_dummy) ***********
. reghdfe sweep_dummy treated `dynamic_treated' `controls' `deal_controls', absorb(
> year ff_48 sp_rating_num) vce(cluster ff_48)
(MWFE estimator converged in 7 iterations)
note: treated_year_2020 omitted because of collinearity

HDFE Linear regression                            Number of obs   =      4,420
Absorbing 3 HDFE groups                           F(  26,     48) =       9.64
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.2449
                                                  Adj R-squared   =     0.2275
                                                  Within R-sq.    =     0.0623
Number of clusters (ff_48)   =         49         Root MSE        =     0.2564

                                     (Std. err. adjusted for 49 clusters in ff_48)
----------------------------------------------------------------------------------
                 |               Robust
     sweep_dummy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   .0676695   .0440279     1.54   0.131    -.0208544    .1561934
treated_yea~2014 |  -.0136442   .0770248    -0.18   0.860    -.1685129    .1412245
treated_yea~2015 |   .0012707   .0781399     0.02   0.987    -.1558401    .1583816
treated_yea~2016 |   .0044687   .0615587     0.07   0.942    -.1193034    .1282408
treated_yea~2018 |  -.0892537   .0533536    -1.67   0.101    -.1965283    .0180208
treated_yea~2019 |  -.0787151   .0621079    -1.27   0.211    -.2035914    .0461611
treated_yea~2020 |          0  (omitted)
treated_yea~2021 |  -.1354121   .0549128    -2.47   0.017    -.2458218   -.0250024
treated_yea~2022 |   -.129154   .0579285    -2.23   0.030    -.2456271   -.0126808
treated_yea~2023 |  -.0890969   .0547926    -1.63   0.110    -.1992647    .0210709
          log_at |  -.0246479   .0049377    -4.99   0.000    -.0345759   -.0147199
cash_flows_by_at |   .0820872     .09888     0.83   0.411    -.1167244    .2808987
  market_to_book |  -.0054587    .007022    -0.78   0.441    -.0195774      .00866
     ppent_by_at |  -.0098035   .0319655    -0.31   0.760    -.0740743    .0544674
      debt_by_at |   .0062188   .0274606     0.23   0.822    -.0489943     .061432
      cash_by_at |   .0792432   .0618926     1.28   0.207    -.0452003    .2036866
    sales_growth |   .0124247    .025543     0.49   0.629     -.038933    .0637823
  dividend_payer |  -.0023285   .0137836    -0.17   0.867    -.0300423    .0253852
             nol |   .0089666   .0139264     0.64   0.523    -.0190344    .0369675
         ret_vol |  -.2489929   .1147939    -2.17   0.035    -.4798016   -.0181843
       leveraged |   .0324228   .0223532     1.45   0.153    -.0125214    .0773669
        maturity |   -.014359   .0032155    -4.47   0.000    -.0208242   -.0078938
log_deal_amoun~d |   .0264277   .0054182     4.88   0.000     .0155337    .0373217
   secured_dummy |   .1087133   .0209296     5.19   0.000     .0666315    .1507951
tranche_type_d~y |   .0217931   .0159251     1.37   0.178    -.0102264    .0538127
tranche_o_a_du~y |   .0118589   .0130336     0.91   0.367     -.014347    .0380647
   sponsor_dummy |   -.056803   .0257833    -2.20   0.032    -.1086438   -.0049622
           _cons |   .1232962   .0551628     2.24   0.030      .012384    .2342084
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           1           8     |
         ff_48 |        49          49           0    *|
 sp_rating_num |        19           1          18     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$overleaf_dir/sweep_dummy_did_dynamic_ff48.csv", replace m
> lab(none)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/sweep_
> dummy_did_dynamic_ff48.csv)

. 
. reghdfe sweep_dummy treated `dynamic_treated' `controls' `deal_controls', absorb(
> year gvkey sp_rating_num) vce(cluster gvkey)
(dropped 472 singleton observations)
(MWFE estimator converged in 20 iterations)
note: treated_year_2020 omitted because of collinearity

HDFE Linear regression                            Number of obs   =      3,948
Absorbing 3 HDFE groups                           F(  26,   1009) =       2.85
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6811
                                                  Adj R-squared   =     0.5641
                                                  Within R-sq.    =     0.0598
Number of clusters (gvkey)   =      1,010         Root MSE        =     0.1968

                                  (Std. err. adjusted for 1,010 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
     sweep_dummy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   .0587683   .0797449     0.74   0.461    -.0977165    .2152532
treated_yea~2014 |   .0577237   .1053655     0.55   0.584    -.1490369    .2644843
treated_yea~2015 |   .0109108   .1273533     0.09   0.932     -.238997    .2608185
treated_yea~2016 |  -.0481574   .1238462    -0.39   0.697    -.2911831    .1948683
treated_yea~2018 |  -.0204957   .0993143    -0.21   0.837    -.2153819    .1743904
treated_yea~2019 |  -.0302809   .1006893    -0.30   0.764    -.2278654    .1673036
treated_yea~2020 |          0  (omitted)
treated_yea~2021 |  -.0673409   .0892687    -0.75   0.451    -.2425145    .1078328
treated_yea~2022 |  -.1280152   .1002755    -1.28   0.202    -.3247876    .0687572
treated_yea~2023 |   .0151472   .0882523     0.17   0.864    -.1580318    .1883263
          log_at |  -.0238796   .0282736    -0.84   0.399    -.0793614    .0316021
cash_flows_by_at |   .2263443   .2113971     1.07   0.285     -.188484    .6411727
  market_to_book |  -.0045957   .0137304    -0.33   0.738     -.031539    .0223477
     ppent_by_at |  -.0920118   .1912488    -0.48   0.631    -.4673028    .2832793
      debt_by_at |  -.0196624   .1031863    -0.19   0.849    -.2221467    .1828218
      cash_by_at |   .1871201   .1596743     1.17   0.242    -.1262117    .5004518
    sales_growth |  -.0182392   .0466521    -0.39   0.696    -.1097854    .0733071
  dividend_payer |  -.0290123   .0411911    -0.70   0.481    -.1098423    .0518178
             nol |  -.0570583    .038093    -1.50   0.134    -.1318089    .0176923
         ret_vol |  -.1347963    .215344    -0.63   0.531    -.5573697    .2877771
       leveraged |   .0198912   .0290565     0.68   0.494    -.0371268    .0769092
        maturity |  -.0118799   .0035544    -3.34   0.001    -.0188548   -.0049049
log_deal_amoun~d |   .0334873   .0083261     4.02   0.000     .0171489    .0498257
   secured_dummy |   .1173253   .0238912     4.91   0.000     .0704433    .1642073
tranche_type_d~y |   .0194149   .0059176     3.28   0.001     .0078025    .0310272
tranche_o_a_du~y |   .0144067   .0122587     1.18   0.240    -.0096488    .0384623
   sponsor_dummy |  -.0313147   .0313704    -1.00   0.318    -.0928733     .030244
           _cons |   .1113527   .2625635     0.42   0.672    -.4038803    .6265857
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           1           8     |
         gvkey |      1010        1010           0    *|
 sp_rating_num |        18           1          17     |
-------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. mat c = e(b)'

. mata st_matrix("srdvcovbt",sqrt(diagonal(st_matrix("e(V)"))))

. mat res = c , srdvcovbt

. 
. esttab mat(res) using "$overleaf_dir/sweep_dummy_did_dynamic_gvkey.csv", replace 
> mlab(none)
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/sweep_
> dummy_did_dynamic_gvkey.csv)

. 
. *********** Binscatters ***********
. * binscatters
. binscatter margin_bps year, by(treated_loss) controls(`controls' `deal_controls' 
> i.ff_48 i.sp_rating_num) legend(label(1 "Control (Loss rule)") label(2 "Treated (
> Loss rule)") position(1) ring(0)) msymbol(o X) mcolor(blue red) lcolor(blue red) 
> ///
> xtitle("Year") ytitle("Interest Spread (Basis Points)") xline(2018) xlabel(2014(1
> )2023) savegraph("$fig_dir/binscatter_margin_bps_treated_loss.png") replace
file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A
    Debt/Figures/binscatter_margin_bps_treated_loss.png saved as PNG format

. 
. binscatter log_margin_bps year, by(treated_loss) controls(`controls' `deal_contro
> ls' i.ff_48 i.sp_rating_num) legend(label(1 "Control (Loss rule)") label(2 "Treat
> ed (Loss rule)") position(1) ring(0)) msymbol(o X) mcolor(blue red) lcolor(blue r
> ed) ///
> xtitle("Year") ytitle("Log Interest Spread") xline(2018) xlabel(2014(1)2023) save
> graph("$fig_dir/binscatter_log_margin_bps_treated_loss.png") replace
file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A
    Debt/Figures/binscatter_log_margin_bps_treated_loss.png saved as PNG format

. 
. binscatter margin_bps year, by(treated) controls(`controls' `deal_controls' i.ff_
> 48 i.sp_rating_num) legend(label(1 "Control (30% rule)") label(2 "Treated (30% ru
> le)") position(1) ring(0)) msymbol(o X) mcolor(blue red) lcolor(blue red) ///
> xtitle("Year") ytitle("Interest Spread (Basis Points)") xline(2018) xlabel(2014(1
> )2023) savegraph("$fig_dir/binscatter_margin_bps_treated.png") replace
file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A
    Debt/Figures/binscatter_margin_bps_treated.png saved as PNG format

. 
. binscatter log_margin_bps year, by(treated) controls(`controls' `deal_controls' i
> .ff_48 i.sp_rating_num) legend(label(1 "Control (30% rule)") label(2 "Treated (30
> % rule)") position(1) ring(0)) msymbol(o X) mcolor(blue red) lcolor(blue red) ///
> xtitle("Year") ytitle("Log Interest Spread") xline(2018) xlabel(2014(1)2023) save
> graph("$fig_dir/binscatter_log_margin_bps_treated.png") replace
file /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A
    Debt/Figures/binscatter_log_margin_bps_treated.png saved as PNG format

. 
. /***********
>         Mechanism Tests
>         ***********/
.         
.         *** Relationship Lending
. gen treated_relationship = treated * relationship

. gen treated_loss_relationship = treated_loss * relationship

. gen post_relationship = post * relationship

. gen treated_post_relationship = treated_relationship * post

. gen treated_loss_post_relationship = treated_loss_relationship * post

. 
. local controls "log_at cash_flows_by_at market_to_book ppent_by_at debt_by_at cas
> h_by_at sales_growth dividend_payer nol ret_vol"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dummy t
> ranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. local treat_vars "treated treated_post treated_loss treated_loss_post"

. local relationship_vars "relationship post_relationship treated_relationship trea
> ted_post_relationship treated_loss_relationship treated_loss_post_relationship"

. 
. reghdfe margin_bps `treat_vars' `relationship_vars' `controls' `deal_controls', a
> bsorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,420
Absorbing 3 HDFE groups                           F(  27,   1480) =      58.42
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5572
                                                  Adj R-squared   =     0.5468
                                                  Within R-sq.    =     0.4003
Number of clusters (gvkey)   =      1,481         Root MSE        =   118.1074

                                  (Std. err. adjusted for 1,481 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   18.00106   17.23681     1.04   0.296    -15.81012    51.81224
    treated_post |   19.06232   22.12479     0.86   0.389    -24.33697    62.46161
    treated_loss |   53.19441   16.37819     3.25   0.001     21.06748    85.32133
treated_l~s_post |  -60.49292   21.96148    -2.75   0.006    -103.5719   -17.41399
    relationship |  -18.30678   7.168731    -2.55   0.011    -32.36873   -4.244824
post_relations~p |   3.546183   9.200066     0.39   0.700    -14.50037    21.59274
treated_relati~p |  -16.81956   21.85946    -0.77   0.442    -59.69838    26.05927
treated_post_r~p |  -12.72135   29.11189    -0.44   0.662    -69.82631    44.38361
treated_loss_r~p |  -35.56066   22.67137    -1.57   0.117     -80.0321    8.910783
treated_loss_p~p |   26.46559   29.80175     0.89   0.375    -31.99257    84.92375
          log_at |  -6.103198    2.43011    -2.51   0.012    -10.87002   -1.336372
cash_flows_by_at |  -169.0986   54.63118    -3.10   0.002    -276.2614   -61.93584
  market_to_book |  -1.894391   3.500988    -0.54   0.589    -8.761818    4.973036
     ppent_by_at |   15.11642   14.84818     1.02   0.309    -14.00929    44.24213
      debt_by_at |   43.38426   17.46422     2.48   0.013        9.127    77.64152
      cash_by_at |   23.99046   24.84737     0.97   0.334    -24.74936    72.73027
    sales_growth |   1.630891   11.27798     0.14   0.885    -20.49164    23.75343
  dividend_payer |    6.74213   5.824051     1.16   0.247    -4.682143     18.1664
             nol |  -4.725999   5.698874    -0.83   0.407    -15.90473    6.452731
         ret_vol |   154.1921   56.78427     2.72   0.007     42.80584    265.5783
       leveraged |   75.50826    7.96291     9.48   0.000     59.88847    91.12805
        maturity |   9.961806   1.880137     5.30   0.000     6.273789    13.64982
log_deal_amoun~d |  -14.73802   2.677064    -5.51   0.000    -19.98926   -9.486773
   secured_dummy |   61.52706   6.659308     9.24   0.000     48.46437    74.58974
tranche_type_d~y |   72.39594   4.193042    17.27   0.000     64.17101    80.62088
tranche_o_a_du~y |   7.982435   5.670584     1.41   0.159    -3.140803    19.10567
   sponsor_dummy |   82.98155   8.631936     9.61   0.000     66.04942    99.91369
           _cons |    197.175   26.13626     7.54   0.000     145.9069     248.443
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           0           9     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m1

. reghdfe log_margin_bps `treat_vars' `relationship_vars' `controls' `deal_controls
> ', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,420
Absorbing 3 HDFE groups                           F(  27,   1480) =      98.38
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6931
                                                  Adj R-squared   =     0.6859
                                                  Within R-sq.    =     0.5277
Number of clusters (gvkey)   =      1,481         Root MSE        =     0.3439

                                  (Std. err. adjusted for 1,481 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
  log_margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   .0208782   .0502506     0.42   0.678    -.0776919    .1194482
    treated_post |   .1114878    .061402     1.82   0.070    -.0089564     .231932
    treated_loss |   .1350001   .0438855     3.08   0.002     .0489156    .2210846
treated_l~s_post |  -.1522747    .058427    -2.61   0.009    -.2668832   -.0376661
    relationship |  -.0714483   .0231104    -3.09   0.002    -.1167809   -.0261158
post_relations~p |   .0333946   .0299819     1.11   0.266     -.025417    .0922062
treated_relati~p |  -.0007948   .0625833    -0.01   0.990    -.1235563    .1219666
treated_post_r~p |   -.068566   .0846802    -0.81   0.418     -.234672      .09754
treated_loss_r~p |  -.0832803   .0613824    -1.36   0.175    -.2036861    .0371255
treated_loss_p~p |   .0503285   .0850394     0.59   0.554    -.1164822    .2171391
          log_at |    -.03256   .0075447    -4.32   0.000    -.0473594   -.0177606
cash_flows_by_at |  -.4858767   .1532453    -3.17   0.002    -.7864778   -.1852755
  market_to_book |   -.026908    .011004    -2.45   0.015    -.0484931    -.005323
     ppent_by_at |   .0470786   .0438863     1.07   0.284    -.0390073    .1331645
      debt_by_at |    .156604   .0497937     3.15   0.002     .0589303    .2542777
      cash_by_at |   .1316282   .0746447     1.76   0.078    -.0147924    .2780488
    sales_growth |   .0343321   .0308856     1.11   0.266    -.0262521    .0949164
  dividend_payer |    .021076   .0174164     1.21   0.226    -.0130876    .0552395
             nol |  -.0077863    .017441    -0.45   0.655     -.041998    .0264254
         ret_vol |   .4294417   .1609348     2.67   0.008     .1137572    .7451263
       leveraged |   .4580142   .0255472    17.93   0.000     .4079016    .5081269
        maturity |   .0456622   .0055509     8.23   0.000     .0347738    .0565506
log_deal_amoun~d |  -.0405599   .0084599    -4.79   0.000    -.0571546   -.0239652
   secured_dummy |   .1708956   .0202258     8.45   0.000     .1312212    .2105699
tranche_type_d~y |   .2048897   .0126667    16.18   0.000     .1800431    .2297362
tranche_o_a_du~y |   .0145103   .0168447     0.86   0.389    -.0185318    .0475524
   sponsor_dummy |   .2618372    .025329    10.34   0.000     .2121526    .3115218
           _cons |   5.079825    .080801    62.87   0.000     4.921329    5.238322
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           0           9     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m2

. reghdfe margin_bps treated_loss treated_loss_post relationship post_relationship 
> treated_loss_relationship treated_loss_post_relationship `controls' `deal_control
> s', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,420
Absorbing 3 HDFE groups                           F(  23,   1480) =      66.95
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5555
                                                  Adj R-squared   =     0.5455
                                                  Within R-sq.    =     0.3980
Number of clusters (gvkey)   =      1,481         Root MSE        =   118.2833

                                  (Std. err. adjusted for 1,481 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
    treated_loss |   58.64158   14.77321     3.97   0.000     29.66293    87.62024
treated_l~s_post |   -49.2594   19.05766    -2.58   0.010    -86.64231    -11.8765
    relationship |  -20.49298   7.063874    -2.90   0.004    -34.34925   -6.636706
post_relations~p |   2.837506   9.126211     0.31   0.756    -15.06418    20.73919
treated_loss_r~p |  -43.99344   21.02325    -2.09   0.037    -85.23198   -2.754906
treated_loss_p~p |   17.93639   27.35762     0.66   0.512    -35.72744    71.60022
          log_at |  -6.075767   2.435807    -2.49   0.013    -10.85377   -1.297765
cash_flows_by_at |  -194.7134   52.52677    -3.71   0.000    -297.7483   -91.67861
  market_to_book |     -2.056   3.525881    -0.58   0.560    -8.972256    4.860257
     ppent_by_at |    15.6557   15.01982     1.04   0.297    -13.80669     45.1181
      debt_by_at |   54.82272   17.12184     3.20   0.001     21.23707    88.40837
      cash_by_at |   31.37424   24.49503     1.28   0.200    -16.67443    79.42291
    sales_growth |   1.603898   11.19861     0.14   0.886    -20.36294    23.57074
  dividend_payer |   6.354979   5.850583     1.09   0.278    -5.121338     17.8313
             nol |  -4.223553   5.744984    -0.74   0.462    -15.49273    7.045625
         ret_vol |   164.6761   56.43935     2.92   0.004     53.96646    275.3857
       leveraged |   75.98685   8.059714     9.43   0.000     60.17717    91.79653
        maturity |   9.833944   1.886787     5.21   0.000     6.132883      13.535
log_deal_amoun~d |  -15.34128   2.659966    -5.77   0.000    -20.55899   -10.12358
   secured_dummy |   61.07205   6.680914     9.14   0.000     47.96698    74.17712
tranche_type_d~y |   72.24295   4.194509    17.22   0.000     64.01514    80.47076
tranche_o_a_du~y |   7.255369   5.753003     1.26   0.207     -4.02954    18.54028
   sponsor_dummy |   82.66659   8.631555     9.58   0.000      65.7352    99.59797
           _cons |   202.3506   26.46036     7.65   0.000     150.4468    254.2544
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           0           9     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m3

. reghdfe log_margin_bps treated_loss treated_loss_post relationship post_relations
> hip treated_loss_relationship  treated_loss_post_relationship `controls' `deal_co
> ntrols', absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,420
Absorbing 3 HDFE groups                           F(  23,   1480) =     113.59
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6914
                                                  Adj R-squared   =     0.6844
                                                  Within R-sq.    =     0.5251
Number of clusters (gvkey)   =      1,481         Root MSE        =     0.3447

                                  (Std. err. adjusted for 1,481 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
  log_margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
    treated_loss |   .1307496   .0387664     3.37   0.001     .0547067    .2067925
treated_l~s_post |  -.0882026   .0505964    -1.74   0.081    -.1874509    .0110458
    relationship |  -.0714597   .0227627    -3.14   0.002    -.1161104   -.0268091
post_relations~p |   .0256807   .0295938     0.87   0.386    -.0323695    .0837309
treated_loss_r~p |  -.0809927   .0548478    -1.48   0.140    -.1885805    .0265951
treated_loss_p~p |   .0061449   .0752403     0.08   0.935     -.141444    .1537338
          log_at |  -.0323013   .0075007    -4.31   0.000    -.0470145   -.0175882
cash_flows_by_at |    -.56318   .1483008    -3.80   0.000    -.8540821   -.2722779
  market_to_book |  -.0275888   .0110784    -2.49   0.013    -.0493199   -.0058578
     ppent_by_at |   .0481656   .0442666     1.09   0.277    -.0386663    .1349975
      debt_by_at |    .194391   .0477045     4.07   0.000     .1008154    .2879666
      cash_by_at |   .1585038   .0735446     2.16   0.031     .0142411    .3027666
    sales_growth |   .0327866   .0307278     1.07   0.286    -.0274881    .0930613
  dividend_payer |   .0199071   .0174938     1.14   0.255    -.0144081    .0542223
             nol |  -.0066747   .0175403    -0.38   0.704    -.0410811    .0277318
         ret_vol |   .4717669   .1620578     2.91   0.004     .1538795    .7896544
       leveraged |   .4614104   .0257692    17.91   0.000     .4108623    .5119585
        maturity |   .0453499   .0055835     8.12   0.000     .0343974    .0563024
log_deal_amoun~d |  -.0426647    .008358    -5.10   0.000    -.0590595     -.02627
   secured_dummy |   .1693142   .0203087     8.34   0.000     .1294772    .2091512
tranche_type_d~y |   .2041459   .0126957    16.08   0.000     .1792423    .2290494
tranche_o_a_du~y |   .0112721   .0170271     0.66   0.508    -.0221278     .044672
   sponsor_dummy |    .260387   .0253789    10.26   0.000     .2106046    .3101695
           _cons |   5.093127   .0813577    62.60   0.000     4.933539    5.252716
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           0           9     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m4

. 
. * save the results (esttab) using overleaf_dir
. esttab m1 m2 m3 m4 using "$overleaf_dir/margin_did_both_rule_relationship.tex", r
> eplace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant keep(`treat_var
> s' `relationship_vars')
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/margin
> _did_both_rule_relationship.tex)

. est clear

. 
.         *** Reputation
. gen treated_reputation = treated * reputation

. gen treated_loss_reputation = treated_loss * reputation

. gen post_reputation = post * reputation

. gen treated_post_reputation = treated_reputation * post

. gen treated_loss_post_reputation = treated_loss_reputation * post       

.         
. local reputation_vars "reputation post_reputation treated_reputation treated_post
> _reputation treated_loss_reputation treated_loss_post_reputation"

. 
. reghdfe margin_bps `treat_vars' `reputation_vars' `controls' `deal_controls', abs
> orb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,420
Absorbing 3 HDFE groups                           F(  27,   1480) =      56.53
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5680
                                                  Adj R-squared   =     0.5579
                                                  Within R-sq.    =     0.4149
Number of clusters (gvkey)   =      1,481         Root MSE        =   116.6615

                                  (Std. err. adjusted for 1,481 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   12.78003   18.12738     0.71   0.481    -22.77807    48.33813
    treated_post |   12.31223    26.2013     0.47   0.638     -39.0834    63.70786
    treated_loss |     63.362   19.27745     3.29   0.001     25.54798     101.176
treated_l~s_post |  -46.39387   27.56886    -1.68   0.093    -100.4721     7.68433
      reputation |  -44.97969   8.175843    -5.50   0.000    -61.01716   -28.94221
 post_reputation |   35.38559   10.65693     3.32   0.001      14.4813    56.28987
treated_reputa~n |  -17.65589   21.89337    -0.81   0.420    -60.60122    25.28944
treated_post_r~n |   19.49952   31.12472     0.63   0.531    -41.55374    80.55278
treated_loss_r~n |  -53.78058   22.91485    -2.35   0.019    -98.72963   -8.831532
treated_loss_p~n |   4.580852   31.73036     0.14   0.885    -57.66041    66.82212
          log_at |  -6.949568   2.410757    -2.88   0.004    -11.67843   -2.220705
cash_flows_by_at |  -147.0359   54.74835    -2.69   0.007    -254.4285   -39.64323
  market_to_book |  -1.933449   3.482728    -0.56   0.579    -8.765059     4.89816
     ppent_by_at |   17.88824   14.70046     1.22   0.224    -10.94771    46.72419
      debt_by_at |   39.36671   17.68028     2.23   0.026     4.685627    74.04779
      cash_by_at |    26.4494   24.81148     1.07   0.287    -22.22001    75.11881
    sales_growth |  -2.599836   11.18801    -0.23   0.816    -24.54588    19.34621
  dividend_payer |   7.602849   5.852098     1.30   0.194     -3.87644    19.08214
             nol |    -5.6012   5.653005    -0.99   0.322    -16.68996    5.487555
         ret_vol |   161.5012   56.62713     2.85   0.004     50.42326    272.5792
       leveraged |   77.54581   7.743843    10.01   0.000     62.35573    92.73589
        maturity |   9.299833   1.874779     4.96   0.000     5.622327    12.97734
log_deal_amoun~d |  -14.05328   2.575645    -5.46   0.000    -19.10558   -9.000973
   secured_dummy |    55.9466   6.474947     8.64   0.000     43.24555    68.64765
tranche_type_d~y |   68.18246   4.087783    16.68   0.000     60.16399    76.20092
tranche_o_a_du~y |   5.579826   5.565051     1.00   0.316    -5.336401    16.49605
   sponsor_dummy |   81.22177   8.469139     9.59   0.000     64.60898    97.83457
           _cons |   215.0249   26.28893     8.18   0.000     163.4574    266.5924
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           0           9     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m1

. reghdfe log_margin_bps `treat_vars' `reputation_vars' `controls' `deal_controls',
>  absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,420
Absorbing 3 HDFE groups                           F(  27,   1480) =      93.96
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6994
                                                  Adj R-squared   =     0.6923
                                                  Within R-sq.    =     0.5374
Number of clusters (gvkey)   =      1,481         Root MSE        =     0.3404

                                  (Std. err. adjusted for 1,481 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
  log_margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   .0243577   .0480231     0.51   0.612    -.0698429    .1185583
    treated_post |   .0817553   .0689133     1.19   0.236    -.0534229    .2169334
    treated_loss |   .1207884   .0487459     2.48   0.013       .02517    .2164069
treated_l~s_post |  -.0819286   .0720545    -1.14   0.256    -.2232684    .0594112
      reputation |  -.1539705   .0255038    -6.04   0.000    -.2039979   -.1039431
 post_reputation |   .1348814   .0334751     4.03   0.000     .0692176    .2005452
treated_reputa~n |  -.0500109   .0634256    -0.79   0.431    -.1744245    .0744027
treated_post_r~n |   .0535914   .0885246     0.61   0.545    -.1200557    .2272385
treated_loss_r~n |  -.0473096    .062442    -0.76   0.449    -.1697937    .0751746
treated_loss_p~n |  -.0764124   .0875869    -0.87   0.383      -.24822    .0953952
          log_at |  -.0348646   .0075938    -4.59   0.000    -.0497603   -.0199689
cash_flows_by_at |   -.435684   .1534285    -2.84   0.005    -.7366444   -.1347236
  market_to_book |  -.0266731   .0109528    -2.44   0.015    -.0481578   -.0051885
     ppent_by_at |    .052633   .0432013     1.22   0.223    -.0321094    .1373753
      debt_by_at |   .1407336   .0504086     2.79   0.005     .0418536    .2396135
      cash_by_at |   .1440919   .0748032     1.93   0.054    -.0026396    .2908234
    sales_growth |   .0232413   .0303834     0.76   0.444    -.0363578    .0828404
  dividend_payer |   .0237228   .0173894     1.36   0.173    -.0103876    .0578333
             nol |   -.010143   .0174694    -0.58   0.562    -.0444103    .0241244
         ret_vol |   .4557611   .1609389     2.83   0.005     .1400685    .7714537
       leveraged |   .4636461   .0248716    18.64   0.000     .4148587    .5124336
        maturity |    .043903   .0055622     7.89   0.000     .0329923    .0548137
log_deal_amoun~d |  -.0384831   .0082044    -4.69   0.000    -.0545766   -.0223895
   secured_dummy |   .1565405   .0195651     8.00   0.000     .1181622    .1949189
tranche_type_d~y |   .1935752   .0125146    15.47   0.000      .169027    .2181235
tranche_o_a_du~y |   .0086951   .0165958     0.52   0.600    -.0238587    .0412489
   sponsor_dummy |    .257256   .0246674    10.43   0.000     .2088694    .3056427
           _cons |   5.129642   .0811814    63.19   0.000     4.970399    5.288885
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           0           9     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m2

. reghdfe margin_bps treated_loss treated_loss_post reputation post_reputation trea
> ted_loss_reputation treated_loss_post_reputation `controls' `deal_controls', abso
> rb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,420
Absorbing 3 HDFE groups                           F(  23,   1480) =      64.63
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5668
                                                  Adj R-squared   =     0.5570
                                                  Within R-sq.    =     0.4133
Number of clusters (gvkey)   =      1,481         Root MSE        =   116.7719

                                  (Std. err. adjusted for 1,481 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
    treated_loss |    66.6883   17.32979     3.85   0.000     32.69474    100.6819
treated_l~s_post |  -38.78449   22.44655    -1.73   0.084    -82.81492    5.245952
      reputation |  -46.71807   7.923628    -5.90   0.000     -62.2608   -31.17533
 post_reputation |   36.35008   10.52459     3.45   0.001     15.70538    56.99478
treated_loss_r~n |  -62.55308   20.68496    -3.02   0.003     -103.128   -21.97813
treated_loss_p~n |   12.45256   26.91587     0.46   0.644    -40.34476    65.24988
          log_at |  -6.804081   2.399299    -2.84   0.005    -11.51047   -2.097693
cash_flows_by_at |  -166.1449   52.57663    -3.16   0.002    -269.2776   -63.01224
  market_to_book |  -2.058882   3.504509    -0.59   0.557    -8.933215    4.815451
     ppent_by_at |    18.8995   14.74098     1.28   0.200    -10.01593    47.81494
      debt_by_at |    48.2297     17.415     2.77   0.006     14.06899    82.39041
      cash_by_at |   32.53727      24.55     1.33   0.185    -15.61923    80.69377
    sales_growth |  -2.569699   11.19711    -0.23   0.819     -24.5336     19.3942
  dividend_payer |    7.08159   5.900038     1.20   0.230    -4.491737    18.65492
             nol |   -5.12672   5.695498    -0.90   0.368    -16.29883    6.045387
         ret_vol |   170.9713   56.30835     3.04   0.002     60.51863     281.424
       leveraged |   78.18288   7.843218     9.97   0.000     62.79787    93.56789
        maturity |   9.318116   1.875424     4.97   0.000     5.639343    12.99689
log_deal_amoun~d |  -14.51309   2.576154    -5.63   0.000    -19.56639   -9.459789
   secured_dummy |   55.72052   6.497081     8.58   0.000     42.97605    68.46499
tranche_type_d~y |   68.08827   4.072984    16.72   0.000     60.09883     76.0777
tranche_o_a_du~y |   5.034167   5.667284     0.89   0.375    -6.082597    16.15093
   sponsor_dummy |   80.63469   8.483444     9.50   0.000     63.99383    97.27554
           _cons |   216.8436   26.51759     8.18   0.000     164.8275    268.8597
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           0           9     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m3

. reghdfe log_margin_bps treated_loss treated_loss_post reputation post_reputation 
> treated_loss_reputation  treated_loss_post_reputation `controls' `deal_controls',
>  absorb(year ff_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      4,420
Absorbing 3 HDFE groups                           F(  23,   1480) =     108.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6977
                                                  Adj R-squared   =     0.6910
                                                  Within R-sq.    =     0.5349
Number of clusters (gvkey)   =      1,481         Root MSE        =     0.3411

                                  (Std. err. adjusted for 1,481 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
  log_margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
    treated_loss |   .1212448   .0449863     2.70   0.007     .0330011    .2094885
treated_l~s_post |   -.033816   .0593282    -0.57   0.569    -.1501923    .0825603
      reputation |  -.1574203   .0246106    -6.40   0.000    -.2056956   -.1091449
 post_reputation |   .1341529   .0326049     4.11   0.000     .0701962    .1981097
treated_loss_r~n |  -.0712263   .0559282    -1.27   0.203    -.1809333    .0384807
treated_loss_p~n |  -.0587242   .0745882    -0.79   0.431    -.2050341    .0875856
          log_at |  -.0345209   .0075118    -4.60   0.000    -.0492558   -.0197859
cash_flows_by_at |  -.5024183   .1490619    -3.37   0.001    -.7948134   -.2100232
  market_to_book |  -.0272607   .0110314    -2.47   0.014    -.0488996   -.0056218
     ppent_by_at |   .0555578   .0435032     1.28   0.202    -.0297767    .1408923
      debt_by_at |   .1711706   .0487975     3.51   0.000      .075451    .2668902
      cash_by_at |   .1692581   .0740482     2.29   0.022     .0240075    .3145086
    sales_growth |   .0225062   .0304945     0.74   0.461    -.0373109    .0823232
  dividend_payer |   .0224154   .0175672     1.28   0.202    -.0120439    .0568748
             nol |   -.009015   .0175389    -0.51   0.607    -.0434187    .0253887
         ret_vol |   .4960258   .1621606     3.06   0.002     .1779368    .8141148
       leveraged |   .4666441   .0251641    18.54   0.000      .417283    .5160053
        maturity |   .0439251   .0055949     7.85   0.000     .0329503       .0549
log_deal_amoun~d |  -.0400838   .0081522    -4.92   0.000     -.056075   -.0240927
   secured_dummy |   .1550838   .0196503     7.89   0.000     .1165384    .1936292
tranche_type_d~y |   .1929451   .0125062    15.43   0.000     .1684133    .2174769
tranche_o_a_du~y |    .006028   .0168542     0.36   0.721    -.0270327    .0390887
   sponsor_dummy |   .2549247   .0248511    10.26   0.000     .2061775    .3036719
           _cons |    5.13753   .0814506    63.08   0.000     4.977759    5.297301
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |         9           0           9     |
         ff_48 |        49           1          48     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. estimates store m4

. 
. * save the results (esttab) using overleaf_dir
. esttab m1 m2 m3 m4 using "$overleaf_dir/margin_did_both_rule_reputation.tex", rep
> lace ///
> nodepvars nomti nonum collabels(none) label b(3) se(3) parentheses ///
> star(* 0.10 ** 0.05 *** 0.01) ar2 plain lines fragment noconstant keep(`treat_var
> s' `reputation_vars')
(output written to /Users/zrsong/Dropbox (MIT)/Apps/Overleaf/M&A Debt/Tables/margin
> _did_both_rule_reputation.tex)

. est clear

. 
. ****** Split Sample Tests
. local controls "log_at cash_flows_by_at market_to_book ppent_by_at debt_by_at cas
> h_by_at sales_growth dividend_payer nol ret_vol"

. local deal_controls "leveraged maturity log_deal_amount_converted secured_dummy t
> ranche_type_dummy tranche_o_a_dummy sponsor_dummy"

. local treat_vars "treated treated_post treated_loss treated_loss_post"

. use "../3. Data/Processed/tranche_level_ds_compa_wlabel.dta", clear

. preserve

.         keep if relationship == 1
(2,744 observations deleted)

.         reghdfe margin_bps `treat_vars' `controls' `deal_controls', absorb(year f
> f_48 sp_rating_num) vce(cluster gvkey)
(MWFE estimator converged in 8 iterations)

HDFE Linear regression                            Number of obs   =      1,968
Absorbing 3 HDFE groups                           F(  21,    719) =      23.63
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5704
                                                  Adj R-squared   =     0.5489
                                                  Within R-sq.    =     0.3399
Number of clusters (gvkey)   =        720         Root MSE        =    90.5559

                                    (Std. err. adjusted for 720 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   37.08898   15.17837     2.44   0.015     7.289748     66.8882
    treated_post |  -11.68756   17.23161    -0.68   0.498    -45.51784    22.14272
    treated_loss |   9.610085   14.05931     0.68   0.494    -17.99213     37.2123
treated_l~s_post |   -14.3916   17.18966    -0.84   0.403    -48.13953    19.35633
          log_at |  -3.439161   2.870547    -1.20   0.231    -9.074816    2.196494
cash_flows_by_at |  -88.75349   64.75833    -1.37   0.171    -215.8915    38.38452
  market_to_book |  -5.627611   3.475089    -1.62   0.106    -12.45014    1.194923
     ppent_by_at |   20.14517   19.08292     1.06   0.291    -17.31973    57.61006
      debt_by_at |  -9.961339    18.1543    -0.55   0.583    -45.60311    25.68043
      cash_by_at |   51.00767   31.86113     1.60   0.110     -11.5443    113.5596
    sales_growth |   28.42911   13.81592     2.06   0.040     1.304737    55.55347
  dividend_payer |   18.37339   6.992521     2.63   0.009     4.645192    32.10159
             nol |  -10.04124   6.645782    -1.51   0.131     -23.0887    3.006212
         ret_vol |    250.509   79.36404     3.16   0.002     94.69604    406.3219
       leveraged |   85.69981   9.687019     8.85   0.000     66.68159     104.718
        maturity |   7.407861   2.386348     3.10   0.002     2.722817     12.0929
log_deal_amoun~d |  -9.334201   3.967625    -2.35   0.019    -17.12372   -1.544686
   secured_dummy |   36.43122   7.680067     4.74   0.000     21.35319    51.50926
tranche_type_d~y |   48.83239   4.786876    10.20   0.000     39.43447    58.23032
tranche_o_a_du~y |   .7376524   7.241847     0.10   0.919    -13.48004    14.95534
   sponsor_dummy |   40.39954   10.85569     3.72   0.000     19.08689    61.71219
           _cons |    151.438   33.17097     4.57   0.000     86.31445    216.5615
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        47           1          46     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. restore

. preserve

.         keep if relationship == 0
(1,968 observations deleted)

.         reghdfe margin_bps `treat_vars' `controls' `deal_controls', absorb(year f
> f_48 sp_rating_num) vce(cluster gvkey)
(dropped 1 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      2,743
Absorbing 3 HDFE groups                           F(  21,   1222) =      65.65
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5491
                                                  Adj R-squared   =     0.5331
                                                  Within R-sq.    =     0.4067
Number of clusters (gvkey)   =      1,223         Root MSE        =   134.0175

                                  (Std. err. adjusted for 1,223 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   7.809453   17.40729     0.45   0.654    -26.34203    41.96094
    treated_post |   8.568613   21.04731     0.41   0.684    -32.72425    49.86148
    treated_loss |   48.53853    16.2216     2.99   0.003     16.71325    80.36381
treated_l~s_post |  -49.63853   20.41683    -2.43   0.015    -89.69445   -9.582607
          log_at |  -5.957508   3.228798    -1.85   0.065    -12.29211    .3770932
cash_flows_by_at |    -175.13   63.19642    -2.77   0.006    -299.1155   -51.14449
  market_to_book |  -.0310894   4.132329    -0.01   0.994    -8.138335    8.076157
     ppent_by_at |   18.24372   18.06885     1.01   0.313    -17.20568    53.69313
      debt_by_at |   74.23376   22.19867     3.34   0.001     30.68203    117.7855
      cash_by_at |   32.60689   32.07312     1.02   0.310     -30.3176    95.53137
    sales_growth |  -11.11907   14.48747    -0.77   0.443    -39.54213      17.304
  dividend_payer |   5.486856   7.859307     0.70   0.485    -9.932376    20.90609
             nol |  -4.274615   7.747326    -0.55   0.581    -19.47415    10.92492
         ret_vol |   175.0141   68.27345     2.56   0.010     41.06796    308.9603
       leveraged |   74.03318   10.48596     7.06   0.000     53.46071    94.60565
        maturity |   8.855846   2.392146     3.70   0.000     4.162677    13.54901
log_deal_amoun~d |   -15.5778   3.403992    -4.58   0.000    -22.25612   -8.899485
   secured_dummy |   76.07801   8.825426     8.62   0.000     58.76334    93.39268
tranche_type_d~y |   92.90792   5.860159    15.85   0.000     81.41083     104.405
tranche_o_a_du~y |   15.07779   7.431715     2.03   0.043     .4974559    29.65813
   sponsor_dummy |   100.5389   10.57503     9.51   0.000      79.7917    121.2862
           _cons |   172.9608   34.94804     4.95   0.000      104.396    241.5256
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        47           1          46     |
 sp_rating_num |        19           1          18    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. restore

. 
. preserve

.         keep if reputation == 1
(2,047 observations deleted)

.         reghdfe margin_bps `treat_vars' `controls' `deal_controls', absorb(year f
> f_48 sp_rating_num) vce(cluster gvkey)
(dropped 1 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =      2,664
Absorbing 3 HDFE groups                           F(  21,    979) =      43.49
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5479
                                                  Adj R-squared   =     0.5314
                                                  Within R-sq.    =     0.3477
Number of clusters (gvkey)   =        980         Root MSE        =    88.8169

                                    (Std. err. adjusted for 980 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   4.293838   13.28064     0.32   0.747    -21.76796    30.35563
    treated_post |   25.40804   16.84743     1.51   0.132    -7.653194    58.46928
    treated_loss |   25.84263   11.94852     2.16   0.031      2.39498    49.29028
treated_l~s_post |   -31.2106     14.539    -2.15   0.032     -59.7418   -2.679407
          log_at |  -3.661669   2.298259    -1.59   0.111    -8.171749    .8484113
cash_flows_by_at |   34.03389   55.46662     0.61   0.540    -74.81325     142.881
  market_to_book |  -9.196393   2.274599    -4.04   0.000    -13.66004   -4.732742
     ppent_by_at |   3.846412   15.59093     0.25   0.805    -26.74907    34.44189
      debt_by_at |   36.46517   15.29708     2.38   0.017     6.446344      66.484
      cash_by_at |   32.30919   22.21188     1.45   0.146    -11.27919    75.89757
    sales_growth |  -8.997015   12.86056    -0.70   0.484    -34.23444    16.24041
  dividend_payer |   10.63391   5.669907     1.88   0.061    -.4926562    21.76048
             nol |  -2.810159   5.053669    -0.56   0.578    -12.72743    7.107111
         ret_vol |   190.9884   48.77328     3.92   0.000     95.27619    286.7006
       leveraged |   82.90631   6.362048    13.03   0.000     70.42149    95.39113
        maturity |   9.461904   1.893398     5.00   0.000     5.746318    13.17749
log_deal_amoun~d |  -5.550692   2.573475    -2.16   0.031    -10.60085   -.5005303
   secured_dummy |    32.8151   6.587278     4.98   0.000     19.88829    45.74191
tranche_type_d~y |   57.07276   4.383969    13.02   0.000      48.4697    65.67582
tranche_o_a_du~y |   5.439839    5.38453     1.01   0.313    -5.126709    16.00639
   sponsor_dummy |   41.64832   8.860196     4.70   0.000     24.26116    59.03548
           _cons |   107.1207   24.74172     4.33   0.000     58.56781    155.6736
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        48           1          47     |
 sp_rating_num |        18           1          17    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. restore

. preserve

.         keep if reputation == 0
(2,665 observations deleted)

.         reghdfe margin_bps `treat_vars' `controls' `deal_controls', absorb(year f
> f_48 sp_rating_num) vce(cluster gvkey)
(dropped 3 singleton observations)
(MWFE estimator converged in 8 iterations)

HDFE Linear regression                            Number of obs   =      2,044
Absorbing 3 HDFE groups                           F(  21,    796) =      41.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5614
                                                  Adj R-squared   =     0.5410
                                                  Within R-sq.    =     0.3936
Number of clusters (gvkey)   =        797         Root MSE        =   142.5757

                                    (Std. err. adjusted for 797 clusters in gvkey)
----------------------------------------------------------------------------------
                 |               Robust
      margin_bps | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
         treated |   -4.72615   18.64712    -0.25   0.800    -41.32948    31.87718
    treated_post |   13.81862   24.79325     0.56   0.577    -34.84927     62.4865
    treated_loss |   53.02614   19.10574     2.78   0.006     15.52256    90.52973
treated_l~s_post |   -38.6326   25.20525    -1.53   0.126    -88.10921    10.84401
          log_at |  -7.936192   4.098529    -1.94   0.053    -15.98139    .1090104
cash_flows_by_at |  -223.4757   77.97471    -2.87   0.004     -376.536   -70.41533
  market_to_book |   3.930257   6.487417     0.61   0.545     -8.80421    16.66472
     ppent_by_at |   25.10994   21.51411     1.17   0.244    -17.12115    67.34103
      debt_by_at |   56.47699   29.11361     1.94   0.053    -.6715435    113.6255
      cash_by_at |   15.83701   43.49122     0.36   0.716    -69.53402     101.208
    sales_growth |  -6.826235   17.37417    -0.39   0.695    -40.93084    27.27837
  dividend_payer |   3.102809   10.51611     0.30   0.768    -17.53977    23.74539
             nol |  -12.32397   10.35534    -1.19   0.234    -32.65097    8.003028
         ret_vol |   206.5493   97.39303     2.12   0.034      15.3718    397.7268
       leveraged |    83.5589   15.42145     5.42   0.000     53.28739    113.8304
        maturity |   6.424138   2.998117     2.14   0.032     .5389886    12.30929
log_deal_amoun~d |  -20.95029   4.174877    -5.02   0.000    -29.14536   -12.75522
   secured_dummy |   89.78749   11.86869     7.57   0.000     66.48986    113.0851
tranche_type_d~y |   86.80474    7.22813    12.01   0.000     72.61629    100.9932
tranche_o_a_du~y |   17.41053   9.592622     1.81   0.070    -1.419292    36.24036
   sponsor_dummy |   107.7677   12.78976     8.43   0.000     82.66204    132.8733
           _cons |   234.3025   45.26521     5.18   0.000     145.4492    323.1558
----------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------+
   Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------+---------------------------------------|
          year |        10           0          10     |
         ff_48 |        45           1          44     |
 sp_rating_num |        18           1          17    ?|
-------------------------------------------------------+
? = number of redundant parameters may be higher

. restore

. 
. 
. *** close log
. log close
      name:  <unnamed>
       log:  /Users/zrsong/Dropbox (MIT)/Research Projects/MPS_Interest Deductibili
> ty and Debt Contracting/4. Code/Dealscan_Analysis.log
  log type:  text
 closed on:  26 Dec 2024, 15:25:34
-----------------------------------------------------------------------------------
